/* automatically generated by rust-bindgen 0.72.0 */

pub const AERON_NULL_VALUE: i32 = -1;
pub const AERON_CLIENT_ERROR_DRIVER_TIMEOUT: i32 = -1000;
pub const AERON_CLIENT_ERROR_CLIENT_TIMEOUT: i32 = -1001;
pub const AERON_CLIENT_ERROR_CONDUCTOR_SERVICE_TIMEOUT: i32 = -1002;
pub const AERON_CLIENT_ERROR_BUFFER_FULL: i32 = -1003;
pub const AERON_CLIENT_MAX_LOCAL_ADDRESS_STR_LEN: u32 = 64;
pub const AERON_RESPONSE_ADDRESS_TYPE_IPV4: u32 = 1;
pub const AERON_RESPONSE_ADDRESS_TYPE_IPV6: u32 = 2;
pub const AERON_DIR_ENV_VAR: &[u8; 10] = b"AERON_DIR\0";
pub const AERON_DRIVER_TIMEOUT_ENV_VAR: &[u8; 21] = b"AERON_DRIVER_TIMEOUT\0";
pub const AERON_CLIENT_RESOURCE_LINGER_DURATION_ENV_VAR: &[u8; 38] =
    b"AERON_CLIENT_RESOURCE_LINGER_DURATION\0";
pub const AERON_CLIENT_IDLE_SLEEP_DURATION_ENV_VAR: &[u8; 33] =
    b"AERON_CLIENT_IDLE_SLEEP_DURATION\0";
pub const AERON_CLIENT_PRE_TOUCH_MAPPED_MEMORY_ENV_VAR: &[u8; 37] =
    b"AERON_CLIENT_PRE_TOUCH_MAPPED_MEMORY\0";
pub const AERON_CLIENT_NAME_ENV_VAR: &[u8; 18] = b"AERON_CLIENT_NAME\0";
pub const AERON_AGENT_ON_START_FUNCTION_ENV_VAR: &[u8; 30] = b"AERON_AGENT_ON_START_FUNCTION\0";
pub const AERON_COUNTER_CACHE_LINE_LENGTH: u32 = 64;
pub const AERON_COUNTER_MAX_CLIENT_NAME_LENGTH: u32 = 100;
pub const AERON_COUNTER_RECORD_UNUSED: u32 = 0;
pub const AERON_COUNTER_RECORD_ALLOCATED: u32 = 1;
pub const AERON_COUNTER_RECORD_RECLAIMED: i32 = -1;
pub const AERON_COUNTER_NOT_FREE_TO_REUSE: u64 = 9223372036854775807;

pub const AERON_UDP_CHANNEL_TRANSPORT_MEDIA_RCV_TIMESTAMP_SW: u32 = 2;
pub const AERON_UDP_CHANNEL_TRANSPORT_MEDIA_RCV_TIMESTAMP: u32 = 3;
pub const AERON_UDP_CHANNEL_TRANSPORT_CHANNEL_RCV_TIMESTAMP: u32 = 4;
pub const AERON_UDP_CHANNEL_TRANSPORT_CHANNEL_SND_TIMESTAMP: u32 = 8;
pub const AERON_UDP_DESTINATION_TRACKER_DESTINATION_TIMEOUT_NS: u64 = 5000000000;
pub const AERON_SEND_CHANNEL_ENDPOINT_DESTINATION_TIMEOUT_NS: u64 = 5000000000;
pub const AERON_RECEIVE_DESTINATION_TIMEOUT_NS: u64 = 5000000000;
pub const AERON_LOSS_DETECTOR_TIMER_INACTIVE: i32 = -1;
pub const AERON_LOSS_DETECTOR_NAK_UNICAST_DELAY_NS: u32 = 60000000;
pub const AERON_LOSS_DETECTOR_NAK_MULTICAST_GROUP_SIZE: f64 = 10.0;
pub const AERON_LOSS_DETECTOR_NAK_MULTICAST_MAX_BACKOFF_NS: f64 = 60000000.0;
pub const AERON_LOSS_REPORT_FILE: &[u8; 16] = b"loss-report.dat\0";
pub const AERON_LOSS_REPORTER_ENTRY_ALIGNMENT: u32 = 64;
pub const AERON_IMAGE_SM_EOS_MULTIPLE: u32 = 5;
pub const AERON_DRIVER_CONDUCTOR_LINGER_RESOURCE_TIMEOUT_NS: u64 = 5000000000;
pub const AERON_DRIVER_CONDUCTOR_CLOCK_UPDATE_INTERNAL_NS: u32 = 1000000;
pub const AERON_UDP_TRANSPORT_POLLER_ITERATION_THRESHOLD: u32 = 5;
pub const AERON_DRIVER_RECEIVER_PENDING_SETUP_TIMEOUT_NS: u32 = 1000000000;
pub const AERON_AGENT_RUNNER_CONDUCTOR: u32 = 0;
pub const AERON_AGENT_RUNNER_SENDER: u32 = 1;
pub const AERON_AGENT_RUNNER_RECEIVER: u32 = 2;
pub const AERON_AGENT_RUNNER_SHARED_NETWORK: u32 = 1;
pub const AERON_AGENT_RUNNER_SHARED: u32 = 0;
pub const AERON_AGENT_RUNNER_MAX: u32 = 3;
pub const AERON_URI_STRING_BUILDER_PREFIX_KEY: &[u8; 9] = b"__prefix\0";
pub const AERON_URI_STRING_BUILDER_MEDIA_KEY: &[u8; 8] = b"__media\0";
unsafe extern "C" {
    pub fn aeron_alloc_no_err(
        ptr: *mut *mut ::std::os::raw::c_void,
        size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_alloc(ptr: *mut *mut ::std::os::raw::c_void, size: usize)
    -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_alloc_aligned(
        ptr: *mut *mut ::std::os::raw::c_void,
        offset: *mut usize,
        size: usize,
        alignment: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_reallocf(
        ptr: *mut *mut ::std::os::raw::c_void,
        size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_free(ptr: *mut ::std::os::raw::c_void);
}
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_time_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_pthread_handler_rec"]
        [::std::mem::size_of::<__darwin_pthread_handler_rec>() - 24usize];
    ["Alignment of __darwin_pthread_handler_rec"]
        [::std::mem::align_of::<__darwin_pthread_handler_rec>() - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__routine"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __routine) - 0usize];
    ["Offset of field: __darwin_pthread_handler_rec::__arg"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __arg) - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__next"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __next) - 16usize];
};
impl Default for __darwin_pthread_handler_rec {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_attr_t"][::std::mem::size_of::<_opaque_pthread_attr_t>() - 64usize];
    ["Alignment of _opaque_pthread_attr_t"]
        [::std::mem::align_of::<_opaque_pthread_attr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_attr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_attr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __opaque) - 8usize];
};
impl Default for _opaque_pthread_attr_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_cond_t"][::std::mem::size_of::<_opaque_pthread_cond_t>() - 48usize];
    ["Alignment of _opaque_pthread_cond_t"]
        [::std::mem::align_of::<_opaque_pthread_cond_t>() - 8usize];
    ["Offset of field: _opaque_pthread_cond_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_cond_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __opaque) - 8usize];
};
impl Default for _opaque_pthread_cond_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutex_t"][::std::mem::size_of::<_opaque_pthread_mutex_t>() - 64usize];
    ["Alignment of _opaque_pthread_mutex_t"]
        [::std::mem::align_of::<_opaque_pthread_mutex_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutex_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutex_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __opaque) - 8usize];
};
impl Default for _opaque_pthread_mutex_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_t"][::std::mem::size_of::<_opaque_pthread_t>() - 8192usize];
    ["Alignment of _opaque_pthread_t"][::std::mem::align_of::<_opaque_pthread_t>() - 8usize];
    ["Offset of field: _opaque_pthread_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_t::__cleanup_stack"]
        [::std::mem::offset_of!(_opaque_pthread_t, __cleanup_stack) - 8usize];
    ["Offset of field: _opaque_pthread_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_t, __opaque) - 16usize];
};
impl Default for _opaque_pthread_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type pthread_attr_t = __darwin_pthread_attr_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aeron_context_stct {
    _unused: [u8; 0],
}
pub type aeron_context_t = aeron_context_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aeron_stct {
    _unused: [u8; 0],
}
pub type aeron_t = aeron_stct;
#[doc = " Structure used to hold information for a try_claim function call."]
pub type aeron_buffer_claim_t = aeron_buffer_claim_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aeron_publication_stct {
    _unused: [u8; 0],
}
pub type aeron_publication_t = aeron_publication_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aeron_exclusive_publication_stct {
    _unused: [u8; 0],
}
pub type aeron_exclusive_publication_t = aeron_exclusive_publication_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aeron_header_stct {
    _unused: [u8; 0],
}
pub type aeron_header_t = aeron_header_stct;
#[repr(C, packed(4))]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_header_values_frame_stct {
    pub frame_length: i32,
    pub version: i8,
    pub flags: u8,
    pub type_: i16,
    pub term_offset: i32,
    pub session_id: i32,
    pub stream_id: i32,
    pub term_id: i32,
    pub reserved_value: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_header_values_frame_stct"]
        [::std::mem::size_of::<aeron_header_values_frame_stct>() - 32usize];
    ["Alignment of aeron_header_values_frame_stct"]
        [::std::mem::align_of::<aeron_header_values_frame_stct>() - 4usize];
    ["Offset of field: aeron_header_values_frame_stct::frame_length"]
        [::std::mem::offset_of!(aeron_header_values_frame_stct, frame_length) - 0usize];
    ["Offset of field: aeron_header_values_frame_stct::version"]
        [::std::mem::offset_of!(aeron_header_values_frame_stct, version) - 4usize];
    ["Offset of field: aeron_header_values_frame_stct::flags"]
        [::std::mem::offset_of!(aeron_header_values_frame_stct, flags) - 5usize];
    ["Offset of field: aeron_header_values_frame_stct::type_"]
        [::std::mem::offset_of!(aeron_header_values_frame_stct, type_) - 6usize];
    ["Offset of field: aeron_header_values_frame_stct::term_offset"]
        [::std::mem::offset_of!(aeron_header_values_frame_stct, term_offset) - 8usize];
    ["Offset of field: aeron_header_values_frame_stct::session_id"]
        [::std::mem::offset_of!(aeron_header_values_frame_stct, session_id) - 12usize];
    ["Offset of field: aeron_header_values_frame_stct::stream_id"]
        [::std::mem::offset_of!(aeron_header_values_frame_stct, stream_id) - 16usize];
    ["Offset of field: aeron_header_values_frame_stct::term_id"]
        [::std::mem::offset_of!(aeron_header_values_frame_stct, term_id) - 20usize];
    ["Offset of field: aeron_header_values_frame_stct::reserved_value"]
        [::std::mem::offset_of!(aeron_header_values_frame_stct, reserved_value) - 24usize];
};
pub type aeron_header_values_frame_t = aeron_header_values_frame_stct;
#[repr(C, packed(4))]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_header_values_stct {
    pub frame: aeron_header_values_frame_t,
    pub initial_term_id: i32,
    pub position_bits_to_shift: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_header_values_stct"]
        [::std::mem::size_of::<aeron_header_values_stct>() - 44usize];
    ["Alignment of aeron_header_values_stct"]
        [::std::mem::align_of::<aeron_header_values_stct>() - 4usize];
    ["Offset of field: aeron_header_values_stct::frame"]
        [::std::mem::offset_of!(aeron_header_values_stct, frame) - 0usize];
    ["Offset of field: aeron_header_values_stct::initial_term_id"]
        [::std::mem::offset_of!(aeron_header_values_stct, initial_term_id) - 32usize];
    ["Offset of field: aeron_header_values_stct::position_bits_to_shift"]
        [::std::mem::offset_of!(aeron_header_values_stct, position_bits_to_shift) - 36usize];
};
pub type aeron_header_values_t = aeron_header_values_stct;
#[repr(C, packed(4))]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_publication_error_values_stct {
    pub registration_id: i64,
    pub destination_registration_id: i64,
    pub session_id: i32,
    pub stream_id: i32,
    pub receiver_id: i64,
    pub group_tag: i64,
    pub address_type: i16,
    pub source_port: u16,
    pub source_address: [u8; 16usize],
    pub error_code: i32,
    pub error_message_length: i32,
    pub error_message: [u8; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_publication_error_values_stct"]
        [::std::mem::size_of::<aeron_publication_error_values_stct>() - 72usize];
    ["Alignment of aeron_publication_error_values_stct"]
        [::std::mem::align_of::<aeron_publication_error_values_stct>() - 4usize];
    ["Offset of field: aeron_publication_error_values_stct::registration_id"]
        [::std::mem::offset_of!(aeron_publication_error_values_stct, registration_id) - 0usize];
    ["Offset of field: aeron_publication_error_values_stct::destination_registration_id"][::std::mem::offset_of!(
        aeron_publication_error_values_stct,
        destination_registration_id
    )
        - 8usize];
    ["Offset of field: aeron_publication_error_values_stct::session_id"]
        [::std::mem::offset_of!(aeron_publication_error_values_stct, session_id) - 16usize];
    ["Offset of field: aeron_publication_error_values_stct::stream_id"]
        [::std::mem::offset_of!(aeron_publication_error_values_stct, stream_id) - 20usize];
    ["Offset of field: aeron_publication_error_values_stct::receiver_id"]
        [::std::mem::offset_of!(aeron_publication_error_values_stct, receiver_id) - 24usize];
    ["Offset of field: aeron_publication_error_values_stct::group_tag"]
        [::std::mem::offset_of!(aeron_publication_error_values_stct, group_tag) - 32usize];
    ["Offset of field: aeron_publication_error_values_stct::address_type"]
        [::std::mem::offset_of!(aeron_publication_error_values_stct, address_type) - 40usize];
    ["Offset of field: aeron_publication_error_values_stct::source_port"]
        [::std::mem::offset_of!(aeron_publication_error_values_stct, source_port) - 42usize];
    ["Offset of field: aeron_publication_error_values_stct::source_address"]
        [::std::mem::offset_of!(aeron_publication_error_values_stct, source_address) - 44usize];
    ["Offset of field: aeron_publication_error_values_stct::error_code"]
        [::std::mem::offset_of!(aeron_publication_error_values_stct, error_code) - 60usize];
    ["Offset of field: aeron_publication_error_values_stct::error_message_length"][::std::mem::offset_of!(
        aeron_publication_error_values_stct,
        error_message_length
    ) - 64usize];
    ["Offset of field: aeron_publication_error_values_stct::error_message"]
        [::std::mem::offset_of!(aeron_publication_error_values_stct, error_message) - 68usize];
};
pub type aeron_publication_error_values_t = aeron_publication_error_values_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aeron_subscription_stct {
    _unused: [u8; 0],
}
pub type aeron_subscription_t = aeron_subscription_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aeron_image_stct {
    _unused: [u8; 0],
}
pub type aeron_image_t = aeron_image_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aeron_counter_stct {
    _unused: [u8; 0],
}
pub type aeron_counter_t = aeron_counter_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aeron_log_buffer_stct {
    _unused: [u8; 0],
}
pub type aeron_log_buffer_t = aeron_log_buffer_stct;
pub type aeron_counters_reader_t = aeron_counters_reader_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aeron_client_registering_resource_stct {
    _unused: [u8; 0],
}
pub type aeron_async_add_publication_t = aeron_client_registering_resource_stct;
pub type aeron_async_add_exclusive_publication_t = aeron_client_registering_resource_stct;
pub type aeron_async_add_subscription_t = aeron_client_registering_resource_stct;
pub type aeron_async_add_counter_t = aeron_client_registering_resource_stct;
pub type aeron_async_destination_t = aeron_client_registering_resource_stct;
pub type aeron_async_destination_by_id_t = aeron_client_registering_resource_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aeron_image_fragment_assembler_stct {
    _unused: [u8; 0],
}
pub type aeron_image_fragment_assembler_t = aeron_image_fragment_assembler_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aeron_image_controlled_fragment_assembler_stct {
    _unused: [u8; 0],
}
pub type aeron_image_controlled_fragment_assembler_t =
    aeron_image_controlled_fragment_assembler_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aeron_fragment_assembler_stct {
    _unused: [u8; 0],
}
pub type aeron_fragment_assembler_t = aeron_fragment_assembler_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aeron_controlled_fragment_assembler_stct {
    _unused: [u8; 0],
}
pub type aeron_controlled_fragment_assembler_t = aeron_controlled_fragment_assembler_stct;
unsafe extern "C" {
    pub fn aeron_context_set_dir(
        context: *mut aeron_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_get_dir(context: *mut aeron_context_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_context_set_driver_timeout_ms(
        context: *mut aeron_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_get_driver_timeout_ms(context: *mut aeron_context_t) -> u64;
}
unsafe extern "C" {
    pub fn aeron_context_set_keepalive_interval_ns(
        context: *mut aeron_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_get_keepalive_interval_ns(context: *mut aeron_context_t) -> u64;
}
unsafe extern "C" {
    pub fn aeron_context_set_resource_linger_duration_ns(
        context: *mut aeron_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_get_resource_linger_duration_ns(context: *mut aeron_context_t) -> u64;
}
unsafe extern "C" {
    pub fn aeron_context_get_idle_sleep_duration_ns(context: *mut aeron_context_t) -> u64;
}
unsafe extern "C" {
    pub fn aeron_context_set_idle_sleep_duration_ns(
        context: *mut aeron_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_set_pre_touch_mapped_memory(
        context: *mut aeron_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_get_pre_touch_mapped_memory(context: *mut aeron_context_t) -> bool;
}
unsafe extern "C" {
    pub fn aeron_context_set_client_name(
        context: *mut aeron_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_get_client_name(
        context: *mut aeron_context_t,
    ) -> *const ::std::os::raw::c_char;
}
#[doc = " The error handler to be called when an error occurs."]
pub type aeron_error_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        errcode: ::std::os::raw::c_int,
        message: *const ::std::os::raw::c_char,
    ),
>;
#[doc = " The error frame handler to be called when the driver notifies the client about an error frame being received.\n The data passed to this callback will only be valid for the lifetime of the callback. The user should use\n <code>aeron_publication_error_values_copy</code> if they require the data to live longer than that."]
pub type aeron_publication_error_frame_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        error_frame: *mut aeron_publication_error_values_t,
    ),
>;
unsafe extern "C" {
    #[doc = " Copy an existing aeron_publication_error_values_t to the supplied pointer. The caller is responsible for freeing the\n allocated memory using aeron_publication_error_values_delete when the copy is not longer required.\n\n @param dst to copy the values to.\n @param src to copy the values from.\n @return 0 if this is successful, -1 otherwise. Will set aeron_errcode() and aeron_errmsg() on failure."]
    pub fn aeron_publication_error_values_copy(
        dst: *mut *mut aeron_publication_error_values_t,
        src: *mut aeron_publication_error_values_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Delete a instance of aeron_publication_error_values_t that was created when making a copy\n (aeron_publication_error_values_copy). This should not be use on the pointer received via the aeron_frame_handler_t.\n @param to_delete to be deleted."]
    pub fn aeron_publication_error_values_delete(to_delete: *mut aeron_publication_error_values_t);
}
#[doc = " Generalised notification callback."]
pub type aeron_notification_t =
    ::std::option::Option<unsafe extern "C" fn(clientd: *mut ::std::os::raw::c_void)>;
unsafe extern "C" {
    pub fn aeron_context_set_error_handler(
        context: *mut aeron_context_t,
        handler: aeron_error_handler_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_get_error_handler(context: *mut aeron_context_t) -> aeron_error_handler_t;
}
unsafe extern "C" {
    pub fn aeron_context_get_error_handler_clientd(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn aeron_context_set_publication_error_frame_handler(
        context: *mut aeron_context_t,
        handler: aeron_publication_error_frame_handler_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_get_publication_error_frame_handler(
        context: *mut aeron_context_t,
    ) -> aeron_publication_error_frame_handler_t;
}
unsafe extern "C" {
    pub fn aeron_context_get_publication_error_frame_handler_clientd(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
#[doc = " Function called by aeron_client_t to deliver notification that the media driver has added an aeron_publication_t\n or aeron_exclusive_publication_t successfully.\n\n Implementations should do the minimum work for passing off state to another thread for later processing.\n\n @param clientd to be returned in the call\n @param async associated with the original add publication call\n @param channel of the publication\n @param stream_id within the channel of the publication\n @param session_id of the publication\n @param correlation_id used by the publication"]
pub type aeron_on_new_publication_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        async_: *mut aeron_async_add_publication_t,
        channel: *const ::std::os::raw::c_char,
        stream_id: i32,
        session_id: i32,
        correlation_id: i64,
    ),
>;
unsafe extern "C" {
    pub fn aeron_context_set_on_new_publication(
        context: *mut aeron_context_t,
        handler: aeron_on_new_publication_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_get_on_new_publication(
        context: *mut aeron_context_t,
    ) -> aeron_on_new_publication_t;
}
unsafe extern "C" {
    pub fn aeron_context_get_on_new_publication_clientd(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn aeron_context_set_on_new_exclusive_publication(
        context: *mut aeron_context_t,
        handler: aeron_on_new_publication_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_get_on_new_exclusive_publication(
        context: *mut aeron_context_t,
    ) -> aeron_on_new_publication_t;
}
unsafe extern "C" {
    pub fn aeron_context_get_on_new_exclusive_publication_clientd(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
#[doc = " Function called by aeron_client_t to deliver notification that the media driver has added an aeron_subscription_t\n successfully.\n\n Implementations should do the minimum work for handing off state to another thread for later processing.\n\n @param clientd to be returned in the call\n @param async associated with the original aeron_add_async_subscription call\n @param channel of the subscription\n @param stream_id within the channel of the subscription\n @param session_id of the subscription\n @param correlation_id used by the subscription"]
pub type aeron_on_new_subscription_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        async_: *mut aeron_async_add_subscription_t,
        channel: *const ::std::os::raw::c_char,
        stream_id: i32,
        correlation_id: i64,
    ),
>;
unsafe extern "C" {
    pub fn aeron_context_set_on_new_subscription(
        context: *mut aeron_context_t,
        handler: aeron_on_new_subscription_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_get_on_new_subscription(
        context: *mut aeron_context_t,
    ) -> aeron_on_new_subscription_t;
}
unsafe extern "C" {
    pub fn aeron_context_get_on_new_subscription_clientd(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
#[doc = " Function called by aeron_client_t to deliver notifications that an aeron_image_t was added.\n\n @param clientd to be returned in the call.\n @param subscription that image is part of.\n @param image that has become available."]
pub type aeron_on_available_image_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        subscription: *mut aeron_subscription_t,
        image: *mut aeron_image_t,
    ),
>;
#[doc = " Function called by aeron_client_t to deliver notifications that an aeron_image_t has been removed from use and\n should not be used any longer.\n\n @param clientd to be returned in the call.\n @param subscription that image is part of.\n @param image that has become unavailable."]
pub type aeron_on_unavailable_image_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        subscription: *mut aeron_subscription_t,
        image: *mut aeron_image_t,
    ),
>;
#[doc = " Function called by aeron_client_t to deliver notifications that a counter has been added to the driver.\n\n @param clientd to be returned in the call.\n @param counters_reader that holds the counter.\n @param registration_id of the counter.\n @param counter_id of the counter."]
pub type aeron_on_available_counter_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        counters_reader: *mut aeron_counters_reader_t,
        registration_id: i64,
        counter_id: i32,
    ),
>;
unsafe extern "C" {
    pub fn aeron_context_set_on_available_counter(
        context: *mut aeron_context_t,
        handler: aeron_on_available_counter_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_get_on_available_counter(
        context: *mut aeron_context_t,
    ) -> aeron_on_available_counter_t;
}
unsafe extern "C" {
    pub fn aeron_context_get_on_available_counter_clientd(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
#[doc = " Function called by aeron_client_t to deliver notifications that a counter has been removed from the driver.\n\n @param clientd to be returned in the call.\n @param counters_reader that holds the counter.\n @param registration_id of the counter.\n @param counter_id of the counter."]
pub type aeron_on_unavailable_counter_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        counters_reader: *mut aeron_counters_reader_t,
        registration_id: i64,
        counter_id: i32,
    ),
>;
unsafe extern "C" {
    pub fn aeron_context_set_on_unavailable_counter(
        context: *mut aeron_context_t,
        handler: aeron_on_unavailable_counter_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_get_on_unavailable_counter(
        context: *mut aeron_context_t,
    ) -> aeron_on_unavailable_counter_t;
}
unsafe extern "C" {
    pub fn aeron_context_get_on_unavailable_counter_clientd(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
#[doc = " Function called by aeron_client_t to deliver notifications that the client is closing.\n\n @param clientd to be returned in the call."]
pub type aeron_on_close_client_t =
    ::std::option::Option<unsafe extern "C" fn(clientd: *mut ::std::os::raw::c_void)>;
unsafe extern "C" {
    pub fn aeron_context_set_on_close_client(
        context: *mut aeron_context_t,
        handler: aeron_on_close_client_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_get_on_close_client(
        context: *mut aeron_context_t,
    ) -> aeron_on_close_client_t;
}
unsafe extern "C" {
    pub fn aeron_context_get_on_close_client_clientd(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " Whether to use an invoker to control the conductor agent or spawn a thread."]
    pub fn aeron_context_set_use_conductor_agent_invoker(
        context: *mut aeron_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_get_use_conductor_agent_invoker(context: *mut aeron_context_t) -> bool;
}
pub type aeron_agent_on_start_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        state: *mut ::std::os::raw::c_void,
        role_name: *const ::std::os::raw::c_char,
    ),
>;
unsafe extern "C" {
    pub fn aeron_context_set_agent_on_start_function(
        context: *mut aeron_context_t,
        value: aeron_agent_on_start_func_t,
        state: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_context_get_agent_on_start_function(
        context: *mut aeron_context_t,
    ) -> aeron_agent_on_start_func_t;
}
unsafe extern "C" {
    pub fn aeron_context_get_agent_on_start_state(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " Create a aeron_context_t struct and initialize with default values.\n\n @param context to create and initialize\n @return 0 for success and -1 for error."]
    pub fn aeron_context_init(context: *mut *mut aeron_context_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Close and delete aeron_context_t struct.\n\n @param context to close and delete\n @return 0 for success and -1 for error."]
    pub fn aeron_context_close(context: *mut aeron_context_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Create a aeron_t client struct and initialize from the aeron_context_t struct.\n\n The given aeron_context_t struct will be used exclusively by the client. Do not reuse between clients.\n\n @param aeron  client to create and initialize.\n @param context to use for initialization.\n @return 0 for success and -1 for error."]
    pub fn aeron_init(
        client: *mut *mut aeron_t,
        context: *mut aeron_context_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Start an aeron_t. This may spawn a thread for the Client Conductor.\n\n @param client to start.\n @return 0 for success and -1 for error."]
    pub fn aeron_start(client: *mut aeron_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Call the Conductor main do_work duty cycle once.\n\n Client must have been created with use conductor invoker set to true.\n\n @param client to call do_work duty cycle on.\n @return 0 for success and -1 for error."]
    pub fn aeron_main_do_work(client: *mut aeron_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Call the Conductor Idle Strategy.\n\n @param client to idle.\n @param work_count to pass to idle strategy."]
    pub fn aeron_main_idle_strategy(client: *mut aeron_t, work_count: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " Close and delete aeron_t struct.\n\n @param client to close and delete\n @return 0 for success and -1 for error."]
    pub fn aeron_close(client: *mut aeron_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Determines if the client has been closed, e.g. via a driver timeout. Don't call this method after calling\n aeron_close as that will have already freed the associated memory.\n\n @param client to check if closed.\n @return true if it has been closed, false otherwise."]
    pub fn aeron_is_closed(client: *mut aeron_t) -> bool;
}
unsafe extern "C" {
    #[doc = " Call stream_out to print the counter labels and values.\n\n @param client to get the counters from.\n @param stream_out to call for each label and value."]
    pub fn aeron_print_counters(
        client: *mut aeron_t,
        stream_out: ::std::option::Option<
            unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char),
        >,
    );
}
unsafe extern "C" {
    #[doc = " Return the aeron_context_t that is in use by the given client.\n\n @param client to return the aeron_context_t for.\n @return the aeron_context_t for the given client or NULL for an error."]
    pub fn aeron_context(client: *mut aeron_t) -> *mut aeron_context_t;
}
unsafe extern "C" {
    #[doc = " Return the client id in use by the client.\n\n @param client to return the client id for.\n @return id value or -1 for an error."]
    pub fn aeron_client_id(client: *mut aeron_t) -> i64;
}
unsafe extern "C" {
    #[doc = " Return a unique correlation id from the driver.\n\n @param client to use to get the id.\n @return unique correlation id or -1 for an error."]
    pub fn aeron_next_correlation_id(client: *mut aeron_t) -> i64;
}
unsafe extern "C" {
    #[doc = " Asynchronously add a publication using the given client and return an object to use to determine when the\n publication is available.\n\n @param async object to use for polling completion.\n @param client to add the publication to.\n @param uri for the channel of the publication.\n @param stream_id for the publication.\n @return 0 for success or -1 for an error."]
    pub fn aeron_async_add_publication(
        async_: *mut *mut aeron_async_add_publication_t,
        client: *mut aeron_t,
        uri: *const ::std::os::raw::c_char,
        stream_id: i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Poll the completion of the aeron_async_add_publication call.\n\n @param publication to set if completed successfully.\n @param async to check for completion.\n @return 0 for not complete (try again), 1 for completed successfully, or -1 for an error."]
    pub fn aeron_async_add_publication_poll(
        publication: *mut *mut aeron_publication_t,
        async_: *mut aeron_async_add_publication_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Asynchronously add an exclusive publication using the given client and return an object to use to determine when the\n publication is available.\n\n @param async object to use for polling completion.\n @param client to add the publication to.\n @param uri for the channel of the publication.\n @param stream_id for the publication.\n @return 0 for success or -1 for an error."]
    pub fn aeron_async_add_exclusive_publication(
        async_: *mut *mut aeron_async_add_exclusive_publication_t,
        client: *mut aeron_t,
        uri: *const ::std::os::raw::c_char,
        stream_id: i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Poll the completion of the aeron_async_add_exclusive_publication call.\n\n @param publication to set if completed successfully.\n @param async to check for completion.\n @return 0 for not complete (try again), 1 for completed successfully, or -1 for an error."]
    pub fn aeron_async_add_exclusive_publication_poll(
        publication: *mut *mut aeron_exclusive_publication_t,
        async_: *mut aeron_async_add_exclusive_publication_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Asynchronously add a subscription using the given client and return an object to use to determine when the\n subscription is available.\n\n @param async object to use for polling completion.\n @param client to add the subscription to.\n @param uri for the channel of the subscription.\n @param stream_id for the subscription.\n @param on_available_image_handler to be called when images become available on the subscription.\n @param on_available_image_clientd to be passed when images become available on the subscription.\n @param on_unavailable_image_handler to be called when images go unavailable on the subscription.\n @param on_unavailable_image_clientd to be passed when images go unavailable on the subscription.\n @return 0 for success or -1 for an error."]
    pub fn aeron_async_add_subscription(
        async_: *mut *mut aeron_async_add_subscription_t,
        client: *mut aeron_t,
        uri: *const ::std::os::raw::c_char,
        stream_id: i32,
        on_available_image_handler: aeron_on_available_image_t,
        on_available_image_clientd: *mut ::std::os::raw::c_void,
        on_unavailable_image_handler: aeron_on_unavailable_image_t,
        on_unavailable_image_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Poll the completion of the aeron_async_add_subscription call.\n\n @param subscription to set if completed successfully.\n @param async to check for completion.\n @return 0 for not complete (try again), 1 for completed successfully, or -1 for an error."]
    pub fn aeron_async_add_subscription_poll(
        subscription: *mut *mut aeron_subscription_t,
        async_: *mut aeron_async_add_subscription_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Return a reference to the counters reader of the given client.\n\n The aeron_counters_reader_t is maintained by the client. And should not be freed.\n\n @param client that contains the counters reader.\n @return aeron_counters_reader_t or NULL for error."]
    pub fn aeron_counters_reader(client: *mut aeron_t) -> *mut aeron_counters_reader_t;
}
unsafe extern "C" {
    #[doc = " Asynchronously add a counter using the given client and return an object to use to determine when the\n counter is available.\n\n @param async object to use for polling completion.\n @param client to add the counter to.\n @param type_id for the counter.\n @param key_buffer for the counter.\n @param key_buffer_length for the counter.\n @param label_buffer for the counter.\n @param label_buffer_length for the counter.\n @return 0 for success or -1 for an error."]
    pub fn aeron_async_add_counter(
        async_: *mut *mut aeron_async_add_counter_t,
        client: *mut aeron_t,
        type_id: i32,
        key_buffer: *const u8,
        key_buffer_length: usize,
        label_buffer: *const ::std::os::raw::c_char,
        label_buffer_length: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Poll the completion of the <code>aeron_async_add_counter</code> or <code>aeron_async_add_static_counter</code> calls.\n\n @param counter to set if completed successfully.\n @param async to check for completion.\n @return 0 for not complete (try again), 1 for completed successfully, or -1 for an error."]
    pub fn aeron_async_add_counter_poll(
        counter: *mut *mut aeron_counter_t,
        async_: *mut aeron_async_add_counter_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Asynchronously allocates or returns an existing static counter instance using specified <code>type_id</code> and\n <code>registration_id</code>. Such counter cannot be deleted and its lifecycle is decoupled from the client that created it.\n Returns an object to use to determine when the counter is available.\n\n @param async object to use for polling completion.\n @param client to add the counter to.\n @param type_id for the counter.\n @param key_buffer for the counter.\n @param key_buffer_length for the counter.\n @param label_buffer for the counter.\n @param label_buffer_length for the counter.\n @param registration_id that uniquely identifies the counter.\n @return 0 for success or -1 for an error."]
    pub fn aeron_async_add_static_counter(
        async_: *mut *mut aeron_async_add_counter_t,
        client: *mut aeron_t,
        type_id: i32,
        key_buffer: *const u8,
        key_buffer_length: usize,
        label_buffer: *const ::std::os::raw::c_char,
        label_buffer_length: usize,
        registration_id: i64,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_on_available_counter_pair_stct {
    pub handler: aeron_on_available_counter_t,
    pub clientd: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_on_available_counter_pair_stct"]
        [::std::mem::size_of::<aeron_on_available_counter_pair_stct>() - 16usize];
    ["Alignment of aeron_on_available_counter_pair_stct"]
        [::std::mem::align_of::<aeron_on_available_counter_pair_stct>() - 8usize];
    ["Offset of field: aeron_on_available_counter_pair_stct::handler"]
        [::std::mem::offset_of!(aeron_on_available_counter_pair_stct, handler) - 0usize];
    ["Offset of field: aeron_on_available_counter_pair_stct::clientd"]
        [::std::mem::offset_of!(aeron_on_available_counter_pair_stct, clientd) - 8usize];
};
impl Default for aeron_on_available_counter_pair_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_on_available_counter_pair_t = aeron_on_available_counter_pair_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_on_unavailable_counter_pair_stct {
    pub handler: aeron_on_unavailable_counter_t,
    pub clientd: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_on_unavailable_counter_pair_stct"]
        [::std::mem::size_of::<aeron_on_unavailable_counter_pair_stct>() - 16usize];
    ["Alignment of aeron_on_unavailable_counter_pair_stct"]
        [::std::mem::align_of::<aeron_on_unavailable_counter_pair_stct>() - 8usize];
    ["Offset of field: aeron_on_unavailable_counter_pair_stct::handler"]
        [::std::mem::offset_of!(aeron_on_unavailable_counter_pair_stct, handler) - 0usize];
    ["Offset of field: aeron_on_unavailable_counter_pair_stct::clientd"]
        [::std::mem::offset_of!(aeron_on_unavailable_counter_pair_stct, clientd) - 8usize];
};
impl Default for aeron_on_unavailable_counter_pair_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_on_unavailable_counter_pair_t = aeron_on_unavailable_counter_pair_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_on_close_client_pair_stct {
    pub handler: aeron_on_close_client_t,
    pub clientd: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_on_close_client_pair_stct"]
        [::std::mem::size_of::<aeron_on_close_client_pair_stct>() - 16usize];
    ["Alignment of aeron_on_close_client_pair_stct"]
        [::std::mem::align_of::<aeron_on_close_client_pair_stct>() - 8usize];
    ["Offset of field: aeron_on_close_client_pair_stct::handler"]
        [::std::mem::offset_of!(aeron_on_close_client_pair_stct, handler) - 0usize];
    ["Offset of field: aeron_on_close_client_pair_stct::clientd"]
        [::std::mem::offset_of!(aeron_on_close_client_pair_stct, clientd) - 8usize];
};
impl Default for aeron_on_close_client_pair_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_on_close_client_pair_t = aeron_on_close_client_pair_stct;
unsafe extern "C" {
    #[doc = " Add a handler to be called when a new counter becomes available.\n\n NOTE: This function blocks until the handler is added by the client conductor thread.\n\n @param client for the counter\n @param pair holding the handler to call and a clientd to pass when called.\n @return 0 for success and -1 for error"]
    pub fn aeron_add_available_counter_handler(
        client: *mut aeron_t,
        pair: *mut aeron_on_available_counter_pair_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Remove a previously added handler to be called when a new counter becomes available.\n\n NOTE: This function blocks until the handler is removed by the client conductor thread.\n\n @param client for the counter\n @param pair holding the handler to call and a clientd to pass when called.\n @return 0 for success and -1 for error"]
    pub fn aeron_remove_available_counter_handler(
        client: *mut aeron_t,
        pair: *mut aeron_on_available_counter_pair_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Add a handler to be called when a new counter becomes unavailable or goes away.\n\n NOTE: This function blocks until the handler is added by the client conductor thread.\n\n @param client for the counter\n @param pair holding the handler to call and a clientd to pass when called.\n @return 0 for success and -1 for error"]
    pub fn aeron_add_unavailable_counter_handler(
        client: *mut aeron_t,
        pair: *mut aeron_on_unavailable_counter_pair_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Remove a previously added handler to be called when a new counter becomes unavailable or goes away.\n\n NOTE: This function blocks until the handler is removed by the client conductor thread.\n\n @param client for the counter\n @param pair holding the handler to call and a clientd to pass when called.\n @return 0 for success and -1 for error"]
    pub fn aeron_remove_unavailable_counter_handler(
        client: *mut aeron_t,
        pair: *mut aeron_on_unavailable_counter_pair_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Add a handler to be called when client is closed.\n\n NOTE: This function blocks until the handler is added by the client conductor thread.\n\n @param client for the counter\n @param pair holding the handler to call and a clientd to pass when called.\n @return 0 for success and -1 for error"]
    pub fn aeron_add_close_handler(
        client: *mut aeron_t,
        pair: *mut aeron_on_close_client_pair_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Remove a previously added handler to be called when client is closed.\n\n NOTE: This function blocks until the handler is removed by the client conductor thread.\n\n @param client for the counter\n @param pair holding the handler to call and a clientd to pass when called.\n @return 0 for success and -1 for error"]
    pub fn aeron_remove_close_handler(
        client: *mut aeron_t,
        pair: *mut aeron_on_close_client_pair_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_counter_value_descriptor_stct {
    pub counter_value: i64,
    pub registration_id: i64,
    pub owner_id: i64,
    pub reference_id: i64,
    pub pad1: [u8; 96usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_counter_value_descriptor_stct"]
        [::std::mem::size_of::<aeron_counter_value_descriptor_stct>() - 128usize];
    ["Alignment of aeron_counter_value_descriptor_stct"]
        [::std::mem::align_of::<aeron_counter_value_descriptor_stct>() - 4usize];
    ["Offset of field: aeron_counter_value_descriptor_stct::counter_value"]
        [::std::mem::offset_of!(aeron_counter_value_descriptor_stct, counter_value) - 0usize];
    ["Offset of field: aeron_counter_value_descriptor_stct::registration_id"]
        [::std::mem::offset_of!(aeron_counter_value_descriptor_stct, registration_id) - 8usize];
    ["Offset of field: aeron_counter_value_descriptor_stct::owner_id"]
        [::std::mem::offset_of!(aeron_counter_value_descriptor_stct, owner_id) - 16usize];
    ["Offset of field: aeron_counter_value_descriptor_stct::reference_id"]
        [::std::mem::offset_of!(aeron_counter_value_descriptor_stct, reference_id) - 24usize];
    ["Offset of field: aeron_counter_value_descriptor_stct::pad1"]
        [::std::mem::offset_of!(aeron_counter_value_descriptor_stct, pad1) - 32usize];
};
impl Default for aeron_counter_value_descriptor_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_counter_value_descriptor_t = aeron_counter_value_descriptor_stct;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_counter_metadata_descriptor_stct {
    pub state: i32,
    pub type_id: i32,
    pub free_for_reuse_deadline_ms: i64,
    pub key: [u8; 112usize],
    pub label_length: i32,
    pub label: [u8; 380usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_counter_metadata_descriptor_stct"]
        [::std::mem::size_of::<aeron_counter_metadata_descriptor_stct>() - 512usize];
    ["Alignment of aeron_counter_metadata_descriptor_stct"]
        [::std::mem::align_of::<aeron_counter_metadata_descriptor_stct>() - 4usize];
    ["Offset of field: aeron_counter_metadata_descriptor_stct::state"]
        [::std::mem::offset_of!(aeron_counter_metadata_descriptor_stct, state) - 0usize];
    ["Offset of field: aeron_counter_metadata_descriptor_stct::type_id"]
        [::std::mem::offset_of!(aeron_counter_metadata_descriptor_stct, type_id) - 4usize];
    ["Offset of field: aeron_counter_metadata_descriptor_stct::free_for_reuse_deadline_ms"][::std::mem::offset_of!(
        aeron_counter_metadata_descriptor_stct,
        free_for_reuse_deadline_ms
    )
        - 8usize];
    ["Offset of field: aeron_counter_metadata_descriptor_stct::key"]
        [::std::mem::offset_of!(aeron_counter_metadata_descriptor_stct, key) - 16usize];
    ["Offset of field: aeron_counter_metadata_descriptor_stct::label_length"]
        [::std::mem::offset_of!(aeron_counter_metadata_descriptor_stct, label_length) - 128usize];
    ["Offset of field: aeron_counter_metadata_descriptor_stct::label"]
        [::std::mem::offset_of!(aeron_counter_metadata_descriptor_stct, label) - 132usize];
};
impl Default for aeron_counter_metadata_descriptor_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_counter_metadata_descriptor_t = aeron_counter_metadata_descriptor_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_counters_reader_buffers_stct {
    pub values: *mut u8,
    pub metadata: *mut u8,
    pub values_length: usize,
    pub metadata_length: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_counters_reader_buffers_stct"]
        [::std::mem::size_of::<aeron_counters_reader_buffers_stct>() - 32usize];
    ["Alignment of aeron_counters_reader_buffers_stct"]
        [::std::mem::align_of::<aeron_counters_reader_buffers_stct>() - 8usize];
    ["Offset of field: aeron_counters_reader_buffers_stct::values"]
        [::std::mem::offset_of!(aeron_counters_reader_buffers_stct, values) - 0usize];
    ["Offset of field: aeron_counters_reader_buffers_stct::metadata"]
        [::std::mem::offset_of!(aeron_counters_reader_buffers_stct, metadata) - 8usize];
    ["Offset of field: aeron_counters_reader_buffers_stct::values_length"]
        [::std::mem::offset_of!(aeron_counters_reader_buffers_stct, values_length) - 16usize];
    ["Offset of field: aeron_counters_reader_buffers_stct::metadata_length"]
        [::std::mem::offset_of!(aeron_counters_reader_buffers_stct, metadata_length) - 24usize];
};
impl Default for aeron_counters_reader_buffers_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_counters_reader_buffers_t = aeron_counters_reader_buffers_stct;
unsafe extern "C" {
    #[doc = " Get buffer pointers and lengths for the counters reader.\n\n @param reader reader containing the buffers.\n @param buffers output structure to return the buffers.\n @return -1 on failure, 0 on success."]
    pub fn aeron_counters_reader_get_buffers(
        reader: *mut aeron_counters_reader_t,
        buffers: *mut aeron_counters_reader_buffers_t,
    ) -> ::std::os::raw::c_int;
}
#[doc = " Function called by aeron_counters_reader_foreach_counter for each counter in the aeron_counters_reader_t.\n\n @param value of the counter.\n @param id of the counter.\n @param label for the counter.\n @param label_length for the counter.\n @param clientd to be returned in the call"]
pub type aeron_counters_reader_foreach_counter_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        value: i64,
        id: i32,
        type_id: i32,
        key: *const u8,
        key_length: usize,
        label: *const ::std::os::raw::c_char,
        label_length: usize,
        clientd: *mut ::std::os::raw::c_void,
    ),
>;
unsafe extern "C" {
    #[doc = " Iterate over the counters in the counters_reader and call the given function for each counter.\n\n @param counters_reader to iterate over.\n @param func to call for each counter.\n @param clientd to pass for each call to func."]
    pub fn aeron_counters_reader_foreach_counter(
        counters_reader: *mut aeron_counters_reader_t,
        func: aeron_counters_reader_foreach_counter_func_t,
        clientd: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    #[doc = " Iterate over allocated counters and find the first matching a given type id and registration id.\n\n @param counters_reader\n @param type_id to find.\n @param registration_id to find.\n @return the counter id if found otherwise AERON_NULL_COUNTER_ID."]
    pub fn aeron_counters_reader_find_by_type_id_and_registration_id(
        counters_reader: *mut aeron_counters_reader_t,
        type_id: i32,
        registration_id: i64,
    ) -> i32;
}
unsafe extern "C" {
    #[doc = " Get the current max counter id.\n\n @param reader to query\n @return -1 on failure, max counter id on success."]
    pub fn aeron_counters_reader_max_counter_id(reader: *mut aeron_counters_reader_t) -> i32;
}
unsafe extern "C" {
    #[doc = " Get the address for a counter.\n\n @param counters_reader that contains the counter\n @param counter_id to find\n @return address of the counter value"]
    pub fn aeron_counters_reader_addr(
        counters_reader: *mut aeron_counters_reader_t,
        counter_id: i32,
    ) -> *mut i64;
}
unsafe extern "C" {
    #[doc = " Get the registration id assigned to a counter.\n\n @param counters_reader representing the this pointer.\n @param counter_id      for which the registration id is requested.\n @param registration_id pointer for value to be set on success.\n @return -1 on failure, 0 on success."]
    pub fn aeron_counters_reader_counter_registration_id(
        counters_reader: *mut aeron_counters_reader_t,
        counter_id: i32,
        registration_id: *mut i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get the owner id assigned to a counter which will typically be the client id.\n\n @param counters_reader representing the this pointer.\n @param counter_id      for which the owner id is requested.\n @param owner_id        pointer for value to be set on success.\n @return -1 on failure, 0 on success."]
    pub fn aeron_counters_reader_counter_owner_id(
        counters_reader: *mut aeron_counters_reader_t,
        counter_id: i32,
        owner_id: *mut i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get the reference id assigned to a counter which will typically be the registration id of an associated Image,\n Subscription, Publication, etc.\n\n @param counters_reader representing the this pointer.\n @param counter_id      for which the reference id is requested.\n @param reference_id    pointer for value to be set on success.\n @return -1 on failure, 0 on success."]
    pub fn aeron_counters_reader_counter_reference_id(
        counters_reader: *mut aeron_counters_reader_t,
        counter_id: i32,
        reference_id: *mut i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get the state for a counter.\n\n @param counters_reader that contains the counter\n @param counter_id to find\n @param state out pointer for the current state to be stored in.\n @return -1 on failure, 0 on success."]
    pub fn aeron_counters_reader_counter_state(
        counters_reader: *mut aeron_counters_reader_t,
        counter_id: i32,
        state: *mut i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get the type id for a counter.\n\n @param counters_reader that contains the counter\n @param counter_id to find\n @param type id out pointer for the current state to be stored in.\n @return -1 on failure, 0 on success."]
    pub fn aeron_counters_reader_counter_type_id(
        counters_reader: *mut aeron_counters_reader_t,
        counter_id: i32,
        type_id: *mut i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get a pointer to the key of a counter's metadata\n\n @param counters_reader that contains the counter\n @param counter_id to find\n @param key_p out pointer set to location of metadata key\n @return -1 on failure, 0 on success."]
    pub fn aeron_counters_reader_metadata_key(
        counters_reader: *mut aeron_counters_reader_t,
        counter_id: i32,
        key_p: *mut *mut u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get the label for a counter.\n\n @param counters_reader that contains the counter\n @param counter_id to find\n @param buffer to store the counter in.\n @param buffer_length length of the output buffer\n @return -1 on failure, number of characters copied to buffer on success."]
    pub fn aeron_counters_reader_counter_label(
        counters_reader: *mut aeron_counters_reader_t,
        counter_id: i32,
        buffer: *mut ::std::os::raw::c_char,
        buffer_length: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get the free for reuse deadline (ms) for a counter.\n\n @param counters_reader that contains the counter.\n @param counter_id to find.\n @param deadline_ms output value to store the deadline.\n @return -1 on failure, 0 on success."]
    pub fn aeron_counters_reader_free_for_reuse_deadline_ms(
        counters_reader: *mut aeron_counters_reader_t,
        counter_id: i32,
        deadline_ms: *mut i64,
    ) -> ::std::os::raw::c_int;
}
#[doc = " Function called when filling in the reserved value field of a message.\n\n @param clientd passed to the offer function.\n @param buffer of the entire frame, including Aeron data header.\n @param frame_length of the entire frame."]
pub type aeron_reserved_value_supplier_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        buffer: *mut u8,
        frame_length: usize,
    ) -> i64,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_iovec_stct {
    pub iov_base: *mut u8,
    pub iov_len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_iovec_stct"][::std::mem::size_of::<aeron_iovec_stct>() - 16usize];
    ["Alignment of aeron_iovec_stct"][::std::mem::align_of::<aeron_iovec_stct>() - 8usize];
    ["Offset of field: aeron_iovec_stct::iov_base"]
        [::std::mem::offset_of!(aeron_iovec_stct, iov_base) - 0usize];
    ["Offset of field: aeron_iovec_stct::iov_len"]
        [::std::mem::offset_of!(aeron_iovec_stct, iov_len) - 8usize];
};
impl Default for aeron_iovec_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_iovec_t = aeron_iovec_stct;
#[doc = " Structure used to hold information for a try_claim function call."]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_buffer_claim_stct {
    pub frame_header: *mut u8,
    pub data: *mut u8,
    pub length: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_buffer_claim_stct"][::std::mem::size_of::<aeron_buffer_claim_stct>() - 24usize];
    ["Alignment of aeron_buffer_claim_stct"]
        [::std::mem::align_of::<aeron_buffer_claim_stct>() - 8usize];
    ["Offset of field: aeron_buffer_claim_stct::frame_header"]
        [::std::mem::offset_of!(aeron_buffer_claim_stct, frame_header) - 0usize];
    ["Offset of field: aeron_buffer_claim_stct::data"]
        [::std::mem::offset_of!(aeron_buffer_claim_stct, data) - 8usize];
    ["Offset of field: aeron_buffer_claim_stct::length"]
        [::std::mem::offset_of!(aeron_buffer_claim_stct, length) - 16usize];
};
impl Default for aeron_buffer_claim_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = " Commit the given buffer_claim as a complete message available for consumption.\n\n @param buffer_claim to commit.\n @return 0 for success or -1 for error."]
    pub fn aeron_buffer_claim_commit(
        buffer_claim: *mut aeron_buffer_claim_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Abort the given buffer_claim and assign its position as padding.\n\n @param buffer_claim to abort.\n @return 0 for success or -1 for error."]
    pub fn aeron_buffer_claim_abort(
        buffer_claim: *mut aeron_buffer_claim_t,
    ) -> ::std::os::raw::c_int;
}
#[doc = " Configuration for a publication that does not change during it's lifetime."]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_publication_constants_stct {
    #[doc = " Media address for delivery to the channel.\n\n This returns a pointer only valid for the lifetime of the publication."]
    pub channel: *const ::std::os::raw::c_char,
    #[doc = " The registration used to register this Publication with the media driver by the first publisher."]
    pub original_registration_id: i64,
    #[doc = " Get the registration id used to register this Publication with the media driver.\n\n If this value is different from the original_registration_id then a previous active registration exists."]
    pub registration_id: i64,
    #[doc = " The maximum possible position this stream can reach due to its term buffer length.\n\n Maximum possible position is term-length times 2^31 in bytes."]
    pub max_possible_position: i64,
    #[doc = " Number of bits to right shift a position to get a term count for how far the stream has progressed."]
    pub position_bits_to_shift: usize,
    #[doc = " Get the length in bytes for each term partition in the log buffer."]
    pub term_buffer_length: usize,
    #[doc = " Maximum message length supported in bytes. Messages may be made of multiple fragments if greater than\n MTU length."]
    pub max_message_length: usize,
    #[doc = " Maximum length of a message payload that fits within a message fragment.\n\n This is the MTU length minus the message fragment header length."]
    pub max_payload_length: usize,
    #[doc = " Stream id of the publication."]
    pub stream_id: i32,
    #[doc = " Session id of the publication."]
    pub session_id: i32,
    #[doc = " The initial term id assigned when this publication was created. This can be used to determine how many\n terms have passed since creation."]
    pub initial_term_id: i32,
    #[doc = " Counter id for the publication limit."]
    pub publication_limit_counter_id: i32,
    #[doc = " Counter id for the channel status indicator"]
    pub channel_status_indicator_id: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_publication_constants_stct"]
        [::std::mem::size_of::<aeron_publication_constants_stct>() - 88usize];
    ["Alignment of aeron_publication_constants_stct"]
        [::std::mem::align_of::<aeron_publication_constants_stct>() - 8usize];
    ["Offset of field: aeron_publication_constants_stct::channel"]
        [::std::mem::offset_of!(aeron_publication_constants_stct, channel) - 0usize];
    ["Offset of field: aeron_publication_constants_stct::original_registration_id"][::std::mem::offset_of!(
        aeron_publication_constants_stct,
        original_registration_id
    ) - 8usize];
    ["Offset of field: aeron_publication_constants_stct::registration_id"]
        [::std::mem::offset_of!(aeron_publication_constants_stct, registration_id) - 16usize];
    ["Offset of field: aeron_publication_constants_stct::max_possible_position"]
        [::std::mem::offset_of!(aeron_publication_constants_stct, max_possible_position) - 24usize];
    ["Offset of field: aeron_publication_constants_stct::position_bits_to_shift"][::std::mem::offset_of!(
        aeron_publication_constants_stct,
        position_bits_to_shift
    ) - 32usize];
    ["Offset of field: aeron_publication_constants_stct::term_buffer_length"]
        [::std::mem::offset_of!(aeron_publication_constants_stct, term_buffer_length) - 40usize];
    ["Offset of field: aeron_publication_constants_stct::max_message_length"]
        [::std::mem::offset_of!(aeron_publication_constants_stct, max_message_length) - 48usize];
    ["Offset of field: aeron_publication_constants_stct::max_payload_length"]
        [::std::mem::offset_of!(aeron_publication_constants_stct, max_payload_length) - 56usize];
    ["Offset of field: aeron_publication_constants_stct::stream_id"]
        [::std::mem::offset_of!(aeron_publication_constants_stct, stream_id) - 64usize];
    ["Offset of field: aeron_publication_constants_stct::session_id"]
        [::std::mem::offset_of!(aeron_publication_constants_stct, session_id) - 68usize];
    ["Offset of field: aeron_publication_constants_stct::initial_term_id"]
        [::std::mem::offset_of!(aeron_publication_constants_stct, initial_term_id) - 72usize];
    ["Offset of field: aeron_publication_constants_stct::publication_limit_counter_id"][::std::mem::offset_of!(
        aeron_publication_constants_stct,
        publication_limit_counter_id
    )
        - 76usize];
    ["Offset of field: aeron_publication_constants_stct::channel_status_indicator_id"][::std::mem::offset_of!(
        aeron_publication_constants_stct,
        channel_status_indicator_id
    ) - 80usize];
};
impl Default for aeron_publication_constants_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Configuration for a publication that does not change during it's lifetime."]
pub type aeron_publication_constants_t = aeron_publication_constants_stct;
unsafe extern "C" {
    #[doc = " Non-blocking publish of a buffer containing a message.\n\n @param publication to publish on.\n @param buffer to publish.\n @param length of the buffer.\n @param reserved_value_supplier to use for setting the reserved value field or NULL.\n @param clientd to pass to the reserved_value_supplier.\n @return the new stream position otherwise a negative error value."]
    pub fn aeron_publication_offer(
        publication: *mut aeron_publication_t,
        buffer: *const u8,
        length: usize,
        reserved_value_supplier: aeron_reserved_value_supplier_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Non-blocking publish by gathering buffer vectors into a message.\n\n @param publication to publish on.\n @param iov array for the vectors\n @param iovcnt of the number of vectors\n @param reserved_value_supplier to use for setting the reserved value field or NULL.\n @param clientd to pass to the reserved_value_supplier.\n @return the new stream position otherwise a negative error value."]
    pub fn aeron_publication_offerv(
        publication: *mut aeron_publication_t,
        iov: *mut aeron_iovec_t,
        iovcnt: usize,
        reserved_value_supplier: aeron_reserved_value_supplier_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Try to claim a range in the publication log into which a message can be written with zero copy semantics.\n Once the message has been written then aeron_buffer_claim_commit should be called thus making it available.\n A claim length cannot be greater than max payload length.\n <p>\n <b>Note:</b> This method can only be used for message lengths less than MTU length minus header.\n If the claim is held for more than the aeron.publication.unblock.timeout system property then the driver will\n assume the publication thread is dead and will unblock the claim thus allowing other threads to make progress\n and other claims to be sent to reach end-of-stream (EOS).\n\n @code\n aeron_buffer_claim_t buffer_claim;\n\n if (aeron_publication_try_claim(publication, length, &buffer_claim) > 0L)\n {\n     // work with buffer_claim->data directly.\n     aeron_buffer_claim_commit(&buffer_claim);\n }\n @endcode\n\n @param publication to publish to.\n @param length of the message.\n @param buffer_claim to be populated if the claim succeeds.\n @return the new stream position otherwise a negative error value."]
    pub fn aeron_publication_try_claim(
        publication: *mut aeron_publication_t,
        length: usize,
        buffer_claim: *mut aeron_buffer_claim_t,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Get the status of the media channel for this publication.\n <p>\n The status will be ERRORED (-1) if a socket exception occurs on setup and ACTIVE (1) if all is well.\n\n @param publication to check status of.\n @return 1 for ACTIVE, -1 for ERRORED"]
    pub fn aeron_publication_channel_status(publication: *mut aeron_publication_t) -> i64;
}
unsafe extern "C" {
    #[doc = " Has the publication closed?\n\n @param publication to check\n @return true if this publication is closed."]
    pub fn aeron_publication_is_closed(publication: *mut aeron_publication_t) -> bool;
}
unsafe extern "C" {
    #[doc = " Has the publication seen an active Subscriber recently?\n\n @param publication to check.\n @return true if this publication has recently seen an active subscriber otherwise false."]
    pub fn aeron_publication_is_connected(publication: *mut aeron_publication_t) -> bool;
}
unsafe extern "C" {
    #[doc = " Fill in a structure with the constants in use by a publication.\n\n @param publication to get the constants for.\n @param constants structure to fill in with the constants\n @return 0 for success and -1 for error."]
    pub fn aeron_publication_constants(
        publication: *mut aeron_publication_t,
        constants: *mut aeron_publication_constants_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get the current position to which the publication has advanced for this stream.\n\n @param publication to query.\n @return the current position to which the publication has advanced for this stream or a negative error value."]
    pub fn aeron_publication_position(publication: *mut aeron_publication_t) -> i64;
}
unsafe extern "C" {
    #[doc = " Get the position limit beyond which this publication will be back pressured.\n\n This should only be used as a guide to determine when back pressure is likely to be applied.\n\n @param publication to query.\n @return the position limit beyond which this publication will be back pressured or a negative error value."]
    pub fn aeron_publication_position_limit(publication: *mut aeron_publication_t) -> i64;
}
unsafe extern "C" {
    #[doc = " Add a destination manually to a multi-destination-cast publication.\n\n @param async object to use for polling completion.\n @param publication to add destination to.\n @param uri for the destination to add.\n @return 0 for success and -1 for error."]
    pub fn aeron_publication_async_add_destination(
        async_: *mut *mut aeron_async_destination_t,
        client: *mut aeron_t,
        publication: *mut aeron_publication_t,
        uri: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Remove a destination manually from a multi-destination-cast publication.\n\n @param async object to use for polling completion.\n @param publication to remove destination from.\n @param uri for the destination to remove.\n @return 0 for success and -1 for error."]
    pub fn aeron_publication_async_remove_destination(
        async_: *mut *mut aeron_async_destination_t,
        client: *mut aeron_t,
        publication: *mut aeron_publication_t,
        uri: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Remove a destination manually from a multi-destination-cast publication.\n\n @param async object to use for polling completion.\n @param publication to remove destination from.\n @param destination_registration_id for the destination to remove.\n @return 0 for success and -1 for error."]
    pub fn aeron_publication_async_remove_destination_by_id(
        async_: *mut *mut aeron_async_destination_t,
        client: *mut aeron_t,
        publication: *mut aeron_publication_t,
        destination_registration_id: i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Poll the completion of the add/remove of a destination to/from a publication.\n\n @param async to check for completion.\n @return 0 for not complete (try again), 1 for completed successfully, or -1 for an error."]
    pub fn aeron_publication_async_destination_poll(
        async_: *mut aeron_async_destination_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Add a destination manually to a multi-destination-cast exclusive publication.\n\n @param async object to use for polling completion.\n @param publication to add destination to.\n @param uri for the destination to add.\n @return 0 for success and -1 for error."]
    pub fn aeron_exclusive_publication_async_add_destination(
        async_: *mut *mut aeron_async_destination_t,
        client: *mut aeron_t,
        publication: *mut aeron_exclusive_publication_t,
        uri: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Remove a destination manually from a multi-destination-cast exclusive publication.\n\n @param async object to use for polling completion.\n @param publication to remove destination from.\n @param uri for the destination to remove.\n @return 0 for success and -1 for error."]
    pub fn aeron_exclusive_publication_async_remove_destination(
        async_: *mut *mut aeron_async_destination_t,
        client: *mut aeron_t,
        publication: *mut aeron_exclusive_publication_t,
        uri: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Remove a destination manually from a multi-destination-cast publication.\n\n @param async object to use for polling completion.\n @param publication to remove destination from.\n @param destination_registration_id for the destination to remove.\n @return 0 for success and -1 for error."]
    pub fn aeron_exclusive_publication_async_remove_destination_by_id(
        async_: *mut *mut aeron_async_destination_t,
        client: *mut aeron_t,
        publication: *mut aeron_exclusive_publication_t,
        destination_registration_id: i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Poll the completion of the add/remove of a destination to/from an exclusive publication.\n\n @param async to check for completion.\n @return 0 for not complete (try again), 1 for completed successfully, or -1 for an error."]
    pub fn aeron_exclusive_publication_async_destination_poll(
        async_: *mut aeron_async_destination_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Asynchronously close the publication. Will callback on the on_complete notification when the publication is closed.\n The callback is optional, use NULL for the on_complete callback if not required.\n\n @param publication to close\n @param on_close_complete optional callback to execute once the publication has been closed and freed. This may\n happen on a separate thread, so the caller should ensure that clientd has the appropriate lifetime.\n @param on_close_complete_clientd parameter to pass to the on_complete callback.\n @return 0 for success or -1 for error."]
    pub fn aeron_publication_close(
        publication: *mut aeron_publication_t,
        on_close_complete: aeron_notification_t,
        on_close_complete_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get the publication's channel\n\n @param publication this\n @return channel uri string"]
    pub fn aeron_publication_channel(
        publication: *mut aeron_publication_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " Get the publication's stream id\n\n @param publication this\n @return stream id"]
    pub fn aeron_publication_stream_id(publication: *mut aeron_publication_t) -> i32;
}
unsafe extern "C" {
    #[doc = " Get the publication's session id\n @param publication this\n @return session id"]
    pub fn aeron_publication_session_id(publication: *mut aeron_publication_t) -> i32;
}
unsafe extern "C" {
    #[doc = " Get all of the local socket addresses for this publication. Typically only one representing the control address.\n\n @param subscription to query\n @param address_vec to hold the received addresses\n @param address_vec_len available length of the vector to hold the addresses\n @return number of addresses found or -1 if there is an error.\n @see aeron_subscription_local_sockaddrs"]
    pub fn aeron_publication_local_sockaddrs(
        publication: *mut aeron_publication_t,
        address_vec: *mut aeron_iovec_t,
        address_vec_len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Non-blocking publish of a buffer containing a message.\n\n @param publication to publish on.\n @param buffer to publish.\n @param length of the buffer.\n @param reserved_value_supplier to use for setting the reserved value field or NULL.\n @param clientd to pass to the reserved_value_supplier.\n @return the new stream position otherwise a negative error value."]
    pub fn aeron_exclusive_publication_offer(
        publication: *mut aeron_exclusive_publication_t,
        buffer: *const u8,
        length: usize,
        reserved_value_supplier: aeron_reserved_value_supplier_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Non-blocking publish by gathering buffer vectors into a message.\n\n @param publication to publish on.\n @param iov array for the vectors\n @param iovcnt of the number of vectors\n @param reserved_value_supplier to use for setting the reserved value field or NULL.\n @param clientd to pass to the reserved_value_supplier.\n @return the new stream position otherwise a negative error value."]
    pub fn aeron_exclusive_publication_offerv(
        publication: *mut aeron_exclusive_publication_t,
        iov: *mut aeron_iovec_t,
        iovcnt: usize,
        reserved_value_supplier: aeron_reserved_value_supplier_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Try to claim a range in the publication log into which a message can be written with zero copy semantics.\n Once the message has been written then aeron_buffer_claim_commit should be called thus making it available.\n A claim length cannot be greater than max payload length.\n <p>\n <b>Note:</b> This method can only be used for message lengths less than MTU length minus header.\n\n @code\n aeron_buffer_claim_t buffer_claim;\n\n if (aeron_exclusive_publication_try_claim(publication, length, &buffer_claim) > 0L)\n {\n     // work with buffer_claim->data directly.\n     aeron_buffer_claim_commit(&buffer_claim);\n }\n @endcode\n\n @param publication to publish to.\n @param length of the message.\n @param buffer_claim to be populated if the claim succeeds.\n @return the new stream position otherwise a negative error value."]
    pub fn aeron_exclusive_publication_try_claim(
        publication: *mut aeron_exclusive_publication_t,
        length: usize,
        buffer_claim: *mut aeron_buffer_claim_t,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Append a padding record log of a given length to make up the log to a position.\n\n @param length of the range to claim, in bytes.\n @return the new stream position otherwise a negative error value."]
    pub fn aeron_exclusive_publication_append_padding(
        publication: *mut aeron_exclusive_publication_t,
        length: usize,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Offer a block of pre-formatted message fragments directly into the current term.\n\n @param buffer containing the pre-formatted block of message fragments.\n @param offset offset in the buffer at which the first fragment begins.\n @param length in bytes of the encoded block.\n @return the new stream position otherwise a negative error value."]
    pub fn aeron_exclusive_publication_offer_block(
        publication: *mut aeron_exclusive_publication_t,
        buffer: *const u8,
        length: usize,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Get the status of the media channel for this publication.\n <p>\n The status will be ERRORED (-1) if a socket exception occurs on setup and ACTIVE (1) if all is well.\n\n @param publication to check status of.\n @return 1 for ACTIVE, -1 for ERRORED"]
    pub fn aeron_exclusive_publication_channel_status(
        publication: *mut aeron_exclusive_publication_t,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Fill in a structure with the constants in use by a publication.\n\n @param publication to get the constants for.\n @param constants structure to fill in with the constants\n @return 0 for success and -1 for error."]
    pub fn aeron_exclusive_publication_constants(
        publication: *mut aeron_exclusive_publication_t,
        constants: *mut aeron_publication_constants_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get the current position to which the publication has advanced for this stream.\n\n @param publication to query.\n @return the current position to which the publication has advanced for this stream or a negative error value."]
    pub fn aeron_exclusive_publication_position(
        publication: *mut aeron_exclusive_publication_t,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Get the position limit beyond which this publication will be back pressured.\n\n This should only be used as a guide to determine when back pressure is likely to be applied.\n\n @param publication to query.\n @return the position limit beyond which this publication will be back pressured or a negative error value."]
    pub fn aeron_exclusive_publication_position_limit(
        publication: *mut aeron_exclusive_publication_t,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Asynchronously close the publication.\n\n @param publication to close\n @return 0 for success or -1 for error."]
    pub fn aeron_exclusive_publication_close(
        publication: *mut aeron_exclusive_publication_t,
        on_close_complete: aeron_notification_t,
        on_close_complete_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Revoke this publication when it's closed.\n\n @param publication to revoke on close"]
    pub fn aeron_exclusive_publication_revoke_on_close(
        publication: *mut aeron_exclusive_publication_t,
    );
}
unsafe extern "C" {
    #[doc = " Asynchronously revoke and close the publication. Will callback on the on_complete notification when the publicaiton is closed.\n The callback is optional, use NULL for the on_complete callback if not required.\n\n @param publication to revoke and close\n @param on_close_complete optional callback to execute once the publication has been revoked, closed and freed. This may\n happen on a separate thread, so the caller should ensure that clientd has the appropriate lifetime.\n @param on_close_complete_clientd parameter to pass to the on_complete callback.\n @return 0 for success or -1 for error."]
    pub fn aeron_exclusive_publication_revoke(
        publication: *mut aeron_exclusive_publication_t,
        on_close_complete: aeron_notification_t,
        on_close_complete_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Has the exclusive publication closed?\n\n @param publication to check\n @return true if this publication is closed."]
    pub fn aeron_exclusive_publication_is_closed(
        publication: *mut aeron_exclusive_publication_t,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Has the exclusive publication seen an active Subscriber recently?\n\n @param publication to check.\n @return true if this publication has recently seen an active subscriber otherwise false."]
    pub fn aeron_exclusive_publication_is_connected(
        publication: *mut aeron_exclusive_publication_t,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Get all of the local socket addresses for this exclusive publication. Typically only one representing the control\n address.\n\n @see aeron_subscription_local_sockaddrs\n @param subscription to query\n @param address_vec to hold the received addresses\n @param address_vec_len available length of the vector to hold the addresses\n @return number of addresses found or -1 if there is an error."]
    pub fn aeron_exclusive_publication_local_sockaddrs(
        publication: *mut aeron_exclusive_publication_t,
        address_vec: *mut aeron_iovec_t,
        address_vec_len: usize,
    ) -> ::std::os::raw::c_int;
}
#[doc = " Callback for handling fragments of data being read from a log.\n\n The frame will either contain a whole message or a fragment of a message to be reassembled. Messages are fragmented\n if greater than the frame for MTU in length.\n\n @param clientd passed to the poll function.\n @param buffer containing the data.\n @param length of the data in bytes.\n @param header representing the meta data for the data."]
pub type aeron_fragment_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        buffer: *const u8,
        length: usize,
        header: *mut aeron_header_t,
    ),
>;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum aeron_controlled_fragment_handler_action_en {
    #[doc = " Abort the current polling operation and do not advance the position for this fragment."]
    AERON_ACTION_ABORT = 1,
    #[doc = " Break from the current polling operation and commit the position as of the end of the current fragment\n being handled."]
    AERON_ACTION_BREAK = 2,
    #[doc = " Continue processing but commit the position as of the end of the current fragment so that\n flow control is applied to this point."]
    AERON_ACTION_COMMIT = 3,
    #[doc = " Continue processing until fragment limit or no fragments with position commit at end of poll as in\n aeron_fragment_handler_t."]
    AERON_ACTION_CONTINUE = 4,
}
pub use self::aeron_controlled_fragment_handler_action_en as aeron_controlled_fragment_handler_action_t;
#[doc = " Callback for handling fragments of data being read from a log.\n\n Handler for reading data that is coming from a log buffer. The frame will either contain a whole message\n or a fragment of a message to be reassembled. Messages are fragmented if greater than the frame for MTU in length.\n\n @param clientd passed to the controlled poll function.\n @param buffer containing the data.\n @param length of the data in bytes.\n @param header representing the meta data for the data.\n @return The action to be taken with regard to the stream position after the callback."]
pub type aeron_controlled_fragment_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        buffer: *const u8,
        length: usize,
        header: *mut aeron_header_t,
    ) -> aeron_controlled_fragment_handler_action_t,
>;
#[doc = " Callback for handling a block of messages being read from a log.\n\n @param clientd passed to the block poll function.\n @param buffer containing the block of message fragments.\n @param offset at which the block begins, including any frame headers.\n @param length of the block in bytes, including any frame headers that is aligned.\n @param session_id of the stream containing this block of message fragments.\n @param term_id of the stream containing this block of message fragments."]
pub type aeron_block_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        buffer: *const u8,
        length: usize,
        session_id: i32,
        term_id: i32,
    ),
>;
unsafe extern "C" {
    #[doc = " Get all of the field values from the header. This will do a memcpy into the supplied header_values_t pointer.\n\n @param header to read values from.\n @param values to copy values to, must not be null.\n @return 0 on success, -1 on failure."]
    pub fn aeron_header_values(
        header: *mut aeron_header_t,
        values: *mut aeron_header_values_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get the current position to which the Image has advanced on reading this message.\n\n @param header the current header message\n @return the current position to which the Image has advanced on reading this message."]
    pub fn aeron_header_position(header: *mut aeron_header_t) -> i64;
}
unsafe extern "C" {
    #[doc = " Get the number of times to left shift the term count to multiply by term length.\n\n @return number of times to left shift the term count to multiply by term length."]
    pub fn aeron_header_position_bits_to_shift(header: *mut aeron_header_t) -> usize;
}
unsafe extern "C" {
    #[doc = " Calculates the offset of the frame immediately after this one.\n\n @return the offset of the next frame."]
    pub fn aeron_header_next_term_offset(header: *mut aeron_header_t) -> i32;
}
unsafe extern "C" {
    #[doc = " Get a pointer to the context associated with this message. Only valid during poll handling. Is normally a\n pointer to an Image instance.\n\n @return a pointer to the context associated with this message."]
    pub fn aeron_header_context(header: *mut aeron_header_t) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_subscription_constants_stct {
    #[doc = " Media address for delivery to the channel.\n\n This returns a pointer only valid for the lifetime of the subscription."]
    pub channel: *const ::std::os::raw::c_char,
    #[doc = " Callback used to indicate when an Image becomes available under this Subscription."]
    pub on_available_image: aeron_on_available_image_t,
    #[doc = " Callback used to indicate when an Image goes unavailable under this Subscription."]
    pub on_unavailable_image: aeron_on_unavailable_image_t,
    #[doc = " Return the registration id used to register this Subscription with the media driver."]
    pub registration_id: i64,
    #[doc = " Stream identity for scoping within the channel media address."]
    pub stream_id: i32,
    #[doc = " Counter id for the channel status indicator"]
    pub channel_status_indicator_id: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_subscription_constants_stct"]
        [::std::mem::size_of::<aeron_subscription_constants_stct>() - 40usize];
    ["Alignment of aeron_subscription_constants_stct"]
        [::std::mem::align_of::<aeron_subscription_constants_stct>() - 8usize];
    ["Offset of field: aeron_subscription_constants_stct::channel"]
        [::std::mem::offset_of!(aeron_subscription_constants_stct, channel) - 0usize];
    ["Offset of field: aeron_subscription_constants_stct::on_available_image"]
        [::std::mem::offset_of!(aeron_subscription_constants_stct, on_available_image) - 8usize];
    ["Offset of field: aeron_subscription_constants_stct::on_unavailable_image"]
        [::std::mem::offset_of!(aeron_subscription_constants_stct, on_unavailable_image) - 16usize];
    ["Offset of field: aeron_subscription_constants_stct::registration_id"]
        [::std::mem::offset_of!(aeron_subscription_constants_stct, registration_id) - 24usize];
    ["Offset of field: aeron_subscription_constants_stct::stream_id"]
        [::std::mem::offset_of!(aeron_subscription_constants_stct, stream_id) - 32usize];
    ["Offset of field: aeron_subscription_constants_stct::channel_status_indicator_id"][::std::mem::offset_of!(
        aeron_subscription_constants_stct,
        channel_status_indicator_id
    )
        - 36usize];
};
impl Default for aeron_subscription_constants_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_subscription_constants_t = aeron_subscription_constants_stct;
unsafe extern "C" {
    #[doc = " Poll the images under the subscription for available message fragments.\n <p>\n Each fragment read will be a whole message if it is under MTU length. If larger than MTU then it will come\n as a series of fragments ordered within a session.\n <p>\n To assemble messages that span multiple fragments then use aeron_fragment_assembler_t.\n\n @param subscription to poll.\n @param handler for handling each message fragment as it is read.\n @param fragment_limit number of message fragments to limit when polling across multiple images.\n @return the number of fragments received or -1 for error."]
    pub fn aeron_subscription_poll(
        subscription: *mut aeron_subscription_t,
        handler: aeron_fragment_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        fragment_limit: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Poll in a controlled manner the images under the subscription for available message fragments.\n Control is applied to fragments in the stream. If more fragments can be read on another stream\n they will even if BREAK or ABORT is returned from the fragment handler.\n <p>\n Each fragment read will be a whole message if it is under MTU length. If larger than MTU then it will come\n as a series of fragments ordered within a session.\n <p>\n To assemble messages that span multiple fragments then use aeron_controlled_fragment_assembler_t.\n\n @param subscription to poll.\n @param handler for handling each message fragment as it is read.\n @param fragment_limit number of message fragments to limit when polling across multiple images.\n @return the number of fragments received or -1 for error."]
    pub fn aeron_subscription_controlled_poll(
        subscription: *mut aeron_subscription_t,
        handler: aeron_controlled_fragment_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        fragment_limit: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Poll the images under the subscription for available message fragments in blocks.\n <p>\n This method is useful for operations like bulk archiving and messaging indexing.\n\n @param subscription to poll.\n @param handler to receive a block of fragments from each image.\n @param block_length_limit for each image polled.\n @return the number of bytes consumed or -1 for error."]
    pub fn aeron_subscription_block_poll(
        subscription: *mut aeron_subscription_t,
        handler: aeron_block_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        block_length_limit: usize,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    #[doc = " Is this subscription connected by having at least one open publication image.\n\n @param subscription to check.\n @return true if this subscription connected by having at least one open publication image."]
    pub fn aeron_subscription_is_connected(subscription: *mut aeron_subscription_t) -> bool;
}
unsafe extern "C" {
    #[doc = " Fill in a structure with the constants in use by a subscription.\n\n @param subscription to get the constants for.\n @param constants structure to fill in with the constants\n @return 0 for success and -1 for error."]
    pub fn aeron_subscription_constants(
        subscription: *mut aeron_subscription_t,
        constants: *mut aeron_subscription_constants_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Count of images associated to this subscription.\n\n @param subscription to count images for.\n @return count of count associated to this subscription or -1 for error."]
    pub fn aeron_subscription_image_count(
        subscription: *mut aeron_subscription_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Return the image associated with the given session_id under the given subscription.\n\n Note: the returned image is considered retained by the application and thus must be released via\n aeron_image_release when finished or if the image becomes unavailable.\n\n @param subscription to search.\n @param session_id associated with the image.\n @return image associated with the given session_id or NULL if no image exists."]
    pub fn aeron_subscription_image_by_session_id(
        subscription: *mut aeron_subscription_t,
        session_id: i32,
    ) -> *mut aeron_image_t;
}
unsafe extern "C" {
    #[doc = " Return the image at the given index.\n\n Note: the returned image is considered retained by the application and thus must be released via\n aeron_image_release when finished or if the image becomes unavailable.\n\n @param subscription to search.\n @param index for the image.\n @return image at the given index or NULL if no image exists."]
    pub fn aeron_subscription_image_at_index(
        subscription: *mut aeron_subscription_t,
        index: usize,
    ) -> *mut aeron_image_t;
}
unsafe extern "C" {
    #[doc = " Iterate over the images for this subscription calling the given function.\n\n @param subscription to iterate over.\n @param handler to be called for each image.\n @param clientd to be passed to the handler."]
    pub fn aeron_subscription_for_each_image(
        subscription: *mut aeron_subscription_t,
        handler: ::std::option::Option<
            unsafe extern "C" fn(image: *mut aeron_image_t, clientd: *mut ::std::os::raw::c_void),
        >,
        clientd: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    #[doc = " Retain the given image for access in the application.\n\n Note: A retain call must have a corresponding release call.\n Note: Subscriptions are not threadsafe and should not be shared between subscribers.\n\n @param subscription that image is part of.\n @param image to retain\n @return 0 for success and -1 for error."]
    pub fn aeron_subscription_image_retain(
        subscription: *mut aeron_subscription_t,
        image: *mut aeron_image_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Release the given image and relinquish desire to use the image directly.\n\n Note: Subscriptions are not threadsafe and should not be shared between subscribers.\n\n @param subscription that image is part of.\n @param image to release\n @return 0 for success and -1 for error."]
    pub fn aeron_subscription_image_release(
        subscription: *mut aeron_subscription_t,
        image: *mut aeron_image_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Is the subscription closed.\n\n @param subscription to be checked.\n @return true if it has been closed otherwise false."]
    pub fn aeron_subscription_is_closed(subscription: *mut aeron_subscription_t) -> bool;
}
unsafe extern "C" {
    #[doc = " Get the status of the media channel for this subscription.\n <p>\n The status will be ERRORED (-1) if a socket exception occurs on setup and ACTIVE (1) if all is well.\n\n @param subscription to check status of.\n @return 1 for ACTIVE, -1 for ERRORED"]
    pub fn aeron_subscription_channel_status(subscription: *mut aeron_subscription_t) -> i64;
}
unsafe extern "C" {
    #[doc = " Add a destination manually to a multi-destination-subscription.\n\n @param async object to use for polling completion.\n @param subscription to add destination to.\n @param uri for the destination to add.\n @return 0 for success and -1 for error."]
    pub fn aeron_subscription_async_add_destination(
        async_: *mut *mut aeron_async_destination_t,
        client: *mut aeron_t,
        subscription: *mut aeron_subscription_t,
        uri: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Remove a destination manually from a multi-destination-subscription.\n\n @param async object to use for polling completion.\n @param subscription to remove destination from.\n @param uri for the destination to remove.\n @return 0 for success and -1 for error."]
    pub fn aeron_subscription_async_remove_destination(
        async_: *mut *mut aeron_async_destination_t,
        client: *mut aeron_t,
        subscription: *mut aeron_subscription_t,
        uri: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Poll the completion of add/remove of a destination to/from a subscription.\n\n @param async to check for completion.\n @return 0 for not complete (try again), 1 for completed successfully, or -1 for an error."]
    pub fn aeron_subscription_async_destination_poll(
        async_: *mut aeron_async_destination_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Asynchronously close the subscription. Will callback on the on_complete notification when the subscription is\n closed. The callback is optional, use NULL for the on_complete callback if not required.\n\n @param subscription to close\n @param on_close_complete optional callback to execute once the subscription has been closed and freed. This may\n happen on a separate thread, so the caller should ensure that clientd has the appropriate lifetime.\n @param on_close_complete_clientd parameter to pass to the on_complete callback.\n @return 0 for success or -1 for error."]
    pub fn aeron_subscription_close(
        subscription: *mut aeron_subscription_t,
        on_close_complete: aeron_notification_t,
        on_close_complete_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get all of the local socket addresses for this subscription. Multiple addresses can occur if this is a\n multi-destination subscription. Addresses will a string representation in numeric form. IPv6 addresses will be\n surrounded by '[' and ']' so that the ':' that separate the parts are distinguishable from the port delimiter.\n E.g. [fe80::7552:c06e:6bf4:4160]:12345. As of writing the maximum length for a formatted address is 54 bytes\n including the NULL terminator. AERON_CLIENT_MAX_LOCAL_ADDRESS_STR_LEN is defined to provide enough space to fit the\n returned string. Returned strings will be NULL terminated. If the buffer to hold the address can not hold enough\n of the message it will be truncated and the last character will be null.\n\n If the address_vec_len is less the total number of addresses available then the first addresses found up to that\n length will be placed into the address_vec. However the function will return the total number of addresses available\n so if if that is larger than the input array then the client code may wish to re-query with a larger array to get\n them all.\n\n @param subscription to query\n @param address_vec to hold the received addresses\n @param address_vec_len available length of the vector to hold the addresses\n @return number of addresses found or -1 if there is an error."]
    pub fn aeron_subscription_local_sockaddrs(
        subscription: *mut aeron_subscription_t,
        address_vec: *mut aeron_iovec_t,
        address_vec_len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Retrieves the first local socket address for this subscription. If this is not MDS then it will be the one\n representing endpoint for this subscription.\n\n @see aeron_subscription_local_sockaddrs\n @param subscription to query\n @param address for the received address\n @param address_len available length for the copied address.\n @return -1 on error, 0 if address not found, 1 if address is found."]
    pub fn aeron_subscription_resolved_endpoint(
        subscription: *mut aeron_subscription_t,
        address: *const ::std::os::raw::c_char,
        address_len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Retrieves the channel URI for this subscription with any wildcard ports filled in. If the channel is not UDP or\n does not have a wildcard port (<code>0</code>), then it will return the original URI.\n\n @param subscription to query\n @param uri buffer to hold the resolved uri\n @param uri_len length of the buffer\n @return -1 on failure or the number of bytes written to the buffer (excluding the NULL terminator). Writing is done\n on a per key basis, so if the buffer was truncated before writing completed, it will only include the byte count up\n to the key that overflowed. However, the invariant that if the number returned >= uri_len, then output will have been\n truncated."]
    pub fn aeron_subscription_try_resolve_channel_endpoint_port(
        subscription: *mut aeron_subscription_t,
        uri: *mut ::std::os::raw::c_char,
        uri_len: usize,
    ) -> ::std::os::raw::c_int;
}
#[doc = " Configuration for an image that does not change during it's lifetime."]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_image_constants_stct {
    #[doc = " The subscription to which this image belongs."]
    pub subscription: *mut aeron_subscription_t,
    #[doc = " The source identity of the sending publisher as an abstract concept appropriate for the media."]
    pub source_identity: *const ::std::os::raw::c_char,
    #[doc = " The correlationId for identification of the image with the media driver."]
    pub correlation_id: i64,
    #[doc = " Get the position the subscriber joined this stream at."]
    pub join_position: i64,
    #[doc = " Number of bits to right shift a position to get a term count for how far the stream has progressed."]
    pub position_bits_to_shift: usize,
    #[doc = " Get the length in bytes for each term partition in the log buffer."]
    pub term_buffer_length: usize,
    #[doc = " The length in bytes of the MTU (Maximum Transmission Unit) the Sender used for the datagram."]
    pub mtu_length: usize,
    #[doc = " The sessionId for the steam of messages. Sessions are unique within a subscription and unique across\n all publications from a source identity."]
    pub session_id: i32,
    #[doc = " The initial term at which the stream started for this session."]
    pub initial_term_id: i32,
    #[doc = " Counter id that refers to the subscriber position for this image."]
    pub subscriber_position_id: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_image_constants_stct"]
        [::std::mem::size_of::<aeron_image_constants_stct>() - 72usize];
    ["Alignment of aeron_image_constants_stct"]
        [::std::mem::align_of::<aeron_image_constants_stct>() - 8usize];
    ["Offset of field: aeron_image_constants_stct::subscription"]
        [::std::mem::offset_of!(aeron_image_constants_stct, subscription) - 0usize];
    ["Offset of field: aeron_image_constants_stct::source_identity"]
        [::std::mem::offset_of!(aeron_image_constants_stct, source_identity) - 8usize];
    ["Offset of field: aeron_image_constants_stct::correlation_id"]
        [::std::mem::offset_of!(aeron_image_constants_stct, correlation_id) - 16usize];
    ["Offset of field: aeron_image_constants_stct::join_position"]
        [::std::mem::offset_of!(aeron_image_constants_stct, join_position) - 24usize];
    ["Offset of field: aeron_image_constants_stct::position_bits_to_shift"]
        [::std::mem::offset_of!(aeron_image_constants_stct, position_bits_to_shift) - 32usize];
    ["Offset of field: aeron_image_constants_stct::term_buffer_length"]
        [::std::mem::offset_of!(aeron_image_constants_stct, term_buffer_length) - 40usize];
    ["Offset of field: aeron_image_constants_stct::mtu_length"]
        [::std::mem::offset_of!(aeron_image_constants_stct, mtu_length) - 48usize];
    ["Offset of field: aeron_image_constants_stct::session_id"]
        [::std::mem::offset_of!(aeron_image_constants_stct, session_id) - 56usize];
    ["Offset of field: aeron_image_constants_stct::initial_term_id"]
        [::std::mem::offset_of!(aeron_image_constants_stct, initial_term_id) - 60usize];
    ["Offset of field: aeron_image_constants_stct::subscriber_position_id"]
        [::std::mem::offset_of!(aeron_image_constants_stct, subscriber_position_id) - 64usize];
};
impl Default for aeron_image_constants_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Configuration for an image that does not change during it's lifetime."]
pub type aeron_image_constants_t = aeron_image_constants_stct;
unsafe extern "C" {
    #[doc = " Fill in a structure with the constants in use by a image.\n\n @param image to get the constants for.\n @param constants structure to fill in with the constants\n @return 0 for success and -1 for error."]
    pub fn aeron_image_constants(
        image: *mut aeron_image_t,
        constants: *mut aeron_image_constants_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " The position this image has been consumed to by the subscriber.\n\n @param image to query position of.\n @return the position this image has been consumed to by the subscriber."]
    pub fn aeron_image_position(image: *mut aeron_image_t) -> i64;
}
unsafe extern "C" {
    #[doc = " Set the subscriber position for this image to indicate where it has been consumed to.\n\n @param image to set the position of.\n @param new_position for the consumption point."]
    pub fn aeron_image_set_position(
        image: *mut aeron_image_t,
        position: i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Is the current consumed position at the end of the stream?\n\n @param image to check.\n @return true if at the end of the stream or false if not."]
    pub fn aeron_image_is_end_of_stream(image: *mut aeron_image_t) -> bool;
}
unsafe extern "C" {
    #[doc = " The position the stream reached when EOS was received from the publisher. The position will be\n INT64_MAX until the stream ends and EOS is set.\n\n @param image to check.\n @return position the stream reached when EOS was received from the publisher."]
    pub fn aeron_image_end_of_stream_position(image: *mut aeron_image_t) -> i64;
}
unsafe extern "C" {
    #[doc = " Count of observed active transports within the image liveness timeout.\n\n If the image is closed, then this is 0. This may also be 0 if no actual datagrams have arrived. IPC\n Images also will be 0.\n\n @param image to check.\n @return count of active transports - 0 if Image is closed, no datagrams yet, or IPC. Or -1 for error."]
    pub fn aeron_image_active_transport_count(image: *mut aeron_image_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Was the associated publication revoked?\n\n @param image to check\n @return true if the associated publication was revoked."]
    pub fn aeron_image_is_publication_revoked(image: *mut aeron_image_t) -> bool;
}
unsafe extern "C" {
    #[doc = " Poll for new messages in a stream. If new messages are found beyond the last consumed position then they\n will be delivered to the handler up to a limited number of fragments as specified.\n <p>\n Use a fragment assembler to assemble messages which span multiple fragments.\n\n @param image to poll.\n @param handler to which message fragments are delivered.\n @param clientd to pass to the handler.\n @param fragment_limit for the number of fragments to be consumed during one polling operation.\n @return the number of fragments that have been consumed or -1 for error."]
    pub fn aeron_image_poll(
        image: *mut aeron_image_t,
        handler: aeron_fragment_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        fragment_limit: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Poll for new messages in a stream. If new messages are found beyond the last consumed position then they\n will be delivered to the handler up to a limited number of fragments as specified.\n <p>\n Use a controlled fragment assembler to assemble messages which span multiple fragments.\n\n @param image to poll.\n @param handler to which message fragments are delivered.\n @param clientd to pass to the handler.\n @param fragment_limit for the number of fragments to be consumed during one polling operation.\n @return the number of fragments that have been consumed or -1 for error."]
    pub fn aeron_image_controlled_poll(
        image: *mut aeron_image_t,
        handler: aeron_controlled_fragment_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        fragment_limit: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Poll for new messages in a stream. If new messages are found beyond the last consumed position then they\n will be delivered to the handler up to a limited number of fragments as specified or the maximum position specified.\n <p>\n Use a fragment assembler to assemble messages which span multiple fragments.\n\n @param image to poll.\n @param handler to which message fragments are delivered.\n @param clientd to pass to the handler.\n @param limit_position to consume messages up to.\n @param fragment_limit for the number of fragments to be consumed during one polling operation.\n @return the number of fragments that have been consumed or -1 for error."]
    pub fn aeron_image_bounded_poll(
        image: *mut aeron_image_t,
        handler: aeron_fragment_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        limit_position: i64,
        fragment_limit: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Poll for new messages in a stream. If new messages are found beyond the last consumed position then they\n will be delivered to the handler up to a limited number of fragments as specified or the maximum position specified.\n <p>\n Use a controlled fragment assembler to assemble messages which span multiple fragments.\n\n @param image to poll.\n @param handler to which message fragments are delivered.\n @param clientd to pass to the handler.\n @param limit_position to consume messages up to.\n @param fragment_limit for the number of fragments to be consumed during one polling operation.\n @return the number of fragments that have been consumed or -1 for error."]
    pub fn aeron_image_bounded_controlled_poll(
        image: *mut aeron_image_t,
        handler: aeron_controlled_fragment_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        limit_position: i64,
        fragment_limit: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Peek for new messages in a stream by scanning forward from an initial position. If new messages are found then\n they will be delivered to the handler up to a limited position.\n <p>\n Use a controlled fragment assembler to assemble messages which span multiple fragments. Scans must also\n start at the beginning of a message so that the assembler is reset.\n\n @param image to peek.\n @param initial_position from which to peek forward.\n @param handler to which message fragments are delivered.\n @param clientd to pass to the handler.\n @param limit_position up to which can be scanned.\n @return the resulting position after the scan terminates which is a complete message or -1 for error."]
    pub fn aeron_image_controlled_peek(
        image: *mut aeron_image_t,
        initial_position: i64,
        handler: aeron_controlled_fragment_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        limit_position: i64,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Poll for new messages in a stream. If new messages are found beyond the last consumed position then they\n will be delivered to the handler up to a limited number of bytes.\n <p>\n A scan will terminate if a padding frame is encountered. If first frame in a scan is padding then a block\n for the padding is notified. If the padding comes after the first frame in a scan then the scan terminates\n at the offset the padding frame begins. Padding frames are delivered singularly in a block.\n <p>\n Padding frames may be for a greater range than the limit offset but only the header needs to be valid so\n relevant length of the frame is data header length.\n\n @param image to poll.\n @param handler to which block is delivered.\n @param clientd to pass to the handler.\n @param block_length_limit up to which a block may be in length.\n @return the number of bytes that have been consumed or -1 for error."]
    pub fn aeron_image_block_poll(
        image: *mut aeron_image_t,
        handler: aeron_block_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        block_length_limit: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_image_is_closed(image: *mut aeron_image_t) -> bool;
}
unsafe extern "C" {
    pub fn aeron_image_reject(
        image: *mut aeron_image_t,
        reason: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Create an image fragment assembler for use with a single image.\n\n @param assembler to be set when created successfully.\n @param delegate to call on completed.\n @param delegate_clientd to pass to delegate handler.\n @return 0 for success and -1 for error."]
    pub fn aeron_image_fragment_assembler_create(
        assembler: *mut *mut aeron_image_fragment_assembler_t,
        delegate: aeron_fragment_handler_t,
        delegate_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Delete an image fragment assembler.\n\n @param assembler to delete.\n @return 0 for success or -1 for error."]
    pub fn aeron_image_fragment_assembler_delete(
        assembler: *mut aeron_image_fragment_assembler_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Handler function to be passed for handling fragment assembly.\n\n @param clientd passed in the poll call (must be a aeron_image_fragment_assembler_t)\n @param buffer containing the data.\n @param length of the data in bytes.\n @param header representing the meta data for the data."]
    pub fn aeron_image_fragment_assembler_handler(
        clientd: *mut ::std::os::raw::c_void,
        buffer: *const u8,
        length: usize,
        header: *mut aeron_header_t,
    );
}
unsafe extern "C" {
    #[doc = " Create an image controlled fragment assembler for use with a single image.\n\n @param assembler to be set when created successfully.\n @param delegate to call on completed\n @param delegate_clientd to pass to delegate handler.\n @return 0 for success and -1 for error."]
    pub fn aeron_image_controlled_fragment_assembler_create(
        assembler: *mut *mut aeron_image_controlled_fragment_assembler_t,
        delegate: aeron_controlled_fragment_handler_t,
        delegate_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Delete an image controlled fragment assembler.\n\n @param assembler to delete.\n @return 0 for success or -1 for error."]
    pub fn aeron_image_controlled_fragment_assembler_delete(
        assembler: *mut aeron_image_controlled_fragment_assembler_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Handler function to be passed for handling fragment assembly.\n\n @param clientd passed in the poll call (must be a aeron_image_controlled_fragment_assembler_t)\n @param buffer containing the data.\n @param length of the data in bytes.\n @param header representing the meta data for the data.\n @return The action to be taken with regard to the stream position after the callback."]
    pub fn aeron_image_controlled_fragment_assembler_handler(
        clientd: *mut ::std::os::raw::c_void,
        buffer: *const u8,
        length: usize,
        header: *mut aeron_header_t,
    ) -> aeron_controlled_fragment_handler_action_t;
}
unsafe extern "C" {
    #[doc = " Create a fragment assembler for use with a subscription.\n\n @param assembler to be set when created successfully.\n @param delegate to call on completed\n @param delegate_clientd to pass to delegate handler.\n @return 0 for success and -1 for error."]
    pub fn aeron_fragment_assembler_create(
        assembler: *mut *mut aeron_fragment_assembler_t,
        delegate: aeron_fragment_handler_t,
        delegate_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Delete a fragment assembler.\n\n @param assembler to delete.\n @return 0 for success or -1 for error."]
    pub fn aeron_fragment_assembler_delete(
        assembler: *mut aeron_fragment_assembler_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Handler function to be passed for handling fragment assembly.\n\n @param clientd passed in the poll call (must be a aeron_fragment_assembler_t)\n @param buffer containing the data.\n @param length of the data in bytes.\n @param header representing the meta data for the data."]
    pub fn aeron_fragment_assembler_handler(
        clientd: *mut ::std::os::raw::c_void,
        buffer: *const u8,
        length: usize,
        header: *mut aeron_header_t,
    );
}
unsafe extern "C" {
    #[doc = " Create a controlled fragment assembler for use with a subscription.\n\n @param assembler to be set when created successfully.\n @param delegate to call on completed\n @param delegate_clientd to pass to delegate handler.\n @return 0 for success and -1 for error."]
    pub fn aeron_controlled_fragment_assembler_create(
        assembler: *mut *mut aeron_controlled_fragment_assembler_t,
        delegate: aeron_controlled_fragment_handler_t,
        delegate_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Delete a controlled fragment assembler.\n\n @param assembler to delete.\n @return 0 for success or -1 for error."]
    pub fn aeron_controlled_fragment_assembler_delete(
        assembler: *mut aeron_controlled_fragment_assembler_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Handler function to be passed for handling fragment assembly.\n\n @param clientd passed in the poll call (must be a aeron_controlled_fragment_assembler_t)\n @param buffer containing the data.\n @param length of the data in bytes.\n @param header representing the meta data for the data.\n @return The action to be taken with regard to the stream position after the callback."]
    pub fn aeron_controlled_fragment_assembler_handler(
        clientd: *mut ::std::os::raw::c_void,
        buffer: *const u8,
        length: usize,
        header: *mut aeron_header_t,
    ) -> aeron_controlled_fragment_handler_action_t;
}
unsafe extern "C" {
    #[doc = " Return a pointer to the counter value.\n\n @param counter to pointer to.\n @return pointer to the counter value."]
    pub fn aeron_counter_addr(counter: *mut aeron_counter_t) -> *mut i64;
}
#[doc = " Configuration for a counter that does not change during it's lifetime."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_counter_constants_stct {
    #[doc = " Return the registration id used to register this counter with the media driver."]
    pub registration_id: i64,
    #[doc = " Identity for the counter within the counters reader and counters manager."]
    pub counter_id: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_counter_constants_stct"]
        [::std::mem::size_of::<aeron_counter_constants_stct>() - 16usize];
    ["Alignment of aeron_counter_constants_stct"]
        [::std::mem::align_of::<aeron_counter_constants_stct>() - 8usize];
    ["Offset of field: aeron_counter_constants_stct::registration_id"]
        [::std::mem::offset_of!(aeron_counter_constants_stct, registration_id) - 0usize];
    ["Offset of field: aeron_counter_constants_stct::counter_id"]
        [::std::mem::offset_of!(aeron_counter_constants_stct, counter_id) - 8usize];
};
#[doc = " Configuration for a counter that does not change during it's lifetime."]
pub type aeron_counter_constants_t = aeron_counter_constants_stct;
unsafe extern "C" {
    #[doc = " Fill in a structure with the constants in use by a counter.\n\n @param counter to get the constants for.\n @param constants structure to fill in with the constants.\n @return 0 for success and -1 for error."]
    pub fn aeron_counter_constants(
        counter: *mut aeron_counter_t,
        constants: *mut aeron_counter_constants_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Asynchronously close the counter.\n\n @param counter to close.\n @return 0 for success or -1 for error."]
    pub fn aeron_counter_close(
        counter: *mut aeron_counter_t,
        on_close_complete: aeron_notification_t,
        on_close_complete_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Check if the counter is closed\n @param counter to check\n @return true if closed, false otherwise."]
    pub fn aeron_counter_is_closed(counter: *mut aeron_counter_t) -> bool;
}
unsafe extern "C" {
    #[doc = " Return full version and build string.\n\n @return full version and build string."]
    pub fn aeron_version_full() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " Return version text.\n\n @return version text."]
    pub fn aeron_version_text() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " Return major version number.\n\n @return major version number."]
    pub fn aeron_version_major() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Return minor version number.\n\n @return minor version number."]
    pub fn aeron_version_minor() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Return patch version number.\n\n @return patch version number."]
    pub fn aeron_version_patch() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Return the git sha for the current build.\n\n @return git version"]
    pub fn aeron_version_gitsha() -> *const ::std::os::raw::c_char;
}
#[doc = " Clock function used by aeron."]
pub type aeron_clock_func_t = ::std::option::Option<unsafe extern "C" fn() -> i64>;
unsafe extern "C" {
    #[doc = " Return time in nanoseconds for machine. Is not wall clock time.\n\n @return nanoseconds since epoch for machine."]
    pub fn aeron_nano_clock() -> i64;
}
unsafe extern "C" {
    #[doc = " Return time in milliseconds since epoch. Is wall clock time.\n\n @return milliseconds since epoch."]
    pub fn aeron_epoch_clock() -> i64;
}
#[doc = " Function to return logging information."]
pub type aeron_log_func_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char)>;
unsafe extern "C" {
    #[doc = " Determine if an aeron driver is using a given aeron directory.\n\n @param dirname  for aeron directory\n @param timeout_ms  to use to determine activity for aeron directory\n @param log_func to call during activity check to log diagnostic information.\n @return true for active driver or false for no active driver."]
    pub fn aeron_is_driver_active(
        dirname: *const ::std::os::raw::c_char,
        timeout_ms: i64,
        log_func: aeron_log_func_t,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Load properties from a string containing name=value pairs and set appropriate environment variables for the\n process so that subsequent calls to aeron_driver_context_init will use those values.\n\n @param buffer containing properties and values.\n @return 0 for success and -1 for error."]
    pub fn aeron_properties_buffer_load(
        buffer: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Load properties file and set appropriate environment variables for the process so that subsequent\n calls to aeron_driver_context_init will use those values.\n\n @param filename to load.\n @return 0 for success and -1 for error."]
    pub fn aeron_properties_file_load(
        filename: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Load properties from HTTP URL and set environment variables for the process so that subsequent\n calls to aeron_driver_context_init will use those values.\n\n @param url to attempt to retrieve and load.\n @return 0 for success and -1 for error."]
    pub fn aeron_properties_http_load(url: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Load properties based on URL or filename. If string contains file or http URL, it will attempt\n to load properties from a file or http as indicated. If not a URL, then it will try to load the string\n as a filename.\n\n @param url_or_filename to load properties from.\n @return 0 for success and -1 for error."]
    pub fn aeron_properties_load(
        url_or_filename: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Return current aeron error code (errno) for calling thread.\n\n @return aeron error code for calling thread."]
    pub fn aeron_errcode() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Return the current aeron error message for calling thread.\n\n @return aeron error message for calling thread."]
    pub fn aeron_errmsg() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " Get the default path used by the Aeron media driver.\n\n @param path buffer to store the path.\n @param path_length space available in the buffer\n @return -1 if there is an issue or the number of bytes written to path excluding the terminator <code>\\0</code>. If this\n is equal to or greater than the path_length then the path has been truncated."]
    pub fn aeron_default_path(
        path: *mut ::std::os::raw::c_char,
        path_length: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Gets the registration id for addition of the counter. Note that using this after a call to poll the succeeds or\n errors is undefined behaviour. As the async_add_counter_t may have been freed.\n\n @param add_counter used to check for completion.\n @return registration id for the counter."]
    pub fn aeron_async_add_counter_get_registration_id(
        add_counter: *mut aeron_async_add_counter_t,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Gets the registration id for addition of the publication. Note that using this after a call to poll the succeeds or\n errors is undefined behaviour. As the async_add_publication_t may have been freed.\n\n @param add_publication used to check for completion.\n @return registration id for the publication."]
    pub fn aeron_async_add_publication_get_registration_id(
        add_publication: *mut aeron_async_add_publication_t,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Gets the registration id for addition of the exclusive_publication. Note that using this after a call to poll the\n succeeds or errors is undefined behaviour. As the async_add_exclusive_publication_t may have been freed.\n\n @param add_exclusive_publication used to check for completion.\n @return registration id for the exclusive_publication.\n @deprecated Use aeron_async_add_exclusive_publication_get_registration_id instead."]
    pub fn aeron_async_add_exclusive_exclusive_publication_get_registration_id(
        add_exclusive_publication: *mut aeron_async_add_exclusive_publication_t,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Gets the registration id for addition of the exclusive_publication. Note that using this after a call to poll the\n succeeds or errors is undefined behaviour. As the async_add_exclusive_publication_t may have been freed.\n\n @param add_exclusive_publication used to check for completion.\n @return registration id for the exclusive_publication."]
    pub fn aeron_async_add_exclusive_publication_get_registration_id(
        add_exclusive_publication: *mut aeron_async_add_exclusive_publication_t,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Gets the registration id for addition of the subscription. Note that using this after a call to poll the succeeds or\n errors is undefined behaviour. As the async_add_subscription_t may have been freed.\n\n @param add_subscription used to check for completion.\n @return registration id for the subscription."]
    pub fn aeron_async_add_subscription_get_registration_id(
        add_subscription: *mut aeron_async_add_subscription_t,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Gets the registration_id for the destination command supplied. Note that this is the correlation_id used for\n the specified destination command, not the registration_id for the original parent resource (publication,\n subscription).\n\n @param async_destination tracking the current destination command.\n @return correlation_id sent to driver."]
    pub fn aeron_async_destination_get_registration_id(
        async_destination: *mut aeron_async_destination_t,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " Request the media driver terminates operation and closes all resources.\n\n @param directory    in which the media driver is running.\n @param token_buffer containing the authentication token confirming the client is allowed to terminate the driver.\n @param token_length of the token in the buffer.\n @return"]
    pub fn aeron_context_request_driver_termination(
        directory: *const ::std::os::raw::c_char,
        token_buffer: *const u8,
        token_length: usize,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aeron_cnc_stct {
    _unused: [u8; 0],
}
pub type aeron_cnc_t = aeron_cnc_stct;
#[repr(C, packed(4))]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_cnc_constants_stct {
    pub cnc_version: i32,
    pub to_driver_buffer_length: i32,
    pub to_clients_buffer_length: i32,
    pub counter_metadata_buffer_length: i32,
    pub counter_values_buffer_length: i32,
    pub error_log_buffer_length: i32,
    pub client_liveness_timeout: i64,
    pub start_timestamp: i64,
    pub pid: i64,
    pub file_page_size: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_cnc_constants_stct"]
        [::std::mem::size_of::<aeron_cnc_constants_stct>() - 52usize];
    ["Alignment of aeron_cnc_constants_stct"]
        [::std::mem::align_of::<aeron_cnc_constants_stct>() - 4usize];
    ["Offset of field: aeron_cnc_constants_stct::cnc_version"]
        [::std::mem::offset_of!(aeron_cnc_constants_stct, cnc_version) - 0usize];
    ["Offset of field: aeron_cnc_constants_stct::to_driver_buffer_length"]
        [::std::mem::offset_of!(aeron_cnc_constants_stct, to_driver_buffer_length) - 4usize];
    ["Offset of field: aeron_cnc_constants_stct::to_clients_buffer_length"]
        [::std::mem::offset_of!(aeron_cnc_constants_stct, to_clients_buffer_length) - 8usize];
    ["Offset of field: aeron_cnc_constants_stct::counter_metadata_buffer_length"][::std::mem::offset_of!(
        aeron_cnc_constants_stct,
        counter_metadata_buffer_length
    ) - 12usize];
    ["Offset of field: aeron_cnc_constants_stct::counter_values_buffer_length"]
        [::std::mem::offset_of!(aeron_cnc_constants_stct, counter_values_buffer_length) - 16usize];
    ["Offset of field: aeron_cnc_constants_stct::error_log_buffer_length"]
        [::std::mem::offset_of!(aeron_cnc_constants_stct, error_log_buffer_length) - 20usize];
    ["Offset of field: aeron_cnc_constants_stct::client_liveness_timeout"]
        [::std::mem::offset_of!(aeron_cnc_constants_stct, client_liveness_timeout) - 24usize];
    ["Offset of field: aeron_cnc_constants_stct::start_timestamp"]
        [::std::mem::offset_of!(aeron_cnc_constants_stct, start_timestamp) - 32usize];
    ["Offset of field: aeron_cnc_constants_stct::pid"]
        [::std::mem::offset_of!(aeron_cnc_constants_stct, pid) - 40usize];
    ["Offset of field: aeron_cnc_constants_stct::file_page_size"]
        [::std::mem::offset_of!(aeron_cnc_constants_stct, file_page_size) - 48usize];
};
pub type aeron_cnc_constants_t = aeron_cnc_constants_stct;
unsafe extern "C" {
    #[doc = " Initialise an aeron_cnc, which gives user level access to the command and control file used to communicate\n with the media driver. Will wait until the media driver has loaded and the cnc file is created, up to timeout_ms.\n Use a value of 0 for a non-blocking initialisation.\n\n @param aeron_cnc to hold the loaded aeron_cnc\n @param base_path media driver's base path\n @param timeout_ms Number of milliseconds to wait before timing out.\n @return 0 on success, -1 on failure."]
    pub fn aeron_cnc_init(
        aeron_cnc: *mut *mut aeron_cnc_t,
        base_path: *const ::std::os::raw::c_char,
        timeout_ms: i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Fetch the sets of constant values associated with this command and control file.\n\n @param aeron_cnc to query\n @param constants user supplied structure to hold return values.\n @return 0 on success, -1 on failure."]
    pub fn aeron_cnc_constants(
        aeron_cnc: *mut aeron_cnc_t,
        constants: *mut aeron_cnc_constants_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get the current file name of the cnc file.\n\n @param aeron_cnc to query\n @return name of the cnc file"]
    pub fn aeron_cnc_filename(aeron_cnc: *mut aeron_cnc_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " Gets the timestamp of the last heartbeat sent to the media driver from any client.\n\n @param aeron_cnc to query\n @return last heartbeat timestamp in ms."]
    pub fn aeron_cnc_to_driver_heartbeat(aeron_cnc: *mut aeron_cnc_t) -> i64;
}
pub type aeron_error_log_reader_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        observation_count: i32,
        first_observation_timestamp: i64,
        last_observation_timestamp: i64,
        error: *const ::std::os::raw::c_char,
        error_length: usize,
        clientd: *mut ::std::os::raw::c_void,
    ),
>;
unsafe extern "C" {
    #[doc = " Reads the current error log for this driver.\n\n @param aeron_cnc to query\n @param callback called for every distinct error observation\n @param clientd client data to be passed to the callback\n @param since_timestamp only return errors after this timestamp (0 returns all)\n @return the number of distinct errors seen"]
    pub fn aeron_cnc_error_log_read(
        aeron_cnc: *mut aeron_cnc_t,
        callback: aeron_error_log_reader_func_t,
        clientd: *mut ::std::os::raw::c_void,
        since_timestamp: i64,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = " Gets a counters reader for this command and control file. This does not need to be closed manually, resources\n are tied to the instance of aeron_cnc.\n\n @param aeron_cnc to query\n @return pointer to a counters reader."]
    pub fn aeron_cnc_counters_reader(aeron_cnc: *mut aeron_cnc_t) -> *mut aeron_counters_reader_t;
}
pub type aeron_loss_reporter_read_entry_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        observation_count: i64,
        total_bytes_lost: i64,
        first_observation_timestamp: i64,
        last_observation_timestamp: i64,
        session_id: i32,
        stream_id: i32,
        channel: *const ::std::os::raw::c_char,
        channel_length: i32,
        source: *const ::std::os::raw::c_char,
        source_length: i32,
    ),
>;
unsafe extern "C" {
    #[doc = " Read all of the data loss observations from the report in the same media driver instances as the cnc file.\n\n @param aeron_cnc to query\n @param entry_func callback for each observation found\n @param clientd client data to be passed to the callback.\n @return -1 on failure, number of observations on success (could be 0)."]
    pub fn aeron_cnc_loss_reporter_read(
        aeron_cnc: *mut aeron_cnc_t,
        entry_func: aeron_loss_reporter_read_entry_func_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Closes the instance of the aeron cnc and frees its resources.\n\n @param aeron_cnc to close"]
    pub fn aeron_cnc_close(aeron_cnc: *mut aeron_cnc_t);
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct timespec {
    pub tv_sec: __darwin_time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
unsafe extern "C" {
    pub fn aeron_randomised_int32() -> i32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_clock_cache_stct {
    pub pre_pad: [u8; 56usize],
    pub cached_epoch_time: i64,
    pub cached_nano_time: i64,
    pub post_pad: [u8; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_clock_cache_stct"][::std::mem::size_of::<aeron_clock_cache_stct>() - 128usize];
    ["Alignment of aeron_clock_cache_stct"]
        [::std::mem::align_of::<aeron_clock_cache_stct>() - 8usize];
    ["Offset of field: aeron_clock_cache_stct::pre_pad"]
        [::std::mem::offset_of!(aeron_clock_cache_stct, pre_pad) - 0usize];
    ["Offset of field: aeron_clock_cache_stct::cached_epoch_time"]
        [::std::mem::offset_of!(aeron_clock_cache_stct, cached_epoch_time) - 56usize];
    ["Offset of field: aeron_clock_cache_stct::cached_nano_time"]
        [::std::mem::offset_of!(aeron_clock_cache_stct, cached_nano_time) - 64usize];
    ["Offset of field: aeron_clock_cache_stct::post_pad"]
        [::std::mem::offset_of!(aeron_clock_cache_stct, post_pad) - 72usize];
};
impl Default for aeron_clock_cache_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_clock_cache_t = aeron_clock_cache_stct;
unsafe extern "C" {
    #[doc = " Update the cached clock with the current epoch and nano time values.\n\n @param cached_clock 'this'\n @param epoch_time current ms since epoch.\n @param nano_time current ns time."]
    pub fn aeron_clock_update_cached_time(
        cached_clock: *mut aeron_clock_cache_t,
        epoch_time: i64,
        nano_time: i64,
    );
}
unsafe extern "C" {
    #[doc = " Update the cached clock with the current epoch time value.\n\n @param cached_clock 'this'\n @param epoch_time current ms since epoch."]
    pub fn aeron_clock_update_cached_epoch_time(
        cached_clock: *mut aeron_clock_cache_t,
        epoch_time: i64,
    );
}
unsafe extern "C" {
    #[doc = " Update the cached clock with the current nano time value.\n\n @param cached_clock 'this'\n @param nano_time current ns time."]
    pub fn aeron_clock_update_cached_nano_time(
        cached_clock: *mut aeron_clock_cache_t,
        nano_time: i64,
    );
}
unsafe extern "C" {
    #[doc = " Retrieves the cached epoch time from supplied cached clock.\n\n @param cached_clock 'this'\n @return The current cached value for the epoch time."]
    pub fn aeron_clock_cached_epoch_time(cached_clock: *mut aeron_clock_cache_t) -> i64;
}
unsafe extern "C" {
    #[doc = " Retrieves the cached nano time from supplied cached clock.\n\n @param cached_clock 'this'\n @return The current cached value for the nano time."]
    pub fn aeron_clock_cached_nano_time(cached_clock: *mut aeron_clock_cache_t) -> i64;
}
unsafe extern "C" {
    #[doc = " Allocate a cached clock.\n\n @param cached_clock Pointer to the pointer to be initialised with the new cached clock\n @return -1 if allocation fails, e.g. out of memory."]
    pub fn aeron_clock_cache_alloc(
        cached_clock: *mut *mut aeron_clock_cache_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get the realtime from the system in timespec format\n\n @param time value to fill with the current time\n @return 0 on success, -1 on failure."]
    pub fn aeron_clock_gettime_realtime(time: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_thread_set_name(role_name: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn aeron_nano_sleep(nanoseconds: u64);
}
unsafe extern "C" {
    pub fn aeron_micro_sleep(microseconds: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn aeron_thread_set_affinity(
        role_name: *const ::std::os::raw::c_char,
        cpu_affinity_no: u8,
    ) -> ::std::os::raw::c_int;
}
pub type pthread_cond_t = __darwin_pthread_cond_t;
pub type pthread_mutex_t = __darwin_pthread_mutex_t;
pub type pthread_t = __darwin_pthread_t;
pub type aeron_mutex_t = pthread_mutex_t;
pub type aeron_thread_t = pthread_t;
pub type aeron_thread_attr_t = pthread_attr_t;
pub type aeron_cond_t = pthread_cond_t;
#[repr(C, packed(4))]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_error_log_entry_stct {
    pub length: i32,
    pub observation_count: i32,
    pub last_observation_timestamp: i64,
    pub first_observation_timestamp: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_error_log_entry_stct"]
        [::std::mem::size_of::<aeron_error_log_entry_stct>() - 24usize];
    ["Alignment of aeron_error_log_entry_stct"]
        [::std::mem::align_of::<aeron_error_log_entry_stct>() - 4usize];
    ["Offset of field: aeron_error_log_entry_stct::length"]
        [::std::mem::offset_of!(aeron_error_log_entry_stct, length) - 0usize];
    ["Offset of field: aeron_error_log_entry_stct::observation_count"]
        [::std::mem::offset_of!(aeron_error_log_entry_stct, observation_count) - 4usize];
    ["Offset of field: aeron_error_log_entry_stct::last_observation_timestamp"]
        [::std::mem::offset_of!(aeron_error_log_entry_stct, last_observation_timestamp) - 8usize];
    ["Offset of field: aeron_error_log_entry_stct::first_observation_timestamp"]
        [::std::mem::offset_of!(aeron_error_log_entry_stct, first_observation_timestamp) - 16usize];
};
pub type aeron_error_log_entry_t = aeron_error_log_entry_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_distinct_observation_stct {
    pub description: *const ::std::os::raw::c_char,
    pub error_code: ::std::os::raw::c_int,
    pub offset: usize,
    pub description_length: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_distinct_observation_stct"]
        [::std::mem::size_of::<aeron_distinct_observation_stct>() - 32usize];
    ["Alignment of aeron_distinct_observation_stct"]
        [::std::mem::align_of::<aeron_distinct_observation_stct>() - 8usize];
    ["Offset of field: aeron_distinct_observation_stct::description"]
        [::std::mem::offset_of!(aeron_distinct_observation_stct, description) - 0usize];
    ["Offset of field: aeron_distinct_observation_stct::error_code"]
        [::std::mem::offset_of!(aeron_distinct_observation_stct, error_code) - 8usize];
    ["Offset of field: aeron_distinct_observation_stct::offset"]
        [::std::mem::offset_of!(aeron_distinct_observation_stct, offset) - 16usize];
    ["Offset of field: aeron_distinct_observation_stct::description_length"]
        [::std::mem::offset_of!(aeron_distinct_observation_stct, description_length) - 24usize];
};
impl Default for aeron_distinct_observation_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_distinct_observation_t = aeron_distinct_observation_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_distinct_error_log_observation_list_stct {
    pub num_observations: u64,
    pub observations: *mut aeron_distinct_observation_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_distinct_error_log_observation_list_stct"]
        [::std::mem::size_of::<aeron_distinct_error_log_observation_list_stct>() - 16usize];
    ["Alignment of aeron_distinct_error_log_observation_list_stct"]
        [::std::mem::align_of::<aeron_distinct_error_log_observation_list_stct>() - 8usize];
    ["Offset of field: aeron_distinct_error_log_observation_list_stct::num_observations"][::std::mem::offset_of!(
        aeron_distinct_error_log_observation_list_stct,
        num_observations
    )
        - 0usize];
    ["Offset of field: aeron_distinct_error_log_observation_list_stct::observations"][::std::mem::offset_of!(
        aeron_distinct_error_log_observation_list_stct,
        observations
    ) - 8usize];
};
impl Default for aeron_distinct_error_log_observation_list_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_distinct_error_log_observation_list_t =
    aeron_distinct_error_log_observation_list_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_distinct_error_log_stct {
    pub buffer: *mut u8,
    pub observation_list: *mut aeron_distinct_error_log_observation_list_t,
    pub buffer_capacity: usize,
    pub next_offset: usize,
    pub clock: aeron_clock_func_t,
    pub mutex: aeron_mutex_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_distinct_error_log_stct"]
        [::std::mem::size_of::<aeron_distinct_error_log_stct>() - 104usize];
    ["Alignment of aeron_distinct_error_log_stct"]
        [::std::mem::align_of::<aeron_distinct_error_log_stct>() - 8usize];
    ["Offset of field: aeron_distinct_error_log_stct::buffer"]
        [::std::mem::offset_of!(aeron_distinct_error_log_stct, buffer) - 0usize];
    ["Offset of field: aeron_distinct_error_log_stct::observation_list"]
        [::std::mem::offset_of!(aeron_distinct_error_log_stct, observation_list) - 8usize];
    ["Offset of field: aeron_distinct_error_log_stct::buffer_capacity"]
        [::std::mem::offset_of!(aeron_distinct_error_log_stct, buffer_capacity) - 16usize];
    ["Offset of field: aeron_distinct_error_log_stct::next_offset"]
        [::std::mem::offset_of!(aeron_distinct_error_log_stct, next_offset) - 24usize];
    ["Offset of field: aeron_distinct_error_log_stct::clock"]
        [::std::mem::offset_of!(aeron_distinct_error_log_stct, clock) - 32usize];
    ["Offset of field: aeron_distinct_error_log_stct::mutex"]
        [::std::mem::offset_of!(aeron_distinct_error_log_stct, mutex) - 40usize];
};
impl Default for aeron_distinct_error_log_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_distinct_error_log_t = aeron_distinct_error_log_stct;
unsafe extern "C" {
    pub fn aeron_distinct_error_log_init(
        log: *mut aeron_distinct_error_log_t,
        buffer: *mut u8,
        buffer_size: usize,
        clock: aeron_clock_func_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_distinct_error_log_close(log: *mut aeron_distinct_error_log_t);
}
unsafe extern "C" {
    pub fn aeron_distinct_error_log_record(
        log: *mut aeron_distinct_error_log_t,
        error_code: ::std::os::raw::c_int,
        description: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_error_log_exists(buffer: *const u8, buffer_size: usize) -> bool;
}
unsafe extern "C" {
    pub fn aeron_error_log_read(
        buffer: *const u8,
        buffer_size: usize,
        reader: aeron_error_log_reader_func_t,
        clientd: *mut ::std::os::raw::c_void,
        since_timestamp: i64,
    ) -> usize;
}
unsafe extern "C" {
    pub fn aeron_distinct_error_log_num_observations(log: *mut aeron_distinct_error_log_t)
    -> usize;
}
pub type aeron_idle_strategy_func_t = ::std::option::Option<
    unsafe extern "C" fn(state: *mut ::std::os::raw::c_void, work_count: ::std::os::raw::c_int),
>;
pub type aeron_idle_strategy_init_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        state: *mut *mut ::std::os::raw::c_void,
        env_var: *const ::std::os::raw::c_char,
        init_args: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn aeron_semantic_version_compose(major: u8, minor: u8, patch: u8) -> i32;
}
unsafe extern "C" {
    pub fn aeron_semantic_version_major(version: i32) -> u8;
}
unsafe extern "C" {
    pub fn aeron_semantic_version_minor(version: i32) -> u8;
}
unsafe extern "C" {
    pub fn aeron_semantic_version_patch(version: i32) -> u8;
}
pub type aeron_fptr_t = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_uri_param_stct {
    pub key: *const ::std::os::raw::c_char,
    pub value: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_uri_param_stct"][::std::mem::size_of::<aeron_uri_param_stct>() - 16usize];
    ["Alignment of aeron_uri_param_stct"][::std::mem::align_of::<aeron_uri_param_stct>() - 8usize];
    ["Offset of field: aeron_uri_param_stct::key"]
        [::std::mem::offset_of!(aeron_uri_param_stct, key) - 0usize];
    ["Offset of field: aeron_uri_param_stct::value"]
        [::std::mem::offset_of!(aeron_uri_param_stct, value) - 8usize];
};
impl Default for aeron_uri_param_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_uri_param_t = aeron_uri_param_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_uri_params_stct {
    pub length: usize,
    pub array: *mut aeron_uri_param_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_uri_params_stct"][::std::mem::size_of::<aeron_uri_params_stct>() - 16usize];
    ["Alignment of aeron_uri_params_stct"]
        [::std::mem::align_of::<aeron_uri_params_stct>() - 8usize];
    ["Offset of field: aeron_uri_params_stct::length"]
        [::std::mem::offset_of!(aeron_uri_params_stct, length) - 0usize];
    ["Offset of field: aeron_uri_params_stct::array"]
        [::std::mem::offset_of!(aeron_uri_params_stct, array) - 8usize];
};
impl Default for aeron_uri_params_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_uri_params_t = aeron_uri_params_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_udp_channel_params_stct {
    pub endpoint: *const ::std::os::raw::c_char,
    pub bind_interface: *const ::std::os::raw::c_char,
    pub control: *const ::std::os::raw::c_char,
    pub control_mode: *const ::std::os::raw::c_char,
    pub channel_tag: *const ::std::os::raw::c_char,
    pub entity_tag: *const ::std::os::raw::c_char,
    pub ttl: *const ::std::os::raw::c_char,
    pub additional_params: aeron_uri_params_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_udp_channel_params_stct"]
        [::std::mem::size_of::<aeron_udp_channel_params_stct>() - 72usize];
    ["Alignment of aeron_udp_channel_params_stct"]
        [::std::mem::align_of::<aeron_udp_channel_params_stct>() - 8usize];
    ["Offset of field: aeron_udp_channel_params_stct::endpoint"]
        [::std::mem::offset_of!(aeron_udp_channel_params_stct, endpoint) - 0usize];
    ["Offset of field: aeron_udp_channel_params_stct::bind_interface"]
        [::std::mem::offset_of!(aeron_udp_channel_params_stct, bind_interface) - 8usize];
    ["Offset of field: aeron_udp_channel_params_stct::control"]
        [::std::mem::offset_of!(aeron_udp_channel_params_stct, control) - 16usize];
    ["Offset of field: aeron_udp_channel_params_stct::control_mode"]
        [::std::mem::offset_of!(aeron_udp_channel_params_stct, control_mode) - 24usize];
    ["Offset of field: aeron_udp_channel_params_stct::channel_tag"]
        [::std::mem::offset_of!(aeron_udp_channel_params_stct, channel_tag) - 32usize];
    ["Offset of field: aeron_udp_channel_params_stct::entity_tag"]
        [::std::mem::offset_of!(aeron_udp_channel_params_stct, entity_tag) - 40usize];
    ["Offset of field: aeron_udp_channel_params_stct::ttl"]
        [::std::mem::offset_of!(aeron_udp_channel_params_stct, ttl) - 48usize];
    ["Offset of field: aeron_udp_channel_params_stct::additional_params"]
        [::std::mem::offset_of!(aeron_udp_channel_params_stct, additional_params) - 56usize];
};
impl Default for aeron_udp_channel_params_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_udp_channel_params_t = aeron_udp_channel_params_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_ipc_channel_params_stct {
    pub channel_tag: *const ::std::os::raw::c_char,
    pub entity_tag: *const ::std::os::raw::c_char,
    pub additional_params: aeron_uri_params_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_ipc_channel_params_stct"]
        [::std::mem::size_of::<aeron_ipc_channel_params_stct>() - 32usize];
    ["Alignment of aeron_ipc_channel_params_stct"]
        [::std::mem::align_of::<aeron_ipc_channel_params_stct>() - 8usize];
    ["Offset of field: aeron_ipc_channel_params_stct::channel_tag"]
        [::std::mem::offset_of!(aeron_ipc_channel_params_stct, channel_tag) - 0usize];
    ["Offset of field: aeron_ipc_channel_params_stct::entity_tag"]
        [::std::mem::offset_of!(aeron_ipc_channel_params_stct, entity_tag) - 8usize];
    ["Offset of field: aeron_ipc_channel_params_stct::additional_params"]
        [::std::mem::offset_of!(aeron_ipc_channel_params_stct, additional_params) - 16usize];
};
impl Default for aeron_ipc_channel_params_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_ipc_channel_params_t = aeron_ipc_channel_params_stct;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum aeron_uri_type_enum {
    AERON_URI_UDP = 0,
    AERON_URI_IPC = 1,
    AERON_URI_UNKNOWN = 2,
}
pub use self::aeron_uri_type_enum as aeron_uri_type_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_uri_stct {
    pub mutable_uri: [::std::os::raw::c_char; 4096usize],
    pub type_: aeron_uri_type_t,
    pub params: aeron_uri_stct__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union aeron_uri_stct__bindgen_ty_1 {
    pub udp: aeron_udp_channel_params_t,
    pub ipc: aeron_ipc_channel_params_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_uri_stct__bindgen_ty_1"]
        [::std::mem::size_of::<aeron_uri_stct__bindgen_ty_1>() - 72usize];
    ["Alignment of aeron_uri_stct__bindgen_ty_1"]
        [::std::mem::align_of::<aeron_uri_stct__bindgen_ty_1>() - 8usize];
    ["Offset of field: aeron_uri_stct__bindgen_ty_1::udp"]
        [::std::mem::offset_of!(aeron_uri_stct__bindgen_ty_1, udp) - 0usize];
    ["Offset of field: aeron_uri_stct__bindgen_ty_1::ipc"]
        [::std::mem::offset_of!(aeron_uri_stct__bindgen_ty_1, ipc) - 0usize];
};
impl Default for aeron_uri_stct__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_uri_stct"][::std::mem::size_of::<aeron_uri_stct>() - 4176usize];
    ["Alignment of aeron_uri_stct"][::std::mem::align_of::<aeron_uri_stct>() - 8usize];
    ["Offset of field: aeron_uri_stct::mutable_uri"]
        [::std::mem::offset_of!(aeron_uri_stct, mutable_uri) - 0usize];
    ["Offset of field: aeron_uri_stct::type_"]
        [::std::mem::offset_of!(aeron_uri_stct, type_) - 4096usize];
    ["Offset of field: aeron_uri_stct::params"]
        [::std::mem::offset_of!(aeron_uri_stct, params) - 4104usize];
};
impl Default for aeron_uri_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_uri_t = aeron_uri_stct;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum aeron_uri_ats_status_en {
    AERON_URI_ATS_STATUS_DEFAULT = 0,
    AERON_URI_ATS_STATUS_ENABLED = 1,
    AERON_URI_ATS_STATUS_DISABLED = 2,
}
pub use self::aeron_uri_ats_status_en as aeron_uri_ats_status_t;
pub type aeron_uri_parse_callback_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        key: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn aeron_uri_parse_params(
        uri: *mut ::std::os::raw::c_char,
        param_func: aeron_uri_parse_callback_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_uri_parse(
        uri_length: usize,
        uri: *const ::std::os::raw::c_char,
        params: *mut aeron_uri_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_uri_close(params: *mut aeron_uri_t);
}
unsafe extern "C" {
    pub fn aeron_uri_multicast_ttl(uri: *mut aeron_uri_t) -> u8;
}
unsafe extern "C" {
    pub fn aeron_uri_find_param_value(
        uri_params: *const aeron_uri_params_t,
        key: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_uri_get_int32(
        uri_params: *mut aeron_uri_params_t,
        key: *const ::std::os::raw::c_char,
        retval: *mut i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_uri_get_int64(
        uri_params: *mut aeron_uri_params_t,
        key: *const ::std::os::raw::c_char,
        default_val: i64,
        retval: *mut i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_uri_get_bool(
        uri_params: *mut aeron_uri_params_t,
        key: *const ::std::os::raw::c_char,
        retval: *mut bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_uri_get_ats(
        uri_params: *mut aeron_uri_params_t,
        uri_ats_status: *mut aeron_uri_ats_status_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_uri_get_timeout(
        uri_params: *mut aeron_uri_params_t,
        param_name: *const ::std::os::raw::c_char,
        timeout_ns: *mut u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_uri_sprint(
        uri: *mut aeron_uri_t,
        buffer: *mut ::std::os::raw::c_char,
        buffer_len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_uri_get_socket_buf_lengths(
        uri_params: *mut aeron_uri_params_t,
        socket_sndbuf_length: *mut usize,
        socket_rcvbuf_length: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_uri_get_receiver_window_length(
        uri_params: *mut aeron_uri_params_t,
        receiver_window_length: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_uri_parse_tag(tag_str: *const ::std::os::raw::c_char) -> i64;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum aeron_driver_managed_resource_event_enum {
    AERON_DRIVER_MANAGED_RESOURCE_EVENT_INCREF = 0,
    AERON_DRIVER_MANAGED_RESOURCE_EVENT_DECREF = 1,
    AERON_DRIVER_MANAGED_RESOURCE_EVENT_REVOKE = 2,
}
pub use self::aeron_driver_managed_resource_event_enum as aeron_driver_managed_resource_event_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_driver_managed_resource_stct {
    pub registration_id: i64,
    pub time_of_last_state_change_ns: i64,
    pub clientd: *mut ::std::os::raw::c_void,
    pub handle_event: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: aeron_driver_managed_resource_event_t,
            arg2: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_driver_managed_resource_stct"]
        [::std::mem::size_of::<aeron_driver_managed_resource_stct>() - 32usize];
    ["Alignment of aeron_driver_managed_resource_stct"]
        [::std::mem::align_of::<aeron_driver_managed_resource_stct>() - 8usize];
    ["Offset of field: aeron_driver_managed_resource_stct::registration_id"]
        [::std::mem::offset_of!(aeron_driver_managed_resource_stct, registration_id) - 0usize];
    ["Offset of field: aeron_driver_managed_resource_stct::time_of_last_state_change_ns"][::std::mem::offset_of!(
        aeron_driver_managed_resource_stct,
        time_of_last_state_change_ns
    )
        - 8usize];
    ["Offset of field: aeron_driver_managed_resource_stct::clientd"]
        [::std::mem::offset_of!(aeron_driver_managed_resource_stct, clientd) - 16usize];
    ["Offset of field: aeron_driver_managed_resource_stct::handle_event"]
        [::std::mem::offset_of!(aeron_driver_managed_resource_stct, handle_event) - 24usize];
};
impl Default for aeron_driver_managed_resource_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_driver_managed_resource_t = aeron_driver_managed_resource_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_position_stct {
    pub counter_id: i32,
    pub value_addr: *mut i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_position_stct"][::std::mem::size_of::<aeron_position_stct>() - 16usize];
    ["Alignment of aeron_position_stct"][::std::mem::align_of::<aeron_position_stct>() - 8usize];
    ["Offset of field: aeron_position_stct::counter_id"]
        [::std::mem::offset_of!(aeron_position_stct, counter_id) - 0usize];
    ["Offset of field: aeron_position_stct::value_addr"]
        [::std::mem::offset_of!(aeron_position_stct, value_addr) - 8usize];
};
impl Default for aeron_position_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_position_t = aeron_position_stct;
pub type aeron_atomic_counter_t = aeron_position_stct;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum aeron_subscription_tether_state_enum {
    AERON_SUBSCRIPTION_TETHER_ACTIVE = 0,
    AERON_SUBSCRIPTION_TETHER_LINGER = 1,
    AERON_SUBSCRIPTION_TETHER_RESTING = 2,
}
pub use self::aeron_subscription_tether_state_enum as aeron_subscription_tether_state_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_tetherable_position_stct {
    pub is_tether: bool,
    pub state: aeron_subscription_tether_state_t,
    pub counter_id: i32,
    pub value_addr: *mut i64,
    pub subscription_registration_id: i64,
    pub time_of_last_update_ns: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_tetherable_position_stct"]
        [::std::mem::size_of::<aeron_tetherable_position_stct>() - 40usize];
    ["Alignment of aeron_tetherable_position_stct"]
        [::std::mem::align_of::<aeron_tetherable_position_stct>() - 8usize];
    ["Offset of field: aeron_tetherable_position_stct::is_tether"]
        [::std::mem::offset_of!(aeron_tetherable_position_stct, is_tether) - 0usize];
    ["Offset of field: aeron_tetherable_position_stct::state"]
        [::std::mem::offset_of!(aeron_tetherable_position_stct, state) - 4usize];
    ["Offset of field: aeron_tetherable_position_stct::counter_id"]
        [::std::mem::offset_of!(aeron_tetherable_position_stct, counter_id) - 8usize];
    ["Offset of field: aeron_tetherable_position_stct::value_addr"]
        [::std::mem::offset_of!(aeron_tetherable_position_stct, value_addr) - 16usize];
    ["Offset of field: aeron_tetherable_position_stct::subscription_registration_id"][::std::mem::offset_of!(
        aeron_tetherable_position_stct,
        subscription_registration_id
    ) - 24usize];
    ["Offset of field: aeron_tetherable_position_stct::time_of_last_update_ns"]
        [::std::mem::offset_of!(aeron_tetherable_position_stct, time_of_last_update_ns) - 32usize];
};
impl Default for aeron_tetherable_position_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_tetherable_position_t = aeron_tetherable_position_stct;
pub type aeron_untethered_subscription_state_change_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        tetherable_position: *mut aeron_tetherable_position_t,
        now_ns: i64,
        new_state: aeron_subscription_tether_state_t,
        stream_id: i32,
        session_id: i32,
    ),
>;
unsafe extern "C" {
    pub fn aeron_untethered_subscription_state_change(
        tetherable_position: *mut aeron_tetherable_position_t,
        now_ns: i64,
        new_state: aeron_subscription_tether_state_t,
        stream_id: i32,
        session_id: i32,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_subscribable_stct {
    pub correlation_id: i64,
    pub length: usize,
    pub capacity: usize,
    pub array: *mut aeron_tetherable_position_t,
    pub resting_count: usize,
    pub add_position_hook_func: ::std::option::Option<
        unsafe extern "C" fn(clientd: *mut ::std::os::raw::c_void, value_addr: *mut i64),
    >,
    pub remove_position_hook_func: ::std::option::Option<
        unsafe extern "C" fn(clientd: *mut ::std::os::raw::c_void, value_addr: *mut i64),
    >,
    pub clientd: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_subscribable_stct"][::std::mem::size_of::<aeron_subscribable_stct>() - 64usize];
    ["Alignment of aeron_subscribable_stct"]
        [::std::mem::align_of::<aeron_subscribable_stct>() - 8usize];
    ["Offset of field: aeron_subscribable_stct::correlation_id"]
        [::std::mem::offset_of!(aeron_subscribable_stct, correlation_id) - 0usize];
    ["Offset of field: aeron_subscribable_stct::length"]
        [::std::mem::offset_of!(aeron_subscribable_stct, length) - 8usize];
    ["Offset of field: aeron_subscribable_stct::capacity"]
        [::std::mem::offset_of!(aeron_subscribable_stct, capacity) - 16usize];
    ["Offset of field: aeron_subscribable_stct::array"]
        [::std::mem::offset_of!(aeron_subscribable_stct, array) - 24usize];
    ["Offset of field: aeron_subscribable_stct::resting_count"]
        [::std::mem::offset_of!(aeron_subscribable_stct, resting_count) - 32usize];
    ["Offset of field: aeron_subscribable_stct::add_position_hook_func"]
        [::std::mem::offset_of!(aeron_subscribable_stct, add_position_hook_func) - 40usize];
    ["Offset of field: aeron_subscribable_stct::remove_position_hook_func"]
        [::std::mem::offset_of!(aeron_subscribable_stct, remove_position_hook_func) - 48usize];
    ["Offset of field: aeron_subscribable_stct::clientd"]
        [::std::mem::offset_of!(aeron_subscribable_stct, clientd) - 56usize];
};
impl Default for aeron_subscribable_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_subscribable_t = aeron_subscribable_stct;
unsafe extern "C" {
    pub fn aeron_driver_subscribable_state(
        subscribable: *mut aeron_subscribable_t,
        tetherable_position: *mut aeron_tetherable_position_t,
        state: aeron_subscription_tether_state_t,
        now_ns: i64,
    );
}
unsafe extern "C" {
    pub fn aeron_driver_subscribable_working_position_count(
        subscribable: *mut aeron_subscribable_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_subscribable_has_working_positions(
        subscribable: *mut aeron_subscribable_t,
    ) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_command_base_stct {
    pub func: ::std::option::Option<
        unsafe extern "C" fn(
            clientd: *mut ::std::os::raw::c_void,
            command: *mut ::std::os::raw::c_void,
        ),
    >,
    pub item: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_command_base_stct"][::std::mem::size_of::<aeron_command_base_stct>() - 16usize];
    ["Alignment of aeron_command_base_stct"]
        [::std::mem::align_of::<aeron_command_base_stct>() - 8usize];
    ["Offset of field: aeron_command_base_stct::func"]
        [::std::mem::offset_of!(aeron_command_base_stct, func) - 0usize];
    ["Offset of field: aeron_command_base_stct::item"]
        [::std::mem::offset_of!(aeron_command_base_stct, item) - 8usize];
};
impl Default for aeron_command_base_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_command_base_t = aeron_command_base_stct;
pub type aeron_feedback_delay_generator_state_t = aeron_feedback_delay_generator_state_stct;
pub type aeron_feedback_delay_generator_func_t = ::std::option::Option<
    unsafe extern "C" fn(state: *mut aeron_feedback_delay_generator_state_t, retry: bool) -> i64,
>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct aeron_feedback_delay_generator_state_stct {
    pub static_delay: aeron_feedback_delay_generator_state_stct_static_delay_stct,
    pub optimal_delay: aeron_feedback_delay_generator_state_stct_optimal_delay_stct,
    pub delay_generator: aeron_feedback_delay_generator_func_t,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_feedback_delay_generator_state_stct_static_delay_stct {
    pub delay_ns: i64,
    pub retry_ns: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_feedback_delay_generator_state_stct_static_delay_stct"][::std::mem::size_of::<
        aeron_feedback_delay_generator_state_stct_static_delay_stct,
    >() - 16usize];
    ["Alignment of aeron_feedback_delay_generator_state_stct_static_delay_stct"]
        [::std::mem::align_of::<aeron_feedback_delay_generator_state_stct_static_delay_stct>()
            - 8usize];
    ["Offset of field: aeron_feedback_delay_generator_state_stct_static_delay_stct::delay_ns"][::std::mem::offset_of!(
        aeron_feedback_delay_generator_state_stct_static_delay_stct,
        delay_ns
    )
        - 0usize];
    ["Offset of field: aeron_feedback_delay_generator_state_stct_static_delay_stct::retry_ns"][::std::mem::offset_of!(
        aeron_feedback_delay_generator_state_stct_static_delay_stct,
        retry_ns
    )
        - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct aeron_feedback_delay_generator_state_stct_optimal_delay_stct {
    pub rand_max: f64,
    pub base_x: f64,
    pub constant_t: f64,
    pub factor_t: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_feedback_delay_generator_state_stct_optimal_delay_stct"][::std::mem::size_of::<
        aeron_feedback_delay_generator_state_stct_optimal_delay_stct,
    >() - 32usize];
    ["Alignment of aeron_feedback_delay_generator_state_stct_optimal_delay_stct"]
        [::std::mem::align_of::<aeron_feedback_delay_generator_state_stct_optimal_delay_stct>()
            - 8usize];
    ["Offset of field: aeron_feedback_delay_generator_state_stct_optimal_delay_stct::rand_max"][::std::mem::offset_of!(
        aeron_feedback_delay_generator_state_stct_optimal_delay_stct,
        rand_max
    )
        - 0usize];
    ["Offset of field: aeron_feedback_delay_generator_state_stct_optimal_delay_stct::base_x"][::std::mem::offset_of!(
        aeron_feedback_delay_generator_state_stct_optimal_delay_stct,
        base_x
    )
        - 8usize];
    ["Offset of field: aeron_feedback_delay_generator_state_stct_optimal_delay_stct::constant_t"][::std::mem::offset_of!(
        aeron_feedback_delay_generator_state_stct_optimal_delay_stct,
        constant_t
    )
        - 16usize];
    ["Offset of field: aeron_feedback_delay_generator_state_stct_optimal_delay_stct::factor_t"][::std::mem::offset_of!(
        aeron_feedback_delay_generator_state_stct_optimal_delay_stct,
        factor_t
    )
        - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_feedback_delay_generator_state_stct"]
        [::std::mem::size_of::<aeron_feedback_delay_generator_state_stct>() - 56usize];
    ["Alignment of aeron_feedback_delay_generator_state_stct"]
        [::std::mem::align_of::<aeron_feedback_delay_generator_state_stct>() - 8usize];
    ["Offset of field: aeron_feedback_delay_generator_state_stct::static_delay"]
        [::std::mem::offset_of!(aeron_feedback_delay_generator_state_stct, static_delay) - 0usize];
    ["Offset of field: aeron_feedback_delay_generator_state_stct::optimal_delay"][::std::mem::offset_of!(
        aeron_feedback_delay_generator_state_stct,
        optimal_delay
    ) - 16usize];
    ["Offset of field: aeron_feedback_delay_generator_state_stct::delay_generator"][::std::mem::offset_of!(
        aeron_feedback_delay_generator_state_stct,
        delay_generator
    ) - 48usize];
};
unsafe extern "C" {
    pub fn aeron_driver_subscribable_remove_position(
        subscribable: *mut aeron_subscribable_t,
        counter_id: i32,
    );
}
pub type aeron_on_remove_publication_cleanup_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        session_id: i32,
        stream_id: i32,
        channel_length: usize,
        channel: *const ::std::os::raw::c_char,
    ),
>;
pub type aeron_on_remove_subscription_cleanup_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        id: i64,
        stream_id: i32,
        channel_length: usize,
        channel: *const ::std::os::raw::c_char,
    ),
>;
pub type aeron_on_remove_image_cleanup_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        id: i64,
        session_id: i32,
        stream_id: i32,
        channel_length: usize,
        channel: *const ::std::os::raw::c_char,
    ),
>;
pub type aeron_on_endpoint_change_func_t =
    ::std::option::Option<unsafe extern "C" fn(channel: *const ::std::os::raw::c_void)>;
pub type aeron_driver_context_t = aeron_driver_context_stct;
pub type aeron_driver_t = aeron_driver_stct;
unsafe extern "C" {
    pub fn aeron_driver_context_set_dir(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_dir(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_dir_warn_if_exists(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_dir_warn_if_exists(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum aeron_threading_mode_enum {
    AERON_THREADING_MODE_DEDICATED = 0,
    AERON_THREADING_MODE_SHARED_NETWORK = 1,
    AERON_THREADING_MODE_SHARED = 2,
    AERON_THREADING_MODE_INVOKER = 3,
}
pub use self::aeron_threading_mode_enum as aeron_threading_mode_t;
unsafe extern "C" {
    pub fn aeron_driver_context_set_threading_mode(
        context: *mut aeron_driver_context_t,
        mode: aeron_threading_mode_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_threading_mode(
        context: *mut aeron_driver_context_t,
    ) -> aeron_threading_mode_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_dir_delete_on_start(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_dir_delete_on_start(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_dir_delete_on_shutdown(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_dir_delete_on_shutdown(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_to_conductor_buffer_length(
        context: *mut aeron_driver_context_t,
        length: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_to_conductor_buffer_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_to_clients_buffer_length(
        context: *mut aeron_driver_context_t,
        length: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_to_clients_buffer_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_counters_buffer_length(
        context: *mut aeron_driver_context_t,
        length: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_counters_buffer_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_error_buffer_length(
        context: *mut aeron_driver_context_t,
        length: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_error_buffer_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_client_liveness_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_client_liveness_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_term_buffer_length(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_term_buffer_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_ipc_term_buffer_length(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_ipc_term_buffer_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_term_buffer_sparse_file(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_term_buffer_sparse_file(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_perform_storage_checks(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_perform_storage_checks(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_low_file_store_warning_threshold(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_low_file_store_warning_threshold(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_spies_simulate_connection(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_spies_simulate_connection(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_file_page_size(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_file_page_size(context: *mut aeron_driver_context_t) -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_mtu_length(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_mtu_length(context: *mut aeron_driver_context_t) -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_ipc_mtu_length(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_ipc_mtu_length(context: *mut aeron_driver_context_t) -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_ipc_publication_term_window_length(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_ipc_publication_term_window_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_publication_term_window_length(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_publication_term_window_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_publication_linger_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_publication_linger_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_socket_so_rcvbuf(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_socket_so_rcvbuf(context: *mut aeron_driver_context_t)
    -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_socket_so_sndbuf(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_socket_so_sndbuf(context: *mut aeron_driver_context_t)
    -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_socket_multicast_ttl(
        context: *mut aeron_driver_context_t,
        value: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_socket_multicast_ttl(
        context: *mut aeron_driver_context_t,
    ) -> u8;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_send_to_status_poll_ratio(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_send_to_status_poll_ratio(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_rcv_status_message_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_rcv_status_message_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
pub type aeron_flow_control_strategy_t = aeron_flow_control_strategy_stct;
pub type aeron_counters_manager_t = aeron_counters_manager_stct;
pub type aeron_udp_channel_t = aeron_udp_channel_stct;
pub type aeron_flow_control_strategy_supplier_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        strategy: *mut *mut aeron_flow_control_strategy_t,
        context: *mut aeron_driver_context_t,
        counters_manager: *mut aeron_counters_manager_t,
        channel: *const aeron_udp_channel_t,
        stream_id: i32,
        session_id: i32,
        registration_id: i64,
        initial_term_id: i32,
        term_length: usize,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    #[doc = " Return a flow control strategy supplier function pointer associated with the given name. This only will find\n strategies built into the driver and will not try to dynamically load nor find any in the current executable.\n\n @param name of the strategy\n @return function pointer to supplier associated with the name"]
    pub fn aeron_flow_control_strategy_supplier_by_name(
        name: *const ::std::os::raw::c_char,
    ) -> aeron_flow_control_strategy_supplier_func_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_multicast_flowcontrol_supplier(
        context: *mut aeron_driver_context_t,
        value: aeron_flow_control_strategy_supplier_func_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_multicast_flowcontrol_supplier(
        context: *mut aeron_driver_context_t,
    ) -> aeron_flow_control_strategy_supplier_func_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_unicast_flowcontrol_supplier(
        context: *mut aeron_driver_context_t,
        value: aeron_flow_control_strategy_supplier_func_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_unicast_flowcontrol_supplier(
        context: *mut aeron_driver_context_t,
    ) -> aeron_flow_control_strategy_supplier_func_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_image_liveness_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_image_liveness_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_rcv_initial_window_length(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_rcv_initial_window_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
pub type aeron_congestion_control_strategy_t = aeron_congestion_control_strategy_stct;
pub type aeron_congestion_control_strategy_supplier_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        strategy: *mut *mut aeron_congestion_control_strategy_t,
        channel: *mut aeron_udp_channel_t,
        stream_id: i32,
        session_id: i32,
        registration_id: i64,
        term_length: i32,
        sender_mtu_length: i32,
        control_address: *mut sockaddr_storage,
        src_address: *mut sockaddr_storage,
        context: *mut aeron_driver_context_t,
        counters_manager: *mut aeron_counters_manager_t,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn aeron_driver_context_set_congestioncontrol_supplier(
        context: *mut aeron_driver_context_t,
        value: aeron_congestion_control_strategy_supplier_func_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_congestioncontrol_supplier(
        context: *mut aeron_driver_context_t,
    ) -> aeron_congestion_control_strategy_supplier_func_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_loss_report_buffer_length(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_loss_report_buffer_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_publication_unblock_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_publication_unblock_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_publication_connection_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_publication_connection_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_timer_interval_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_timer_interval_ns(context: *mut aeron_driver_context_t) -> u64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_sender_idle_strategy(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_sender_idle_strategy(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_conductor_idle_strategy(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_conductor_idle_strategy(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_receiver_idle_strategy(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_receiver_idle_strategy(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_sharednetwork_idle_strategy(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_sharednetwork_idle_strategy(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_shared_idle_strategy(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_shared_idle_strategy(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_sender_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_sender_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_conductor_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_conductor_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_receiver_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_receiver_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_sharednetwork_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_sharednetwork_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_shared_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_shared_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_agent_on_start_function(
        context: *mut aeron_driver_context_t,
        value: aeron_agent_on_start_func_t,
        state: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_agent_on_start_function(
        context: *mut aeron_driver_context_t,
    ) -> aeron_agent_on_start_func_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_agent_on_start_state(
        context: *mut aeron_driver_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_counters_free_to_reuse_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_counters_free_to_reuse_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_flow_control_receiver_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_flow_control_receiver_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_flow_control_group_tag(
        context: *mut aeron_driver_context_t,
        value: i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_flow_control_group_tag(
        context: *mut aeron_driver_context_t,
    ) -> i64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_flow_control_group_min_size(
        context: *mut aeron_driver_context_t,
        value: i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_flow_control_group_min_size(
        context: *mut aeron_driver_context_t,
    ) -> i32;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_receiver_group_tag(
        context: *mut aeron_driver_context_t,
        is_present: bool,
        value: i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_receiver_group_tag_is_present(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_receiver_group_tag_value(
        context: *mut aeron_driver_context_t,
    ) -> i64;
}
pub type aeron_driver_termination_validator_func_t = ::std::option::Option<
    unsafe extern "C" fn(state: *mut ::std::os::raw::c_void, buffer: *mut u8, length: i32) -> bool,
>;
unsafe extern "C" {
    pub fn aeron_driver_context_set_driver_termination_validator(
        context: *mut aeron_driver_context_t,
        value: aeron_driver_termination_validator_func_t,
        state: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_driver_termination_validator(
        context: *mut aeron_driver_context_t,
    ) -> aeron_driver_termination_validator_func_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_driver_termination_validator_state(
        context: *mut aeron_driver_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
pub type aeron_driver_termination_hook_func_t =
    ::std::option::Option<unsafe extern "C" fn(clientd: *mut ::std::os::raw::c_void)>;
unsafe extern "C" {
    pub fn aeron_driver_context_set_driver_termination_hook(
        context: *mut aeron_driver_context_t,
        value: aeron_driver_termination_hook_func_t,
        state: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_driver_termination_hook(
        context: *mut aeron_driver_context_t,
    ) -> aeron_driver_termination_hook_func_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_driver_termination_hook_state(
        context: *mut aeron_driver_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_print_configuration(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_print_configuration(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_reliable_stream(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_reliable_stream(context: *mut aeron_driver_context_t) -> bool;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_tether_subscriptions(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_tether_subscriptions(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_untethered_window_limit_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_untethered_window_limit_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_untethered_linger_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_untethered_linger_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> i64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_untethered_resting_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_untethered_resting_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_driver_timeout_ms(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_driver_timeout_ms(context: *mut aeron_driver_context_t) -> u64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_nak_multicast_group_size(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_nak_multicast_group_size(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_nak_multicast_max_backoff_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_nak_multicast_max_backoff_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_nak_unicast_delay_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_nak_unicast_delay_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_nak_unicast_retry_delay_ratio(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_nak_unicast_retry_delay_ratio(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_max_resend(
        context: *mut aeron_driver_context_t,
        value: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_max_resend(context: *mut aeron_driver_context_t) -> u32;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_retransmit_unicast_delay_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_retransmit_unicast_delay_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_retransmit_unicast_linger_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_retransmit_unicast_linger_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum aeron_inferable_boolean_enum {
    AERON_FORCE_FALSE = 0,
    AERON_FORCE_TRUE = 1,
    AERON_INFER = 2,
}
pub use self::aeron_inferable_boolean_enum as aeron_inferable_boolean_t;
unsafe extern "C" {
    pub fn aeron_driver_context_set_receiver_group_consideration(
        context: *mut aeron_driver_context_t,
        value: aeron_inferable_boolean_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_receiver_group_consideration(
        context: *mut aeron_driver_context_t,
    ) -> aeron_inferable_boolean_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_rejoin_stream(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_rejoin_stream(context: *mut aeron_driver_context_t) -> bool;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_connect_enabled(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_connect_enabled(
        context: *mut aeron_driver_context_t,
    ) -> ::std::os::raw::c_int;
}
pub type aeron_udp_channel_transport_bindings_t = aeron_udp_channel_transport_bindings_stct;
unsafe extern "C" {
    pub fn aeron_driver_context_set_udp_channel_transport_bindings(
        context: *mut aeron_driver_context_t,
        value: *mut aeron_udp_channel_transport_bindings_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_udp_channel_transport_bindings(
        context: *mut aeron_driver_context_t,
    ) -> *mut aeron_udp_channel_transport_bindings_t;
}
pub type aeron_udp_channel_interceptor_bindings_t = aeron_udp_channel_interceptor_bindings_stct;
unsafe extern "C" {
    pub fn aeron_driver_context_set_udp_channel_outgoing_interceptors(
        context: *mut aeron_driver_context_t,
        value: *mut aeron_udp_channel_interceptor_bindings_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_udp_channel_outgoing_interceptors(
        context: *mut aeron_driver_context_t,
    ) -> *mut aeron_udp_channel_interceptor_bindings_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_udp_channel_incoming_interceptors(
        context: *mut aeron_driver_context_t,
        value: *mut aeron_udp_channel_interceptor_bindings_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_udp_channel_incoming_interceptors(
        context: *mut aeron_driver_context_t,
    ) -> *mut aeron_udp_channel_interceptor_bindings_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_publication_reserved_session_id_low(
        context: *mut aeron_driver_context_t,
        value: i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_publication_reserved_session_id_low(
        context: *mut aeron_driver_context_t,
    ) -> i32;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_publication_reserved_session_id_high(
        context: *mut aeron_driver_context_t,
        value: i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_publication_reserved_session_id_high(
        context: *mut aeron_driver_context_t,
    ) -> i32;
}
pub type aeron_name_resolver_t = aeron_name_resolver_stct;
pub type aeron_name_resolver_supplier_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        resolver: *mut aeron_name_resolver_t,
        args: *const ::std::os::raw::c_char,
        context: *mut aeron_driver_context_t,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn aeron_driver_context_set_resolver_name(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_resolver_name(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_resolver_interface(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_resolver_interface(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_resolver_bootstrap_neighbor(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_resolver_bootstrap_neighbor(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_name_resolver_supplier(
        context: *mut aeron_driver_context_t,
        value: aeron_name_resolver_supplier_func_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_name_resolver_supplier(
        context: *mut aeron_driver_context_t,
    ) -> aeron_name_resolver_supplier_func_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_name_resolver_init_args(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_name_resolver_init_args(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_re_resolution_check_interval_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_re_resolution_check_interval_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
pub type aeron_duty_cycle_tracker_t = aeron_duty_cycle_tracker_stct;
unsafe extern "C" {
    pub fn aeron_driver_context_set_conductor_duty_cycle_tracker(
        context: *mut aeron_driver_context_t,
        value: *mut aeron_duty_cycle_tracker_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_conductor_duty_cycle_tracker(
        context: *mut aeron_driver_context_t,
    ) -> *mut aeron_duty_cycle_tracker_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_sender_duty_cycle_tracker(
        context: *mut aeron_driver_context_t,
        value: *mut aeron_duty_cycle_tracker_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_sender_duty_cycle_tracker(
        context: *mut aeron_driver_context_t,
    ) -> *mut aeron_duty_cycle_tracker_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_receiver_duty_cycle_tracker(
        context: *mut aeron_driver_context_t,
        value: *mut aeron_duty_cycle_tracker_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_receiver_duty_cycle_tracker(
        context: *mut aeron_driver_context_t,
    ) -> *mut aeron_duty_cycle_tracker_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_name_resolver_time_tracker(
        context: *mut aeron_driver_context_t,
        value: *mut aeron_duty_cycle_tracker_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_name_resolver_time_tracker(
        context: *mut aeron_driver_context_t,
    ) -> *mut aeron_duty_cycle_tracker_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_sender_wildcard_port_range(
        context: *mut aeron_driver_context_t,
        low_port: u16,
        high_port: u16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_sender_wildcard_port_range(
        context: *mut aeron_driver_context_t,
        low_port: *mut u16,
        high_port: *mut u16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_receiver_wildcard_port_range(
        context: *mut aeron_driver_context_t,
        low_port: u16,
        high_port: u16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_receiver_wildcard_port_range(
        context: *mut aeron_driver_context_t,
        low_port: *mut u16,
        high_port: *mut u16,
    ) -> ::std::os::raw::c_int;
}
pub type aeron_port_manager_t = aeron_port_manager_stct;
unsafe extern "C" {
    pub fn aeron_driver_context_set_sender_port_manager(
        context: *mut aeron_driver_context_t,
        value: *mut aeron_port_manager_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_sender_port_manager(
        context: *mut aeron_driver_context_t,
    ) -> *mut aeron_port_manager_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_receiver_port_manager(
        context: *mut aeron_driver_context_t,
        value: *mut aeron_port_manager_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_receiver_port_manager(
        context: *mut aeron_driver_context_t,
    ) -> *mut aeron_port_manager_t;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_conductor_cycle_threshold_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> i64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_conductor_cycle_threshold_ns(
        context: *mut aeron_driver_context_t,
    ) -> i64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_sender_cycle_threshold_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> i64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_sender_cycle_threshold_ns(
        context: *mut aeron_driver_context_t,
    ) -> i64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_receiver_cycle_threshold_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> i64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_receiver_cycle_threshold_ns(
        context: *mut aeron_driver_context_t,
    ) -> i64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_name_resolver_threshold_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> i64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_name_resolver_threshold_ns(
        context: *mut aeron_driver_context_t,
    ) -> i64;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_receiver_io_vector_capacity(
        context: *mut aeron_driver_context_t,
        value: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_receiver_io_vector_capacity(
        context: *mut aeron_driver_context_t,
    ) -> u32;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_sender_io_vector_capacity(
        context: *mut aeron_driver_context_t,
        value: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_sender_io_vector_capacity(
        context: *mut aeron_driver_context_t,
    ) -> u32;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_network_publication_max_messages_per_send(
        context: *mut aeron_driver_context_t,
        value: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_network_publication_max_messages_per_send(
        context: *mut aeron_driver_context_t,
    ) -> u32;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_resource_free_limit(
        context: *mut aeron_driver_context_t,
        value: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_resource_free_limit(
        context: *mut aeron_driver_context_t,
    ) -> u32;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_async_executor_threads(
        context: *mut aeron_driver_context_t,
        value: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_async_executor_threads(
        context: *mut aeron_driver_context_t,
    ) -> u32;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_conductor_cpu_affinity(
        context: *mut aeron_driver_context_t,
        value: i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_conductor_cpu_affinity(
        context: *mut aeron_driver_context_t,
    ) -> i32;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_receiver_cpu_affinity(
        context: *mut aeron_driver_context_t,
        value: i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_receiver_cpu_affinity(
        context: *mut aeron_driver_context_t,
    ) -> i32;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_sender_cpu_affinity(
        context: *mut aeron_driver_context_t,
        value: i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_sender_cpu_affinity(
        context: *mut aeron_driver_context_t,
    ) -> i32;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_enable_experimental_features(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_enable_experimental_features(
        context: *mut aeron_driver_context_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_set_stream_session_limit(
        context: *mut aeron_driver_context_t,
        value: i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_context_get_stream_session_limit(
        context: *mut aeron_driver_context_t,
    ) -> i32;
}
unsafe extern "C" {
    #[doc = " Create a aeron_driver_context_t struct and initialize with default values.\n\n @param context to create and initialize\n @return 0 for success and -1 for error."]
    pub fn aeron_driver_context_init(
        context: *mut *mut aeron_driver_context_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Close and delete aeron_driver_context_t struct.\n\n @param context to close and delete\n @return 0 for success and -1 for error."]
    pub fn aeron_driver_context_close(
        context: *mut aeron_driver_context_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Create a aeron_driver_t struct and initialize from the aeron_driver_context_t struct.\n\n The given aeron_driver_context_t struct will be used exclusively by the driver. Do not reuse between drivers.\n\n @param driver  to create and initialize.\n @param context to use for initialization.\n @return 0 for success and -1 for error."]
    pub fn aeron_driver_init(
        driver: *mut *mut aeron_driver_t,
        context: *mut aeron_driver_context_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Start an aeron_driver_t given the threading mode. This may spawn threads for the Sender, Receiver, and Conductor\n depending on threading mode used.\n\n @param driver to start.\n @param manual_main_loop to be called by the caller for the Conductor do_work cycle.\n @return 0 for success and -1 for error."]
    pub fn aeron_driver_start(
        driver: *mut aeron_driver_t,
        manual_main_loop: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Call the Conductor (or Shared) main do_work duty cycle once.\n\n Driver must have been created with manual_main_loop set to true.\n\n @param driver to call do_work duty cycle on.\n @return 0 for success and -1 for error."]
    pub fn aeron_driver_main_do_work(driver: *mut aeron_driver_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Call the Conductor (or Shared) Idle Strategy.\n\n @param driver to idle.\n @param work_count to pass to idle strategy."]
    pub fn aeron_driver_main_idle_strategy(
        driver: *mut aeron_driver_t,
        work_count: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " Close and delete aeron_driver_t struct.\n\n @param driver to close and delete\n @return 0 for success and -1 for error."]
    pub fn aeron_driver_close(driver: *mut aeron_driver_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Delete the given aeron directory.\n\n @param dirname to delete.\n @return 0 for success and -1 for error."]
    pub fn aeron_delete_directory(dirname: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Affinity setting function that complies with the aeron_agent_on_start_func_t structure that can\n be used as an agent start function.  The state should be the aeron_driver_context_t* and the function\n will match the values \"conductor\", \"sender\", \"receiver\" and use the respective configuration options from\n the aeron_driver_context_t.\n\n @param state client information passed to function, should be the aeron_driver_context_t*.\n @param role_name name of the role specified on the agent."]
    pub fn aeron_set_thread_affinity_on_start(
        state: *mut ::std::os::raw::c_void,
        role_name: *const ::std::os::raw::c_char,
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_driver_uri_publication_params_stct {
    pub has_position: bool,
    pub is_sparse: bool,
    pub signal_eos: bool,
    pub spies_simulate_connection: bool,
    pub has_mtu_length: bool,
    pub mtu_length: usize,
    pub has_term_length: bool,
    pub term_length: usize,
    pub term_offset: usize,
    pub initial_term_id: i32,
    pub term_id: i32,
    pub linger_timeout_ns: u64,
    pub untethered_window_limit_timeout_ns: u64,
    pub untethered_linger_timeout_ns: i64,
    pub untethered_resting_timeout_ns: u64,
    pub has_session_id: bool,
    pub session_id: i32,
    pub entity_tag: i64,
    pub response_correlation_id: i64,
    pub has_max_resend: bool,
    pub max_resend: u32,
    pub has_publication_window_length: bool,
    pub publication_window_length: i32,
    pub is_response: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_driver_uri_publication_params_stct"]
        [::std::mem::size_of::<aeron_driver_uri_publication_params_stct>() - 128usize];
    ["Alignment of aeron_driver_uri_publication_params_stct"]
        [::std::mem::align_of::<aeron_driver_uri_publication_params_stct>() - 8usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::has_position"]
        [::std::mem::offset_of!(aeron_driver_uri_publication_params_stct, has_position) - 0usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::is_sparse"]
        [::std::mem::offset_of!(aeron_driver_uri_publication_params_stct, is_sparse) - 1usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::signal_eos"]
        [::std::mem::offset_of!(aeron_driver_uri_publication_params_stct, signal_eos) - 2usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::spies_simulate_connection"][::std::mem::offset_of!(
        aeron_driver_uri_publication_params_stct,
        spies_simulate_connection
    )
        - 3usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::has_mtu_length"]
        [::std::mem::offset_of!(aeron_driver_uri_publication_params_stct, has_mtu_length) - 4usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::mtu_length"]
        [::std::mem::offset_of!(aeron_driver_uri_publication_params_stct, mtu_length) - 8usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::has_term_length"][::std::mem::offset_of!(
        aeron_driver_uri_publication_params_stct,
        has_term_length
    ) - 16usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::term_length"]
        [::std::mem::offset_of!(aeron_driver_uri_publication_params_stct, term_length) - 24usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::term_offset"]
        [::std::mem::offset_of!(aeron_driver_uri_publication_params_stct, term_offset) - 32usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::initial_term_id"][::std::mem::offset_of!(
        aeron_driver_uri_publication_params_stct,
        initial_term_id
    ) - 40usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::term_id"]
        [::std::mem::offset_of!(aeron_driver_uri_publication_params_stct, term_id) - 44usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::linger_timeout_ns"][::std::mem::offset_of!(
        aeron_driver_uri_publication_params_stct,
        linger_timeout_ns
    ) - 48usize];
    [
        "Offset of field: aeron_driver_uri_publication_params_stct::untethered_window_limit_timeout_ns",
    ][::std::mem::offset_of!(
        aeron_driver_uri_publication_params_stct,
        untethered_window_limit_timeout_ns
    ) - 56usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::untethered_linger_timeout_ns"][::std::mem::offset_of!(
        aeron_driver_uri_publication_params_stct,
        untethered_linger_timeout_ns
    )
        - 64usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::untethered_resting_timeout_ns"][::std::mem::offset_of!(
        aeron_driver_uri_publication_params_stct,
        untethered_resting_timeout_ns
    )
        - 72usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::has_session_id"][::std::mem::offset_of!(
        aeron_driver_uri_publication_params_stct,
        has_session_id
    ) - 80usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::session_id"]
        [::std::mem::offset_of!(aeron_driver_uri_publication_params_stct, session_id) - 84usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::entity_tag"]
        [::std::mem::offset_of!(aeron_driver_uri_publication_params_stct, entity_tag) - 88usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::response_correlation_id"][::std::mem::offset_of!(
        aeron_driver_uri_publication_params_stct,
        response_correlation_id
    )
        - 96usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::has_max_resend"][::std::mem::offset_of!(
        aeron_driver_uri_publication_params_stct,
        has_max_resend
    ) - 104usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::max_resend"]
        [::std::mem::offset_of!(aeron_driver_uri_publication_params_stct, max_resend) - 108usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::has_publication_window_length"][::std::mem::offset_of!(
        aeron_driver_uri_publication_params_stct,
        has_publication_window_length
    )
        - 112usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::publication_window_length"][::std::mem::offset_of!(
        aeron_driver_uri_publication_params_stct,
        publication_window_length
    )
        - 116usize];
    ["Offset of field: aeron_driver_uri_publication_params_stct::is_response"]
        [::std::mem::offset_of!(aeron_driver_uri_publication_params_stct, is_response) - 120usize];
};
pub type aeron_driver_uri_publication_params_t = aeron_driver_uri_publication_params_stct;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_driver_uri_subscription_params_stct {
    pub is_reliable: bool,
    pub is_sparse: bool,
    pub is_tether: bool,
    pub is_rejoin: bool,
    pub has_session_id: bool,
    pub is_response: bool,
    pub group: aeron_inferable_boolean_t,
    pub session_id: i32,
    pub initial_window_length: usize,
    pub untethered_window_limit_timeout_ns: u64,
    pub untethered_linger_timeout_ns: i64,
    pub untethered_resting_timeout_ns: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_driver_uri_subscription_params_stct"]
        [::std::mem::size_of::<aeron_driver_uri_subscription_params_stct>() - 48usize];
    ["Alignment of aeron_driver_uri_subscription_params_stct"]
        [::std::mem::align_of::<aeron_driver_uri_subscription_params_stct>() - 8usize];
    ["Offset of field: aeron_driver_uri_subscription_params_stct::is_reliable"]
        [::std::mem::offset_of!(aeron_driver_uri_subscription_params_stct, is_reliable) - 0usize];
    ["Offset of field: aeron_driver_uri_subscription_params_stct::is_sparse"]
        [::std::mem::offset_of!(aeron_driver_uri_subscription_params_stct, is_sparse) - 1usize];
    ["Offset of field: aeron_driver_uri_subscription_params_stct::is_tether"]
        [::std::mem::offset_of!(aeron_driver_uri_subscription_params_stct, is_tether) - 2usize];
    ["Offset of field: aeron_driver_uri_subscription_params_stct::is_rejoin"]
        [::std::mem::offset_of!(aeron_driver_uri_subscription_params_stct, is_rejoin) - 3usize];
    ["Offset of field: aeron_driver_uri_subscription_params_stct::has_session_id"][::std::mem::offset_of!(
        aeron_driver_uri_subscription_params_stct,
        has_session_id
    ) - 4usize];
    ["Offset of field: aeron_driver_uri_subscription_params_stct::is_response"]
        [::std::mem::offset_of!(aeron_driver_uri_subscription_params_stct, is_response) - 5usize];
    ["Offset of field: aeron_driver_uri_subscription_params_stct::group"]
        [::std::mem::offset_of!(aeron_driver_uri_subscription_params_stct, group) - 8usize];
    ["Offset of field: aeron_driver_uri_subscription_params_stct::session_id"]
        [::std::mem::offset_of!(aeron_driver_uri_subscription_params_stct, session_id) - 12usize];
    ["Offset of field: aeron_driver_uri_subscription_params_stct::initial_window_length"][::std::mem::offset_of!(
        aeron_driver_uri_subscription_params_stct,
        initial_window_length
    )
        - 16usize];
    [
        "Offset of field: aeron_driver_uri_subscription_params_stct::untethered_window_limit_timeout_ns",
    ][::std::mem::offset_of!(
        aeron_driver_uri_subscription_params_stct,
        untethered_window_limit_timeout_ns
    ) - 24usize];
    ["Offset of field: aeron_driver_uri_subscription_params_stct::untethered_linger_timeout_ns"][::std::mem::offset_of!(
        aeron_driver_uri_subscription_params_stct,
        untethered_linger_timeout_ns
    )
        - 32usize];
    ["Offset of field: aeron_driver_uri_subscription_params_stct::untethered_resting_timeout_ns"][::std::mem::offset_of!(
        aeron_driver_uri_subscription_params_stct,
        untethered_resting_timeout_ns
    )
        - 40usize];
};
impl Default for aeron_driver_uri_subscription_params_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type aeron_driver_uri_subscription_params_t = aeron_driver_uri_subscription_params_stct;
pub type aeron_driver_conductor_t = aeron_driver_conductor_stct;
unsafe extern "C" {
    pub fn aeron_diver_uri_publication_params(
        uri: *mut aeron_uri_t,
        params: *mut aeron_driver_uri_publication_params_t,
        conductor: *mut aeron_driver_conductor_t,
        is_exclusive: bool,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_uri_subscription_params(
        uri: *mut aeron_uri_t,
        params: *mut aeron_driver_uri_subscription_params_t,
        conductor: *mut aeron_driver_conductor_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_publication_params_validate_mtu_for_sndbuf(
        params: *mut aeron_driver_uri_publication_params_t,
        endpoint_socket_sndbuf: usize,
        channel_socket_sndbuf: usize,
        context_socket_sndbuf: usize,
        os_default_socket_sndbuf: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_uri_get_timestamp_offset(
        uri: *mut aeron_uri_t,
        key: *const ::std::os::raw::c_char,
        offset: *mut i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_driver_uri_get_offset_info(offset: i32) -> *const ::std::os::raw::c_char;
}
pub type in_addr_t = __uint32_t;
pub type sa_family_t = __uint8_t;
pub type socklen_t = __darwin_socklen_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iovec"][::std::mem::size_of::<iovec>() - 16usize];
    ["Alignment of iovec"][::std::mem::align_of::<iovec>() - 8usize];
    ["Offset of field: iovec::iov_base"][::std::mem::offset_of!(iovec, iov_base) - 0usize];
    ["Offset of field: iovec::iov_len"][::std::mem::offset_of!(iovec, iov_len) - 8usize];
};
impl Default for iovec {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct sockaddr {
    pub sa_len: __uint8_t,
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr"][::std::mem::size_of::<sockaddr>() - 16usize];
    ["Alignment of sockaddr"][::std::mem::align_of::<sockaddr>() - 1usize];
    ["Offset of field: sockaddr::sa_len"][::std::mem::offset_of!(sockaddr, sa_len) - 0usize];
    ["Offset of field: sockaddr::sa_family"][::std::mem::offset_of!(sockaddr, sa_family) - 1usize];
    ["Offset of field: sockaddr::sa_data"][::std::mem::offset_of!(sockaddr, sa_data) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct sockaddr_storage {
    pub ss_len: __uint8_t,
    pub ss_family: sa_family_t,
    pub __ss_pad1: [::std::os::raw::c_char; 6usize],
    pub __ss_align: __int64_t,
    pub __ss_pad2: [::std::os::raw::c_char; 112usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_storage"][::std::mem::size_of::<sockaddr_storage>() - 128usize];
    ["Alignment of sockaddr_storage"][::std::mem::align_of::<sockaddr_storage>() - 8usize];
    ["Offset of field: sockaddr_storage::ss_len"]
        [::std::mem::offset_of!(sockaddr_storage, ss_len) - 0usize];
    ["Offset of field: sockaddr_storage::ss_family"]
        [::std::mem::offset_of!(sockaddr_storage, ss_family) - 1usize];
    ["Offset of field: sockaddr_storage::__ss_pad1"]
        [::std::mem::offset_of!(sockaddr_storage, __ss_pad1) - 2usize];
    ["Offset of field: sockaddr_storage::__ss_align"]
        [::std::mem::offset_of!(sockaddr_storage, __ss_align) - 8usize];
    ["Offset of field: sockaddr_storage::__ss_pad2"]
        [::std::mem::offset_of!(sockaddr_storage, __ss_pad2) - 16usize];
};
impl Default for sockaddr_storage {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: ::std::os::raw::c_int,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: socklen_t,
    pub msg_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of msghdr"][::std::mem::size_of::<msghdr>() - 48usize];
    ["Alignment of msghdr"][::std::mem::align_of::<msghdr>() - 8usize];
    ["Offset of field: msghdr::msg_name"][::std::mem::offset_of!(msghdr, msg_name) - 0usize];
    ["Offset of field: msghdr::msg_namelen"][::std::mem::offset_of!(msghdr, msg_namelen) - 8usize];
    ["Offset of field: msghdr::msg_iov"][::std::mem::offset_of!(msghdr, msg_iov) - 16usize];
    ["Offset of field: msghdr::msg_iovlen"][::std::mem::offset_of!(msghdr, msg_iovlen) - 24usize];
    ["Offset of field: msghdr::msg_control"][::std::mem::offset_of!(msghdr, msg_control) - 32usize];
    ["Offset of field: msghdr::msg_controllen"]
        [::std::mem::offset_of!(msghdr, msg_controllen) - 40usize];
    ["Offset of field: msghdr::msg_flags"][::std::mem::offset_of!(msghdr, msg_flags) - 44usize];
};
impl Default for msghdr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_addr"][::std::mem::size_of::<in_addr>() - 4usize];
    ["Alignment of in_addr"][::std::mem::align_of::<in_addr>() - 4usize];
    ["Offset of field: in_addr::s_addr"][::std::mem::offset_of!(in_addr, s_addr) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __u6_addr: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [__uint8_t; 16usize],
    pub __u6_addr16: [__uint16_t; 8usize],
    pub __u6_addr32: [__uint32_t; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr__bindgen_ty_1"][::std::mem::size_of::<in6_addr__bindgen_ty_1>() - 16usize];
    ["Alignment of in6_addr__bindgen_ty_1"]
        [::std::mem::align_of::<in6_addr__bindgen_ty_1>() - 4usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr8"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr8) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr16"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr16) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr32"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr32) - 0usize];
};
impl Default for in6_addr__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr"][::std::mem::size_of::<in6_addr>() - 16usize];
    ["Alignment of in6_addr"][::std::mem::align_of::<in6_addr>() - 4usize];
    ["Offset of field: in6_addr::__u6_addr"][::std::mem::offset_of!(in6_addr, __u6_addr) - 0usize];
};
impl Default for in6_addr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct addrinfo {
    pub ai_flags: ::std::os::raw::c_int,
    pub ai_family: ::std::os::raw::c_int,
    pub ai_socktype: ::std::os::raw::c_int,
    pub ai_protocol: ::std::os::raw::c_int,
    pub ai_addrlen: socklen_t,
    pub ai_canonname: *mut ::std::os::raw::c_char,
    pub ai_addr: *mut sockaddr,
    pub ai_next: *mut addrinfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of addrinfo"][::std::mem::size_of::<addrinfo>() - 48usize];
    ["Alignment of addrinfo"][::std::mem::align_of::<addrinfo>() - 8usize];
    ["Offset of field: addrinfo::ai_flags"][::std::mem::offset_of!(addrinfo, ai_flags) - 0usize];
    ["Offset of field: addrinfo::ai_family"][::std::mem::offset_of!(addrinfo, ai_family) - 4usize];
    ["Offset of field: addrinfo::ai_socktype"]
        [::std::mem::offset_of!(addrinfo, ai_socktype) - 8usize];
    ["Offset of field: addrinfo::ai_protocol"]
        [::std::mem::offset_of!(addrinfo, ai_protocol) - 12usize];
    ["Offset of field: addrinfo::ai_addrlen"]
        [::std::mem::offset_of!(addrinfo, ai_addrlen) - 16usize];
    ["Offset of field: addrinfo::ai_canonname"]
        [::std::mem::offset_of!(addrinfo, ai_canonname) - 24usize];
    ["Offset of field: addrinfo::ai_addr"][::std::mem::offset_of!(addrinfo, ai_addr) - 32usize];
    ["Offset of field: addrinfo::ai_next"][::std::mem::offset_of!(addrinfo, ai_next) - 40usize];
};
impl Default for addrinfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ifaddrs {
    pub ifa_next: *mut ifaddrs,
    pub ifa_name: *mut ::std::os::raw::c_char,
    pub ifa_flags: ::std::os::raw::c_uint,
    pub ifa_addr: *mut sockaddr,
    pub ifa_netmask: *mut sockaddr,
    pub ifa_dstaddr: *mut sockaddr,
    pub ifa_data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ifaddrs"][::std::mem::size_of::<ifaddrs>() - 56usize];
    ["Alignment of ifaddrs"][::std::mem::align_of::<ifaddrs>() - 8usize];
    ["Offset of field: ifaddrs::ifa_next"][::std::mem::offset_of!(ifaddrs, ifa_next) - 0usize];
    ["Offset of field: ifaddrs::ifa_name"][::std::mem::offset_of!(ifaddrs, ifa_name) - 8usize];
    ["Offset of field: ifaddrs::ifa_flags"][::std::mem::offset_of!(ifaddrs, ifa_flags) - 16usize];
    ["Offset of field: ifaddrs::ifa_addr"][::std::mem::offset_of!(ifaddrs, ifa_addr) - 24usize];
    ["Offset of field: ifaddrs::ifa_netmask"]
        [::std::mem::offset_of!(ifaddrs, ifa_netmask) - 32usize];
    ["Offset of field: ifaddrs::ifa_dstaddr"]
        [::std::mem::offset_of!(ifaddrs, ifa_dstaddr) - 40usize];
    ["Offset of field: ifaddrs::ifa_data"][::std::mem::offset_of!(ifaddrs, ifa_data) - 48usize];
};
impl Default for ifaddrs {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct pollfd {
    pub fd: ::std::os::raw::c_int,
    pub events: ::std::os::raw::c_short,
    pub revents: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pollfd"][::std::mem::size_of::<pollfd>() - 8usize];
    ["Alignment of pollfd"][::std::mem::align_of::<pollfd>() - 4usize];
    ["Offset of field: pollfd::fd"][::std::mem::offset_of!(pollfd, fd) - 0usize];
    ["Offset of field: pollfd::events"][::std::mem::offset_of!(pollfd, events) - 4usize];
    ["Offset of field: pollfd::revents"][::std::mem::offset_of!(pollfd, revents) - 6usize];
};
pub type aeron_socket_t = ::std::os::raw::c_int;
unsafe extern "C" {
    pub fn aeron_set_socket_non_blocking(fd: aeron_socket_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_socket(
        domain: ::std::os::raw::c_int,
        type_: ::std::os::raw::c_int,
        protocol: ::std::os::raw::c_int,
    ) -> aeron_socket_t;
}
unsafe extern "C" {
    pub fn aeron_close_socket(socket: aeron_socket_t);
}
unsafe extern "C" {
    pub fn aeron_connect(
        fd: aeron_socket_t,
        address: *mut sockaddr,
        address_length: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_bind(
        fd: aeron_socket_t,
        address: *mut sockaddr,
        address_length: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_net_init() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_getsockopt(
        fd: aeron_socket_t,
        level: ::std::os::raw::c_int,
        optname: ::std::os::raw::c_int,
        optval: *mut ::std::os::raw::c_void,
        optlen: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_setsockopt(
        fd: aeron_socket_t,
        level: ::std::os::raw::c_int,
        optname: ::std::os::raw::c_int,
        optval: *const ::std::os::raw::c_void,
        optlen: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_getifaddrs(ifap: *mut *mut ifaddrs) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_freeifaddrs(ifa: *mut ifaddrs);
}
unsafe extern "C" {
    pub fn aeron_sendmsg(
        fd: aeron_socket_t,
        msghdr: *mut msghdr,
        flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn aeron_send(
        fd: aeron_socket_t,
        buf: *const ::std::os::raw::c_void,
        len: usize,
        flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn aeron_recvmsg(
        fd: aeron_socket_t,
        msghdr: *mut msghdr,
        flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn aeron_poll(
        fds: *mut pollfd,
        nfds: ::std::os::raw::c_ulong,
        timeout: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum aeron_udp_channel_transport_affinity_en {
    AERON_UDP_CHANNEL_TRANSPORT_AFFINITY_SENDER = 0,
    AERON_UDP_CHANNEL_TRANSPORT_AFFINITY_RECEIVER = 1,
    AERON_UDP_CHANNEL_TRANSPORT_AFFINITY_CONDUCTOR = 2,
}
pub use self::aeron_udp_channel_transport_affinity_en as aeron_udp_channel_transport_affinity_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mmsghdr {
    _unused: [u8; 0],
}
pub type aeron_udp_channel_transport_params_t = aeron_udp_channel_transport_params_stct;
pub type aeron_udp_channel_transport_t = aeron_udp_channel_transport_stct;
pub type aeron_network_publication_t = aeron_network_publication_stct;
pub type aeron_publication_image_t = aeron_publication_image_stct;
pub type aeron_udp_transport_poller_t = aeron_udp_transport_poller_stct;
pub type aeron_udp_channel_data_paths_t = aeron_udp_channel_data_paths_stct;
pub type aeron_data_packet_dispatcher_t = aeron_data_packet_dispatcher_stct;
pub type aeron_udp_channel_transport_init_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        transport: *mut aeron_udp_channel_transport_t,
        bind_addr: *mut sockaddr_storage,
        multicast_if_addr: *mut sockaddr_storage,
        connect_addr: *mut sockaddr_storage,
        params: *mut aeron_udp_channel_transport_params_t,
        context: *mut aeron_driver_context_t,
        affinity: aeron_udp_channel_transport_affinity_t,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_transport_reconnect_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        transport: *mut aeron_udp_channel_transport_t,
        connect_addr: *mut sockaddr_storage,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_transport_close_func_t = ::std::option::Option<
    unsafe extern "C" fn(transport: *mut aeron_udp_channel_transport_t) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_transport_recv_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        data_paths: *mut aeron_udp_channel_data_paths_t,
        transport: *mut aeron_udp_channel_transport_t,
        receiver_clientd: *mut ::std::os::raw::c_void,
        endpoint_clientd: *mut ::std::os::raw::c_void,
        destination_clientd: *mut ::std::os::raw::c_void,
        buffer: *mut u8,
        length: usize,
        addr: *mut sockaddr_storage,
        media_timestamp: *mut timespec,
    ),
>;
pub type aeron_udp_channel_transport_recvmmsg_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        transport: *mut aeron_udp_channel_transport_t,
        msgvec: *mut mmsghdr,
        vlen: usize,
        bytes_rcved: *mut i64,
        recv_func: aeron_udp_transport_recv_func_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_transport_send_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        data_paths: *mut aeron_udp_channel_data_paths_t,
        transport: *mut aeron_udp_channel_transport_t,
        address: *mut sockaddr_storage,
        iov: *mut iovec,
        iov_length: usize,
        bytes_sent: *mut i64,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_transport_get_so_rcvbuf_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        transport: *mut aeron_udp_channel_transport_t,
        so_rcvbuf: *mut usize,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_transport_bind_addr_and_port_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        transport: *mut aeron_udp_channel_transport_t,
        buffer: *mut ::std::os::raw::c_char,
        length: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_transport_poller_init_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        poller: *mut aeron_udp_transport_poller_t,
        context: *mut aeron_driver_context_t,
        affinity: aeron_udp_channel_transport_affinity_t,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_transport_poller_close_func_t = ::std::option::Option<
    unsafe extern "C" fn(poller: *mut aeron_udp_transport_poller_t) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_transport_poller_add_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        poller: *mut aeron_udp_transport_poller_t,
        transport: *mut aeron_udp_channel_transport_t,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_transport_poller_remove_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        poller: *mut aeron_udp_transport_poller_t,
        transport: *mut aeron_udp_channel_transport_t,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_transport_poller_poll_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        poller: *mut aeron_udp_transport_poller_t,
        msgvec: *mut mmsghdr,
        vlen: usize,
        bytes_rcved: *mut i64,
        recv_func: aeron_udp_transport_recv_func_t,
        recvmmsg_func: aeron_udp_channel_transport_recvmmsg_func_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_udp_channel_transport_bindings_stct {
    pub init_func: aeron_udp_channel_transport_init_func_t,
    pub reconnect_func: aeron_udp_channel_transport_reconnect_func_t,
    pub close_func: aeron_udp_channel_transport_close_func_t,
    pub recvmmsg_func: aeron_udp_channel_transport_recvmmsg_func_t,
    pub send_func: aeron_udp_channel_transport_send_func_t,
    pub get_so_rcvbuf_func: aeron_udp_channel_transport_get_so_rcvbuf_func_t,
    pub bind_addr_and_port_func: aeron_udp_channel_transport_bind_addr_and_port_func_t,
    pub poller_init_func: aeron_udp_transport_poller_init_func_t,
    pub poller_close_func: aeron_udp_transport_poller_close_func_t,
    pub poller_add_func: aeron_udp_transport_poller_add_func_t,
    pub poller_remove_func: aeron_udp_transport_poller_remove_func_t,
    pub poller_poll_func: aeron_udp_transport_poller_poll_func_t,
    pub meta_info: aeron_udp_channel_transport_bindings_stct_meta_info_fields,
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_udp_channel_transport_bindings_stct_meta_info_fields {
    pub name: *const ::std::os::raw::c_char,
    pub type_: *const ::std::os::raw::c_char,
    pub source_symbol: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_udp_channel_transport_bindings_stct_meta_info_fields"][::std::mem::size_of::<
        aeron_udp_channel_transport_bindings_stct_meta_info_fields,
    >() - 24usize];
    ["Alignment of aeron_udp_channel_transport_bindings_stct_meta_info_fields"][::std::mem::align_of::<
        aeron_udp_channel_transport_bindings_stct_meta_info_fields,
    >() - 8usize];
    ["Offset of field: aeron_udp_channel_transport_bindings_stct_meta_info_fields::name"][::std::mem::offset_of!(
        aeron_udp_channel_transport_bindings_stct_meta_info_fields,
        name
    )
        - 0usize];
    ["Offset of field: aeron_udp_channel_transport_bindings_stct_meta_info_fields::type_"][::std::mem::offset_of!(
        aeron_udp_channel_transport_bindings_stct_meta_info_fields,
        type_
    )
        - 8usize];
    ["Offset of field: aeron_udp_channel_transport_bindings_stct_meta_info_fields::source_symbol"]
        [::std::mem::offset_of!(
            aeron_udp_channel_transport_bindings_stct_meta_info_fields,
            source_symbol
        ) - 16usize];
};
impl Default for aeron_udp_channel_transport_bindings_stct_meta_info_fields {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_udp_channel_transport_bindings_stct"]
        [::std::mem::size_of::<aeron_udp_channel_transport_bindings_stct>() - 120usize];
    ["Alignment of aeron_udp_channel_transport_bindings_stct"]
        [::std::mem::align_of::<aeron_udp_channel_transport_bindings_stct>() - 8usize];
    ["Offset of field: aeron_udp_channel_transport_bindings_stct::init_func"]
        [::std::mem::offset_of!(aeron_udp_channel_transport_bindings_stct, init_func) - 0usize];
    ["Offset of field: aeron_udp_channel_transport_bindings_stct::reconnect_func"][::std::mem::offset_of!(
        aeron_udp_channel_transport_bindings_stct,
        reconnect_func
    ) - 8usize];
    ["Offset of field: aeron_udp_channel_transport_bindings_stct::close_func"]
        [::std::mem::offset_of!(aeron_udp_channel_transport_bindings_stct, close_func) - 16usize];
    ["Offset of field: aeron_udp_channel_transport_bindings_stct::recvmmsg_func"][::std::mem::offset_of!(
        aeron_udp_channel_transport_bindings_stct,
        recvmmsg_func
    ) - 24usize];
    ["Offset of field: aeron_udp_channel_transport_bindings_stct::send_func"]
        [::std::mem::offset_of!(aeron_udp_channel_transport_bindings_stct, send_func) - 32usize];
    ["Offset of field: aeron_udp_channel_transport_bindings_stct::get_so_rcvbuf_func"][::std::mem::offset_of!(
        aeron_udp_channel_transport_bindings_stct,
        get_so_rcvbuf_func
    ) - 40usize];
    ["Offset of field: aeron_udp_channel_transport_bindings_stct::bind_addr_and_port_func"][::std::mem::offset_of!(
        aeron_udp_channel_transport_bindings_stct,
        bind_addr_and_port_func
    )
        - 48usize];
    ["Offset of field: aeron_udp_channel_transport_bindings_stct::poller_init_func"][::std::mem::offset_of!(
        aeron_udp_channel_transport_bindings_stct,
        poller_init_func
    ) - 56usize];
    ["Offset of field: aeron_udp_channel_transport_bindings_stct::poller_close_func"][::std::mem::offset_of!(
        aeron_udp_channel_transport_bindings_stct,
        poller_close_func
    ) - 64usize];
    ["Offset of field: aeron_udp_channel_transport_bindings_stct::poller_add_func"][::std::mem::offset_of!(
        aeron_udp_channel_transport_bindings_stct,
        poller_add_func
    ) - 72usize];
    ["Offset of field: aeron_udp_channel_transport_bindings_stct::poller_remove_func"][::std::mem::offset_of!(
        aeron_udp_channel_transport_bindings_stct,
        poller_remove_func
    ) - 80usize];
    ["Offset of field: aeron_udp_channel_transport_bindings_stct::poller_poll_func"][::std::mem::offset_of!(
        aeron_udp_channel_transport_bindings_stct,
        poller_poll_func
    ) - 88usize];
    ["Offset of field: aeron_udp_channel_transport_bindings_stct::meta_info"]
        [::std::mem::offset_of!(aeron_udp_channel_transport_bindings_stct, meta_info) - 96usize];
};
impl Default for aeron_udp_channel_transport_bindings_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn aeron_udp_channel_transport_bindings_load_media(
        bindings_name: *const ::std::os::raw::c_char,
    ) -> *mut aeron_udp_channel_transport_bindings_t;
}
pub type aeron_udp_channel_interceptor_bindings_load_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        delegate_bindings: *mut aeron_udp_channel_interceptor_bindings_t,
    ) -> *mut aeron_udp_channel_interceptor_bindings_t,
>;
unsafe extern "C" {
    pub fn aeron_udp_channel_interceptor_bindings_load(
        existing_interceptor_bindings: *mut aeron_udp_channel_interceptor_bindings_t,
        interceptors: *const ::std::os::raw::c_char,
    ) -> *mut aeron_udp_channel_interceptor_bindings_t;
}
pub type aeron_udp_channel_outgoing_interceptor_t = aeron_udp_channel_outgoing_interceptor_stct;
pub type aeron_udp_channel_incoming_interceptor_t = aeron_udp_channel_incoming_interceptor_stct;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum aeron_udp_channel_interceptor_notification_type_en {
    AERON_UDP_CHANNEL_INTERCEPTOR_ADD_NOTIFICATION = 0,
    AERON_UDP_CHANNEL_INTERCEPTOR_REMOVE_NOTIFICATION = 1,
}
pub use self::aeron_udp_channel_interceptor_notification_type_en as aeron_udp_channel_interceptor_notification_type_t;
pub type aeron_udp_channel_interceptor_outgoing_send_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        interceptor_state: *mut ::std::os::raw::c_void,
        delegate: *mut aeron_udp_channel_outgoing_interceptor_t,
        transport: *mut aeron_udp_channel_transport_t,
        address: *mut sockaddr_storage,
        iov: *mut iovec,
        iov_length: usize,
        bytes_sent: *mut i64,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_interceptor_incoming_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        interceptor_state: *mut ::std::os::raw::c_void,
        delegate: *mut aeron_udp_channel_incoming_interceptor_t,
        transport: *mut aeron_udp_channel_transport_t,
        receiver_clientd: *mut ::std::os::raw::c_void,
        endpoint_clientd: *mut ::std::os::raw::c_void,
        destination_clientd: *mut ::std::os::raw::c_void,
        buffer: *mut u8,
        length: usize,
        addr: *mut sockaddr_storage,
        media_timestamp: *mut timespec,
    ),
>;
pub type aeron_udp_channel_interceptor_init_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        interceptor_state: *mut *mut ::std::os::raw::c_void,
        context: *mut aeron_driver_context_t,
        affinity: aeron_udp_channel_transport_affinity_t,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_interceptor_close_func_t = ::std::option::Option<
    unsafe extern "C" fn(interceptor_state: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_interceptor_transport_notification_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        interceptor_state: *mut ::std::os::raw::c_void,
        transport: *mut aeron_udp_channel_transport_t,
        udp_channel: *const aeron_udp_channel_t,
        data_packet_dispatcher: *mut aeron_data_packet_dispatcher_t,
        type_: aeron_udp_channel_interceptor_notification_type_t,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_interceptor_publication_notification_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        interceptor_state: *mut ::std::os::raw::c_void,
        transport: *mut aeron_udp_channel_transport_t,
        publication: *mut aeron_network_publication_t,
        type_: aeron_udp_channel_interceptor_notification_type_t,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_interceptor_image_notification_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        interceptor_state: *mut ::std::os::raw::c_void,
        transport: *mut aeron_udp_channel_transport_t,
        image: *mut aeron_publication_image_t,
        type_: aeron_udp_channel_interceptor_notification_type_t,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_udp_channel_interceptor_bindings_stct {
    pub outgoing_init_func: aeron_udp_channel_interceptor_init_func_t,
    pub incoming_init_func: aeron_udp_channel_interceptor_init_func_t,
    pub outgoing_send_func: aeron_udp_channel_interceptor_outgoing_send_func_t,
    pub incoming_func: aeron_udp_channel_interceptor_incoming_func_t,
    pub outgoing_close_func: aeron_udp_channel_interceptor_close_func_t,
    pub incoming_close_func: aeron_udp_channel_interceptor_close_func_t,
    pub outgoing_transport_notification_func:
        aeron_udp_channel_interceptor_transport_notification_func_t,
    pub incoming_transport_notification_func:
        aeron_udp_channel_interceptor_transport_notification_func_t,
    pub outgoing_publication_notification_func:
        aeron_udp_channel_interceptor_publication_notification_func_t,
    pub incoming_publication_notification_func:
        aeron_udp_channel_interceptor_publication_notification_func_t,
    pub outgoing_image_notification_func: aeron_udp_channel_interceptor_image_notification_func_t,
    pub incoming_image_notification_func: aeron_udp_channel_interceptor_image_notification_func_t,
    pub meta_info: aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields,
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields {
    pub name: *const ::std::os::raw::c_char,
    pub type_: *const ::std::os::raw::c_char,
    pub next_interceptor_bindings: *const aeron_udp_channel_interceptor_bindings_t,
    pub source_symbol: ::std::option::Option<unsafe extern "C" fn()>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields"]
        [::std::mem::size_of::<
            aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields,
        >() - 32usize];
    ["Alignment of aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields"]
        [::std::mem::align_of::<
            aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields,
        >() - 8usize];
    [
        "Offset of field: aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields::name",
    ][::std::mem::offset_of!(
        aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields,
        name
    ) - 0usize];
    [
        "Offset of field: aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields::type_",
    ][::std::mem::offset_of!(
        aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields,
        type_
    ) - 8usize];
    [
        "Offset of field: aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields::next_interceptor_bindings",
    ][::std::mem::offset_of!(
        aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields,
        next_interceptor_bindings
    ) - 16usize];
    [
        "Offset of field: aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields::source_symbol",
    ][::std::mem::offset_of!(
        aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields,
        source_symbol
    ) - 24usize];
};
impl Default for aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_udp_channel_interceptor_bindings_stct"]
        [::std::mem::size_of::<aeron_udp_channel_interceptor_bindings_stct>() - 128usize];
    ["Alignment of aeron_udp_channel_interceptor_bindings_stct"]
        [::std::mem::align_of::<aeron_udp_channel_interceptor_bindings_stct>() - 8usize];
    ["Offset of field: aeron_udp_channel_interceptor_bindings_stct::outgoing_init_func"][::std::mem::offset_of!(
        aeron_udp_channel_interceptor_bindings_stct,
        outgoing_init_func
    )
        - 0usize];
    ["Offset of field: aeron_udp_channel_interceptor_bindings_stct::incoming_init_func"][::std::mem::offset_of!(
        aeron_udp_channel_interceptor_bindings_stct,
        incoming_init_func
    )
        - 8usize];
    ["Offset of field: aeron_udp_channel_interceptor_bindings_stct::outgoing_send_func"][::std::mem::offset_of!(
        aeron_udp_channel_interceptor_bindings_stct,
        outgoing_send_func
    )
        - 16usize];
    ["Offset of field: aeron_udp_channel_interceptor_bindings_stct::incoming_func"][::std::mem::offset_of!(
        aeron_udp_channel_interceptor_bindings_stct,
        incoming_func
    ) - 24usize];
    ["Offset of field: aeron_udp_channel_interceptor_bindings_stct::outgoing_close_func"][::std::mem::offset_of!(
        aeron_udp_channel_interceptor_bindings_stct,
        outgoing_close_func
    )
        - 32usize];
    ["Offset of field: aeron_udp_channel_interceptor_bindings_stct::incoming_close_func"][::std::mem::offset_of!(
        aeron_udp_channel_interceptor_bindings_stct,
        incoming_close_func
    )
        - 40usize];
    [
        "Offset of field: aeron_udp_channel_interceptor_bindings_stct::outgoing_transport_notification_func",
    ][::std::mem::offset_of!(
        aeron_udp_channel_interceptor_bindings_stct,
        outgoing_transport_notification_func
    ) - 48usize];
    [
        "Offset of field: aeron_udp_channel_interceptor_bindings_stct::incoming_transport_notification_func",
    ][::std::mem::offset_of!(
        aeron_udp_channel_interceptor_bindings_stct,
        incoming_transport_notification_func
    ) - 56usize];
    [
        "Offset of field: aeron_udp_channel_interceptor_bindings_stct::outgoing_publication_notification_func",
    ][::std::mem::offset_of!(
        aeron_udp_channel_interceptor_bindings_stct,
        outgoing_publication_notification_func
    ) - 64usize];
    [
        "Offset of field: aeron_udp_channel_interceptor_bindings_stct::incoming_publication_notification_func",
    ][::std::mem::offset_of!(
        aeron_udp_channel_interceptor_bindings_stct,
        incoming_publication_notification_func
    ) - 72usize];
    [
        "Offset of field: aeron_udp_channel_interceptor_bindings_stct::outgoing_image_notification_func",
    ][::std::mem::offset_of!(
        aeron_udp_channel_interceptor_bindings_stct,
        outgoing_image_notification_func
    ) - 80usize];
    [
        "Offset of field: aeron_udp_channel_interceptor_bindings_stct::incoming_image_notification_func",
    ][::std::mem::offset_of!(
        aeron_udp_channel_interceptor_bindings_stct,
        incoming_image_notification_func
    ) - 88usize];
    ["Offset of field: aeron_udp_channel_interceptor_bindings_stct::meta_info"]
        [::std::mem::offset_of!(aeron_udp_channel_interceptor_bindings_stct, meta_info) - 96usize];
};
impl Default for aeron_udp_channel_interceptor_bindings_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_udp_channel_outgoing_interceptor_stct {
    pub interceptor_state: *mut ::std::os::raw::c_void,
    pub outgoing_send_func: aeron_udp_channel_interceptor_outgoing_send_func_t,
    pub close_func: aeron_udp_channel_interceptor_close_func_t,
    pub outgoing_transport_notification_func:
        aeron_udp_channel_interceptor_transport_notification_func_t,
    pub outgoing_publication_notification_func:
        aeron_udp_channel_interceptor_publication_notification_func_t,
    pub outgoing_image_notification_func: aeron_udp_channel_interceptor_image_notification_func_t,
    pub next_interceptor: *mut aeron_udp_channel_outgoing_interceptor_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_udp_channel_outgoing_interceptor_stct"]
        [::std::mem::size_of::<aeron_udp_channel_outgoing_interceptor_stct>() - 56usize];
    ["Alignment of aeron_udp_channel_outgoing_interceptor_stct"]
        [::std::mem::align_of::<aeron_udp_channel_outgoing_interceptor_stct>() - 8usize];
    ["Offset of field: aeron_udp_channel_outgoing_interceptor_stct::interceptor_state"][::std::mem::offset_of!(
        aeron_udp_channel_outgoing_interceptor_stct,
        interceptor_state
    ) - 0usize];
    ["Offset of field: aeron_udp_channel_outgoing_interceptor_stct::outgoing_send_func"][::std::mem::offset_of!(
        aeron_udp_channel_outgoing_interceptor_stct,
        outgoing_send_func
    )
        - 8usize];
    ["Offset of field: aeron_udp_channel_outgoing_interceptor_stct::close_func"]
        [::std::mem::offset_of!(aeron_udp_channel_outgoing_interceptor_stct, close_func) - 16usize];
    [
        "Offset of field: aeron_udp_channel_outgoing_interceptor_stct::outgoing_transport_notification_func",
    ][::std::mem::offset_of!(
        aeron_udp_channel_outgoing_interceptor_stct,
        outgoing_transport_notification_func
    ) - 24usize];
    [
        "Offset of field: aeron_udp_channel_outgoing_interceptor_stct::outgoing_publication_notification_func",
    ][::std::mem::offset_of!(
        aeron_udp_channel_outgoing_interceptor_stct,
        outgoing_publication_notification_func
    ) - 32usize];
    [
        "Offset of field: aeron_udp_channel_outgoing_interceptor_stct::outgoing_image_notification_func",
    ][::std::mem::offset_of!(
        aeron_udp_channel_outgoing_interceptor_stct,
        outgoing_image_notification_func
    ) - 40usize];
    ["Offset of field: aeron_udp_channel_outgoing_interceptor_stct::next_interceptor"][::std::mem::offset_of!(
        aeron_udp_channel_outgoing_interceptor_stct,
        next_interceptor
    ) - 48usize];
};
impl Default for aeron_udp_channel_outgoing_interceptor_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_udp_channel_incoming_interceptor_stct {
    pub interceptor_state: *mut ::std::os::raw::c_void,
    pub incoming_func: aeron_udp_channel_interceptor_incoming_func_t,
    pub close_func: aeron_udp_channel_interceptor_close_func_t,
    pub incoming_transport_notification_func:
        aeron_udp_channel_interceptor_transport_notification_func_t,
    pub incoming_publication_notification_func:
        aeron_udp_channel_interceptor_publication_notification_func_t,
    pub incoming_image_notification_func: aeron_udp_channel_interceptor_image_notification_func_t,
    pub next_interceptor: *mut aeron_udp_channel_incoming_interceptor_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_udp_channel_incoming_interceptor_stct"]
        [::std::mem::size_of::<aeron_udp_channel_incoming_interceptor_stct>() - 56usize];
    ["Alignment of aeron_udp_channel_incoming_interceptor_stct"]
        [::std::mem::align_of::<aeron_udp_channel_incoming_interceptor_stct>() - 8usize];
    ["Offset of field: aeron_udp_channel_incoming_interceptor_stct::interceptor_state"][::std::mem::offset_of!(
        aeron_udp_channel_incoming_interceptor_stct,
        interceptor_state
    ) - 0usize];
    ["Offset of field: aeron_udp_channel_incoming_interceptor_stct::incoming_func"][::std::mem::offset_of!(
        aeron_udp_channel_incoming_interceptor_stct,
        incoming_func
    ) - 8usize];
    ["Offset of field: aeron_udp_channel_incoming_interceptor_stct::close_func"]
        [::std::mem::offset_of!(aeron_udp_channel_incoming_interceptor_stct, close_func) - 16usize];
    [
        "Offset of field: aeron_udp_channel_incoming_interceptor_stct::incoming_transport_notification_func",
    ][::std::mem::offset_of!(
        aeron_udp_channel_incoming_interceptor_stct,
        incoming_transport_notification_func
    ) - 24usize];
    [
        "Offset of field: aeron_udp_channel_incoming_interceptor_stct::incoming_publication_notification_func",
    ][::std::mem::offset_of!(
        aeron_udp_channel_incoming_interceptor_stct,
        incoming_publication_notification_func
    ) - 32usize];
    [
        "Offset of field: aeron_udp_channel_incoming_interceptor_stct::incoming_image_notification_func",
    ][::std::mem::offset_of!(
        aeron_udp_channel_incoming_interceptor_stct,
        incoming_image_notification_func
    ) - 40usize];
    ["Offset of field: aeron_udp_channel_incoming_interceptor_stct::next_interceptor"][::std::mem::offset_of!(
        aeron_udp_channel_incoming_interceptor_stct,
        next_interceptor
    ) - 48usize];
};
impl Default for aeron_udp_channel_incoming_interceptor_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_udp_channel_data_paths_stct {
    pub outgoing_interceptors: *mut aeron_udp_channel_outgoing_interceptor_t,
    pub incoming_interceptors: *mut aeron_udp_channel_incoming_interceptor_t,
    pub send_func: aeron_udp_channel_transport_send_func_t,
    pub recv_func: aeron_udp_transport_recv_func_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_udp_channel_data_paths_stct"]
        [::std::mem::size_of::<aeron_udp_channel_data_paths_stct>() - 32usize];
    ["Alignment of aeron_udp_channel_data_paths_stct"]
        [::std::mem::align_of::<aeron_udp_channel_data_paths_stct>() - 8usize];
    ["Offset of field: aeron_udp_channel_data_paths_stct::outgoing_interceptors"]
        [::std::mem::offset_of!(aeron_udp_channel_data_paths_stct, outgoing_interceptors) - 0usize];
    ["Offset of field: aeron_udp_channel_data_paths_stct::incoming_interceptors"]
        [::std::mem::offset_of!(aeron_udp_channel_data_paths_stct, incoming_interceptors) - 8usize];
    ["Offset of field: aeron_udp_channel_data_paths_stct::send_func"]
        [::std::mem::offset_of!(aeron_udp_channel_data_paths_stct, send_func) - 16usize];
    ["Offset of field: aeron_udp_channel_data_paths_stct::recv_func"]
        [::std::mem::offset_of!(aeron_udp_channel_data_paths_stct, recv_func) - 24usize];
};
impl Default for aeron_udp_channel_data_paths_stct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_udp_channel_transport_recv_func_holder_stct {
    pub func: aeron_udp_transport_recv_func_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_udp_channel_transport_recv_func_holder_stct"]
        [::std::mem::size_of::<aeron_udp_channel_transport_recv_func_holder_stct>() - 8usize];
    ["Alignment of aeron_udp_channel_transport_recv_func_holder_stct"]
        [::std::mem::align_of::<aeron_udp_channel_transport_recv_func_holder_stct>() - 8usize];
    ["Offset of field: aeron_udp_channel_transport_recv_func_holder_stct::func"]
        [::std::mem::offset_of!(aeron_udp_channel_transport_recv_func_holder_stct, func) - 0usize];
};
pub type aeron_udp_channel_transport_recv_func_holder_t =
    aeron_udp_channel_transport_recv_func_holder_stct;
unsafe extern "C" {
    pub fn aeron_udp_channel_transport_recv_func_holder_close(
        holder: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_udp_channel_incoming_interceptor_recv_func(
        data_paths: *mut aeron_udp_channel_data_paths_t,
        transport: *mut aeron_udp_channel_transport_t,
        receiver_clientd: *mut ::std::os::raw::c_void,
        endpoint_clientd: *mut ::std::os::raw::c_void,
        destination_clientd: *mut ::std::os::raw::c_void,
        buffer: *mut u8,
        length: usize,
        addr: *mut sockaddr_storage,
        media_timestamp: *mut timespec,
    );
}
unsafe extern "C" {
    pub fn aeron_udp_channel_data_paths_init(
        data_paths: *mut aeron_udp_channel_data_paths_t,
        outgoing_interceptor_bindings: *mut aeron_udp_channel_interceptor_bindings_t,
        incoming_interceptor_bindings: *mut aeron_udp_channel_interceptor_bindings_t,
        media_bindings: *mut aeron_udp_channel_transport_bindings_t,
        recv_func: aeron_udp_transport_recv_func_t,
        context: *mut aeron_driver_context_t,
        affinity: aeron_udp_channel_transport_affinity_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aeron_udp_channel_data_paths_delete(
        data_paths: *mut aeron_udp_channel_data_paths_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_frame_header_stct {
    pub frame_length: i32,
    pub version: i8,
    pub flags: u8,
    pub type_: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_frame_header_stct"][::std::mem::size_of::<aeron_frame_header_stct>() - 8usize];
    ["Alignment of aeron_frame_header_stct"]
        [::std::mem::align_of::<aeron_frame_header_stct>() - 4usize];
    ["Offset of field: aeron_frame_header_stct::frame_length"]
        [::std::mem::offset_of!(aeron_frame_header_stct, frame_length) - 0usize];
    ["Offset of field: aeron_frame_header_stct::version"]
        [::std::mem::offset_of!(aeron_frame_header_stct, version) - 4usize];
    ["Offset of field: aeron_frame_header_stct::flags"]
        [::std::mem::offset_of!(aeron_frame_header_stct, flags) - 5usize];
    ["Offset of field: aeron_frame_header_stct::type_"]
        [::std::mem::offset_of!(aeron_frame_header_stct, type_) - 6usize];
};
pub type aeron_frame_header_t = aeron_frame_header_stct;
#[repr(C, packed(4))]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_data_header_as_longs_stct {
    pub hdr: [u64; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_data_header_as_longs_stct"]
        [::std::mem::size_of::<aeron_data_header_as_longs_stct>() - 32usize];
    ["Alignment of aeron_data_header_as_longs_stct"]
        [::std::mem::align_of::<aeron_data_header_as_longs_stct>() - 4usize];
    ["Offset of field: aeron_data_header_as_longs_stct::hdr"]
        [::std::mem::offset_of!(aeron_data_header_as_longs_stct, hdr) - 0usize];
};
pub type aeron_data_header_as_longs_t = aeron_data_header_as_longs_stct;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_setup_header_stct {
    pub frame_header: aeron_frame_header_t,
    pub term_offset: i32,
    pub session_id: i32,
    pub stream_id: i32,
    pub initial_term_id: i32,
    pub active_term_id: i32,
    pub term_length: i32,
    pub mtu: i32,
    pub ttl: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_setup_header_stct"][::std::mem::size_of::<aeron_setup_header_stct>() - 40usize];
    ["Alignment of aeron_setup_header_stct"]
        [::std::mem::align_of::<aeron_setup_header_stct>() - 4usize];
    ["Offset of field: aeron_setup_header_stct::frame_header"]
        [::std::mem::offset_of!(aeron_setup_header_stct, frame_header) - 0usize];
    ["Offset of field: aeron_setup_header_stct::term_offset"]
        [::std::mem::offset_of!(aeron_setup_header_stct, term_offset) - 8usize];
    ["Offset of field: aeron_setup_header_stct::session_id"]
        [::std::mem::offset_of!(aeron_setup_header_stct, session_id) - 12usize];
    ["Offset of field: aeron_setup_header_stct::stream_id"]
        [::std::mem::offset_of!(aeron_setup_header_stct, stream_id) - 16usize];
    ["Offset of field: aeron_setup_header_stct::initial_term_id"]
        [::std::mem::offset_of!(aeron_setup_header_stct, initial_term_id) - 20usize];
    ["Offset of field: aeron_setup_header_stct::active_term_id"]
        [::std::mem::offset_of!(aeron_setup_header_stct, active_term_id) - 24usize];
    ["Offset of field: aeron_setup_header_stct::term_length"]
        [::std::mem::offset_of!(aeron_setup_header_stct, term_length) - 28usize];
    ["Offset of field: aeron_setup_header_stct::mtu"]
        [::std::mem::offset_of!(aeron_setup_header_stct, mtu) - 32usize];
    ["Offset of field: aeron_setup_header_stct::ttl"]
        [::std::mem::offset_of!(aeron_setup_header_stct, ttl) - 36usize];
};
pub type aeron_setup_header_t = aeron_setup_header_stct;
#[repr(C, packed(4))]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_data_header_stct {
    pub frame_header: aeron_frame_header_t,
    pub term_offset: i32,
    pub session_id: i32,
    pub stream_id: i32,
    pub term_id: i32,
    pub reserved_value: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_data_header_stct"][::std::mem::size_of::<aeron_data_header_stct>() - 32usize];
    ["Alignment of aeron_data_header_stct"]
        [::std::mem::align_of::<aeron_data_header_stct>() - 4usize];
    ["Offset of field: aeron_data_header_stct::frame_header"]
        [::std::mem::offset_of!(aeron_data_header_stct, frame_header) - 0usize];
    ["Offset of field: aeron_data_header_stct::term_offset"]
        [::std::mem::offset_of!(aeron_data_header_stct, term_offset) - 8usize];
    ["Offset of field: aeron_data_header_stct::session_id"]
        [::std::mem::offset_of!(aeron_data_header_stct, session_id) - 12usize];
    ["Offset of field: aeron_data_header_stct::stream_id"]
        [::std::mem::offset_of!(aeron_data_header_stct, stream_id) - 16usize];
    ["Offset of field: aeron_data_header_stct::term_id"]
        [::std::mem::offset_of!(aeron_data_header_stct, term_id) - 20usize];
    ["Offset of field: aeron_data_header_stct::reserved_value"]
        [::std::mem::offset_of!(aeron_data_header_stct, reserved_value) - 24usize];
};
pub type aeron_data_header_t = aeron_data_header_stct;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_nak_header_stct {
    pub frame_header: aeron_frame_header_t,
    pub session_id: i32,
    pub stream_id: i32,
    pub term_id: i32,
    pub term_offset: i32,
    pub length: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_nak_header_stct"][::std::mem::size_of::<aeron_nak_header_stct>() - 28usize];
    ["Alignment of aeron_nak_header_stct"]
        [::std::mem::align_of::<aeron_nak_header_stct>() - 4usize];
    ["Offset of field: aeron_nak_header_stct::frame_header"]
        [::std::mem::offset_of!(aeron_nak_header_stct, frame_header) - 0usize];
    ["Offset of field: aeron_nak_header_stct::session_id"]
        [::std::mem::offset_of!(aeron_nak_header_stct, session_id) - 8usize];
    ["Offset of field: aeron_nak_header_stct::stream_id"]
        [::std::mem::offset_of!(aeron_nak_header_stct, stream_id) - 12usize];
    ["Offset of field: aeron_nak_header_stct::term_id"]
        [::std::mem::offset_of!(aeron_nak_header_stct, term_id) - 16usize];
    ["Offset of field: aeron_nak_header_stct::term_offset"]
        [::std::mem::offset_of!(aeron_nak_header_stct, term_offset) - 20usize];
    ["Offset of field: aeron_nak_header_stct::length"]
        [::std::mem::offset_of!(aeron_nak_header_stct, length) - 24usize];
};
pub type aeron_nak_header_t = aeron_nak_header_stct;
#[repr(C, packed(4))]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_status_message_header_stct {
    pub frame_header: aeron_frame_header_t,
    pub session_id: i32,
    pub stream_id: i32,
    pub consumption_term_id: i32,
    pub consumption_term_offset: i32,
    pub receiver_window: i32,
    pub receiver_id: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_status_message_header_stct"]
        [::std::mem::size_of::<aeron_status_message_header_stct>() - 36usize];
    ["Alignment of aeron_status_message_header_stct"]
        [::std::mem::align_of::<aeron_status_message_header_stct>() - 4usize];
    ["Offset of field: aeron_status_message_header_stct::frame_header"]
        [::std::mem::offset_of!(aeron_status_message_header_stct, frame_header) - 0usize];
    ["Offset of field: aeron_status_message_header_stct::session_id"]
        [::std::mem::offset_of!(aeron_status_message_header_stct, session_id) - 8usize];
    ["Offset of field: aeron_status_message_header_stct::stream_id"]
        [::std::mem::offset_of!(aeron_status_message_header_stct, stream_id) - 12usize];
    ["Offset of field: aeron_status_message_header_stct::consumption_term_id"]
        [::std::mem::offset_of!(aeron_status_message_header_stct, consumption_term_id) - 16usize];
    ["Offset of field: aeron_status_message_header_stct::consumption_term_offset"][::std::mem::offset_of!(
        aeron_status_message_header_stct,
        consumption_term_offset
    ) - 20usize];
    ["Offset of field: aeron_status_message_header_stct::receiver_window"]
        [::std::mem::offset_of!(aeron_status_message_header_stct, receiver_window) - 24usize];
    ["Offset of field: aeron_status_message_header_stct::receiver_id"]
        [::std::mem::offset_of!(aeron_status_message_header_stct, receiver_id) - 28usize];
};
pub type aeron_status_message_header_t = aeron_status_message_header_stct;
#[repr(C, packed(4))]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_error_stct {
    pub frame_header: aeron_frame_header_t,
    pub session_id: i32,
    pub stream_id: i32,
    pub receiver_id: i64,
    pub group_tag: i64,
    pub error_code: i32,
    pub error_length: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_error_stct"][::std::mem::size_of::<aeron_error_stct>() - 40usize];
    ["Alignment of aeron_error_stct"][::std::mem::align_of::<aeron_error_stct>() - 4usize];
    ["Offset of field: aeron_error_stct::frame_header"]
        [::std::mem::offset_of!(aeron_error_stct, frame_header) - 0usize];
    ["Offset of field: aeron_error_stct::session_id"]
        [::std::mem::offset_of!(aeron_error_stct, session_id) - 8usize];
    ["Offset of field: aeron_error_stct::stream_id"]
        [::std::mem::offset_of!(aeron_error_stct, stream_id) - 12usize];
    ["Offset of field: aeron_error_stct::receiver_id"]
        [::std::mem::offset_of!(aeron_error_stct, receiver_id) - 16usize];
    ["Offset of field: aeron_error_stct::group_tag"]
        [::std::mem::offset_of!(aeron_error_stct, group_tag) - 24usize];
    ["Offset of field: aeron_error_stct::error_code"]
        [::std::mem::offset_of!(aeron_error_stct, error_code) - 32usize];
    ["Offset of field: aeron_error_stct::error_length"]
        [::std::mem::offset_of!(aeron_error_stct, error_length) - 36usize];
};
pub type aeron_error_t = aeron_error_stct;
#[repr(C, packed(4))]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_status_message_optional_header_stct {
    pub group_tag: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_status_message_optional_header_stct"]
        [::std::mem::size_of::<aeron_status_message_optional_header_stct>() - 8usize];
    ["Alignment of aeron_status_message_optional_header_stct"]
        [::std::mem::align_of::<aeron_status_message_optional_header_stct>() - 4usize];
    ["Offset of field: aeron_status_message_optional_header_stct::group_tag"]
        [::std::mem::offset_of!(aeron_status_message_optional_header_stct, group_tag) - 0usize];
};
pub type aeron_status_message_optional_header_t = aeron_status_message_optional_header_stct;
#[repr(C, packed(4))]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_rttm_header_stct {
    pub frame_header: aeron_frame_header_t,
    pub session_id: i32,
    pub stream_id: i32,
    pub echo_timestamp: i64,
    pub reception_delta: i64,
    pub receiver_id: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_rttm_header_stct"][::std::mem::size_of::<aeron_rttm_header_stct>() - 40usize];
    ["Alignment of aeron_rttm_header_stct"]
        [::std::mem::align_of::<aeron_rttm_header_stct>() - 4usize];
    ["Offset of field: aeron_rttm_header_stct::frame_header"]
        [::std::mem::offset_of!(aeron_rttm_header_stct, frame_header) - 0usize];
    ["Offset of field: aeron_rttm_header_stct::session_id"]
        [::std::mem::offset_of!(aeron_rttm_header_stct, session_id) - 8usize];
    ["Offset of field: aeron_rttm_header_stct::stream_id"]
        [::std::mem::offset_of!(aeron_rttm_header_stct, stream_id) - 12usize];
    ["Offset of field: aeron_rttm_header_stct::echo_timestamp"]
        [::std::mem::offset_of!(aeron_rttm_header_stct, echo_timestamp) - 16usize];
    ["Offset of field: aeron_rttm_header_stct::reception_delta"]
        [::std::mem::offset_of!(aeron_rttm_header_stct, reception_delta) - 24usize];
    ["Offset of field: aeron_rttm_header_stct::receiver_id"]
        [::std::mem::offset_of!(aeron_rttm_header_stct, receiver_id) - 32usize];
};
pub type aeron_rttm_header_t = aeron_rttm_header_stct;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_resolution_header_stct {
    pub res_type: i8,
    pub res_flags: u8,
    pub udp_port: u16,
    pub age_in_ms: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_resolution_header_stct"]
        [::std::mem::size_of::<aeron_resolution_header_stct>() - 8usize];
    ["Alignment of aeron_resolution_header_stct"]
        [::std::mem::align_of::<aeron_resolution_header_stct>() - 1usize];
    ["Offset of field: aeron_resolution_header_stct::res_type"]
        [::std::mem::offset_of!(aeron_resolution_header_stct, res_type) - 0usize];
    ["Offset of field: aeron_resolution_header_stct::res_flags"]
        [::std::mem::offset_of!(aeron_resolution_header_stct, res_flags) - 1usize];
    ["Offset of field: aeron_resolution_header_stct::udp_port"]
        [::std::mem::offset_of!(aeron_resolution_header_stct, udp_port) - 2usize];
    ["Offset of field: aeron_resolution_header_stct::age_in_ms"]
        [::std::mem::offset_of!(aeron_resolution_header_stct, age_in_ms) - 4usize];
};
pub type aeron_resolution_header_t = aeron_resolution_header_stct;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_resolution_header_ipv4_stct {
    pub resolution_header: aeron_resolution_header_t,
    pub addr: [u8; 4usize],
    pub name_length: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_resolution_header_ipv4_stct"]
        [::std::mem::size_of::<aeron_resolution_header_ipv4_stct>() - 14usize];
    ["Alignment of aeron_resolution_header_ipv4_stct"]
        [::std::mem::align_of::<aeron_resolution_header_ipv4_stct>() - 1usize];
    ["Offset of field: aeron_resolution_header_ipv4_stct::resolution_header"]
        [::std::mem::offset_of!(aeron_resolution_header_ipv4_stct, resolution_header) - 0usize];
    ["Offset of field: aeron_resolution_header_ipv4_stct::addr"]
        [::std::mem::offset_of!(aeron_resolution_header_ipv4_stct, addr) - 8usize];
    ["Offset of field: aeron_resolution_header_ipv4_stct::name_length"]
        [::std::mem::offset_of!(aeron_resolution_header_ipv4_stct, name_length) - 12usize];
};
pub type aeron_resolution_header_ipv4_t = aeron_resolution_header_ipv4_stct;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aeron_resolution_header_ipv6_stct {
    pub resolution_header: aeron_resolution_header_t,
    pub addr: [u8; 16usize],
    pub name_length: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aeron_resolution_header_ipv6_stct"]
        [::std::mem::size_of::<aeron_resolution_header_ipv6_stct>() - 26usize];
    ["Alignment of aeron_resolution_header_ipv6_stct"]
